&НаКлиенте
Процедура ОбработкаОбъектКатегорииКатегорииОбъектаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура перезаполняет таблицу свойств и значений
//
&НаСервере
Процедура ПрочитатьЗаполнитьСвойстваИЗначения(ОбъектОтбораЗначений, НазначениеСвойств)

	ОбработкаОбъект = РеквизитФормыВЗначение("ОбработкаОбъектЗначенияСвойств");
	ОбработкаОбъект.НазначениеСвойств      = НазначениеСвойств;
	ОбработкаОбъект.ОбъектОтбораЗначений   = ОбъектОтбораЗначений;
	ОбработкаОбъект.ОбъектОтбораНазначений = ОбъектОтбораЗначений;
	ОбработкаОбъект.ПрочитатьЗаполнитьСвойстваИЗначения();

	ЗначениеВРеквизитФормы(ОбработкаОбъект, "ОбработкаОбъектЗначенияСвойств");
	
КонецПроцедуры

// Процедура перезаполняет таблицу категорий
//
&НаСервере
Процедура ПрочитатьЗаполнитьКатегории(ОбъектОтбораЗначений)

	ОбработкаОбъект = РеквизитФормыВЗначение("ОбработкаОбъектКатегории");
	ОбработкаОбъект.ОбъектОтбораКатегорий = ОбъектОтбораЗначений;
	ОбработкаОбъект.ПрочитатьЗаполнитьКатегорииОбъекта();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "ОбработкаОбъектКатегории");
	
КонецПроцедуры //
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОтбораЗначений = Параметры.ОбъектОтбораЗначений;
	НазначениеСвойств = Неопределено;
	Если Параметры.Свойство("НазначениеСвойств") Тогда
		НазначениеСвойств = Параметры.НазначениеСвойств;
	КонецЕсли; 
	
	ПрочитатьЗаполнитьСвойстваИЗначения(Параметры.ОбъектОтбораЗначений, НазначениеСвойств);
	ПрочитатьЗаполнитьКатегории(Параметры.ОбъектОтбораЗначений);
	
КонецПроцедуры

