
&НаКлиенте
Процедура ВыгрузитьАпдекс(Команда)
	ВыгрузитьСервер();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСервер()
	APDEX_ОценкаПроизводительностиСерверВызовСервера.ВыгрузитьAPDEX();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("РегистрСведений.APDEX_Настройки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВебСервиса(Команда)
	Ошибка = "";
	
	ВызватьВебСервис(Ошибка);
	
	Если Ошибка = "" Тогда
		Предупреждение("Соединение с веб-сервисом успешно установленно!");
	Иначе
		Предупреждение("Не удалось соединиться с веб-сервисом!!!");
		Сообщить(Ошибка);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВызватьВебСервис(Ошибка)
	Ошибка = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПроверкаВебСервиса();
КонецПроцедуры


&НаКлиенте
Процедура ОчисткаЛоговОтправки(Команда)
	ОчисткаЛоговНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчисткаЛоговНаСервере()
	Набор = РегистрыСведений.APDEX_ЛогОтправкиДанных.СоздатьНаборЗаписей();
	Набор.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьДляМониторинга(Команда)
	APDEX_Мониторинг.APDEX_ВыгрузкаВМониторинг();
КонецПроцедуры

