Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
	//Смартис Лиманчук начало 03.08.2012
//Процедура ВыполнитьДвижения() Экспорт
Процедура ВыполнитьДвижения(Отказ=Ложь) Экспорт
	
	ПустаяСтрокаДДС = мТаблицаДвижений.Найти(Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка(),"СтатьяДвиженияДенежныхСредств");
	Если ПустаяСтрокаДДС <> Неопределено Тогда
		Если мПериод >= '20120801000000' Тогда //дата включения контроля
			Сообщить("Не выбрана статья движения денежных средств!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Смартис Лиманчук окончание 03.08.2012
	
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

КонецПроцедуры // ВыполнитьДвижения()
