&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним список настроек
	Пользователь = глЗначениеПеременной("глТекущийПользователь");
	КлючОбъекта  = ХранилищаНастроек.ДанныеФорм.СократитьКлючОбъекта(Параметры.КлючОбъекта);
	СписокНастроек.Загрузить(ХранилищаНастроек.ДанныеФорм.НастройкиПользователя(Пользователь, КлючОбъекта));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Новый ВыборНастроек(СписокНастроек[ВыбраннаяСтрока].Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.СписокНастроек.ТекущаяСтрока <> Неопределено Тогда 
		
		// Из текущей строки получим ключ настройки
		ВыбраннаяСтрока = Элементы.СписокНастроек.ТекущиеДанные;
		Закрыть(Новый ВыборНастроек(ВыбраннаяСтрока.Ссылка));
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
