// Процедура управляет доступностью ЭУ в форме
//
// Параметры
//  нет
//
&НаКлиенте
Процедура УправлениеДиалогом()
	
	Если Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") 
	   И Объект.ХарактерЗатрат = ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Элементы.СтатусМатериальныхЗатрат.Доступность = Истина;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Объект.СтатусМатериальныхЗатрат.Пустая();
	Иначе
		Элементы.СтатусМатериальныхЗатрат.Доступность = Ложь;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()

// Процедура обработчик события "ПриИзменении" реквизита "ВидЗатрат".
&НаКлиенте
Процедура ВидЗатратПриИзменении(Элемент)
	
	Если НЕ Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ВидЗатратПриИзменении()

// Процедура обработчик события "ПриИзменении" реквизита "ХарактерЗатрат".
&НаКлиенте
Процедура ХарактерЗатратПриИзменении(Элемент)
	
	Если Объект.ХарактерЗатрат <> ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ХарактерЗатратПриИзменении()

// Обработчик события ПриОткрытии Формы.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДиалогом();
	ПоказатьСправкуСтатьяДекларации();
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеСтатьиДекларации(СтатьяДекларацииПоНалогуНаПрибыль)
	Возврат СтатьяДекларацииПоНалогуНаПрибыль.Описание;
КонецФункции // ПолучитьОписаниеСтатьиДекларации()

&НаКлиенте
Процедура ПоказатьСправкуСтатьяДекларации()
	НадписьСправкаСтатья = ПолучитьОписаниеСтатьиДекларации(Объект.СтатьяДекларацииПоНалогуНаПрибыль);
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДекларацииПоНалогуНаПрибыльПриИзменении(Элемент)
	ПоказатьСправкуСтатьяДекларации();
КонецПроцедуры

