&НаКлиенте
Процедура УстановитьДоступность()
	
	РозницаНТТ = ПроверитьВидСклада();
	Элементы.ТипЦенРозничнойТорговли.АвтоОтметкаНезаполненного = РозницаНТТ;

	Если Не РозницаНТТ Тогда
		Элементы.ТипЦенРозничнойТорговли.ОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьВидСклада()
	Если Объект.ВидСклада = Перечисления.ВидыСкладов.Розничный ИЛИ Объект.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидСкладаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры
