// Этот модуль предназачен для реализации алгоритмов работы форм и 
// содержит процедуры и функции работы с формами и элементами форм,
// а также подготовки данных для представления информации в формах.
// Временно присутствует секция поддержки формирования печатных форм.

#Если ТолстыйКлиентОбычноеПриложение Тогда

// Процедура вызывается в обработчике события "Начало выбора" в форме документов.
// Выполняет выбор даты курса и устанавливает переданный курс по выбранной дате.
//
// Параметры:
//  Курс   - число, курс валюты, который надо установить;
//  Валюта - ссылка на справочник, определяет валюту чей курс надо выбрать;
//  Дата   - дата, дата курса по умолчанию.
//
Процедура ВыбратьКурсВалюты(Курс, Кратность, Валюта, Дата) Экспорт

	// Если не заполнена валюта, то курс выбрать нельзя.
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Предупреждение("Для выбора курса нужно выбрать валюту."); 
		Возврат;
	КонецЕсли; 
	
	// Выберем дату курса
	ДатаУстановкиКурса = Дата; 
	Если ВвестиДату(ДатаУстановкиКурса, "Выберите дату установки курса.", ЧастиДаты.Дата) Тогда
		
		// Если дата введена, заполним значение курса и кратности
		СтруктураВалюты = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, ДатаУстановкиКурса);
		Курс            = СтруктураВалюты.Курс;
		Кратность       = СтруктураВалюты.Кратность;

	КонецЕсли; 

КонецПроцедуры // ВыбратьКурсВалюты()

// Активизирует один из реквизитов при открытии документа.
//
// Параметры:
//  ДокументОбъект     - объект документа, 
//  ФормаДокумента     - форма документа.
//
Функция АктивизироватьРеквизитВФормеЗУП(ДокументОбъект, ФормаДокумента, СтруктураРеквизитов = Неопределено) Экспорт

	// Структура - порядок актиизации реквизитов.
	// Активизируется первый не заполненный.
	Если ТипЗнч(СтруктураРеквизитов) <> Тип("Структура") Тогда
		СтруктураРеквизитов = Новый Структура;
		
		СтруктураРеквизитов.Вставить("Дата");
		ЭлементУправления = ФормаДокумента.ЭлементыФормы.Найти("Номер");
		Если ЭлементУправления <> Неопределено И Не ЭлементУправления.ТолькоПросмотр Тогда
			СтруктураРеквизитов.Вставить("Номер");
		КонецЕсли;
		СтруктураРеквизитов.Вставить("Организация");
		СтруктураРеквизитов.Вставить("ПериодРегистрации");
		СтруктураРеквизитов.Вставить("Сотрудник");
		СтруктураРеквизитов.Вставить("ФизЛицо");
		СтруктураРеквизитов.Вставить("Исполнитель");
		СтруктураРеквизитов.Вставить("КурсОбучения");
		СтруктураРеквизитов.Вставить("ДатаЗавершенияКурса");
		СтруктураРеквизитов.Вставить("Мероприятие");
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураРеквизитов Цикл
		// Определим, есть ли ЭУ с таким именем.
		ЭлементУправления = ФормаДокумента.ЭлементыФормы.Найти(Элемент.Ключ);
		Если ЭлементУправления = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭлементУправления.Значение) Тогда
			// Нашли не заполненный ЭУ. Делаем его текущим и прекращаем цикл.
			ФормаДокумента.ТекущийЭлемент = ЭлементУправления;
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции // АктивизироватьРеквизитВФорме()

// Формирует и устанавливает текст заголовка формы документа
//
// Параметры:
//  СтрокаВидаОперации - строка вида операции документа, 
//  ДокументОбъект     - объект документа, 
//  ФормаДокумента     - форма документа.
//
Процедура УстановитьЗаголовокФормыДокумента(СтрокаВидаОперации = "", ДокументОбъект, ФормаДокумента) Экспорт

	ФормаДокумента.АвтоЗаголовок = Ложь; // заголовок будем писать сами
	
	Если ПустаяСтрока(СтрокаВидаОперации) Тогда
		Заголовок = ДокументОбъект.Метаданные().Синоним + ": ";
	Иначе
		Заголовок = ДокументОбъект.Метаданные().Синоним + ": " + СтрокаВидаОперации + ". ";
	КонецЕсли;
		
	Если ДокументОбъект.ЭтоНовый() Тогда  
		Заголовок = Заголовок + "Новый";
	Иначе
		Если ДокументОбъект.Проведен Тогда
			Заголовок = Заголовок + "Проведен";
		ИначеЕсли ДокументОбъект.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			Заголовок = Заголовок + "Не проведен";
		Иначе
			Заголовок = Заголовок + "Записан";
		КонецЕсли;
	КонецЕсли;
	
	ФормаДокумента.Заголовок = Заголовок;

КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Устанавливает видимость переданных колонок в табличной части документа.
//
// Параметры:
//  КолонкиТабПоля   - коллекция колонок табличного поля,
//  СтруктураКолонок - структура, содержащая имена колонок, видимость которых надор установить,
//  ПризнакВидимости - булево, признак видимости.
//
Процедура УстановитьВидимостьКолонок(КолонкиТабПоля, СтруктураКолонок, ПризнакВидимости) Экспорт

	Если ПризнакВидимости Тогда
		Для Каждого ТекКолонка из СтруктураКолонок Цикл
			ИмяКолонки                                   = ТекКолонка.Ключ;
			КолонкиТабПоля[ИмяКолонки].ИзменятьВидимость = Истина;
		КонецЦикла;
	Иначе
		Для Каждого ТекКолонка из СтруктураКолонок Цикл
			ИмяКолонки                                   = ТекКолонка.Ключ;
			КолонкиТабПоля[ИмяКолонки].ИзменятьВидимость = Ложь;
			КолонкиТабПоля[ИмяКолонки].Видимость         = Ложь;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьКолонок()

// Процедура устанавливает отбор по основной организации в указанно форме
//
Процедура УстановитьОтборПоОрганизации(Форма, УчетПоВсемОрганизациям, ОсновнаяОрганизация, ИмяРеквизитаСписка, СкрыватьКолонку = Истина, ИмяОтбора = "Организация") Экспорт

	// В том случае если учет ведется по одной организации необходимо установить мягкий отбор.
	// т.е. отбор, с возможностью его изменения.

	Если НЕ УчетПоВсемОрганизациям Тогда // Установлен режим учета по одной организации

		Если НЕ (ТипЗнч(Форма[ИмяРеквизитаСписка]) = Тип("ТаблицаЗначений")) Тогда // Элемент - табличное поле

			// Проверим - Если это связанный регитср сведений тогда не нужно устанавливать отбор - 
			// он уже установлен системой автоматически

			Если ИмяРеквизитаСписка = "РегистрСведенийСписок" Тогда

				// Возвможно это переход по кнопке ПЕрейти
				Если ТипЗнч(Форма.ПараметрОтборПоИзмерению) = Тип("Структура") Тогда
					Если ЗначениеЗаполнено(Форма.ПараметрОтборПоИзмерению) Тогда
						Возврат; // Это переход по кнопке Перейти - не нужно устанавливать отбор
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;

			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].ВидСравнения  = ВидСравнения.Равно;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Использование = Истина;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Значение      = ОсновнаяОрганизация;

			Форма.ЭлементыФормы[ИмяРеквизитаСписка].НастройкаОтбора[ИмяОтбора].Доступность = Ложь;

		КонецЕсли;

		Если СкрыватьКолонку Тогда

			Если НЕ Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки.Найти(ИмяОтбора) = Неопределено Тогда

				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].Видимость         = Ложь;
				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].ИзменятьВидимость = Ложь;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // УстановитьОтборПоОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ГПУ ВВОДА ДАННЫХ

Процедура УстановитьСписокПоляВыбора(ПолеВыбора, Список) Экспорт

	ПрошлоеЗначение = ПолеВыбора.Значение;
	ПолеВыбора.СписокВыбора = Список;
	Если ЗначениеЗаполнено(ПрошлоеЗначение) Тогда
		Если  Список.НайтиПоЗначению(ПрошлоеЗначение) <> Неопределено Тогда
			Если НЕ ПолеВыбора.Значение = ПрошлоеЗначение Тогда
				ПолеВыбора.Значение = ПрошлоеЗначение;
			КонецЕсли;
		Иначе
			ПолеВыбора.Значение = Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры // УстановитьСписокПоляВыбора()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ИНФОРМАЦИИ В ФОРМЕ

// Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Процедура ПроверитьНомерДокумента(ДокументОбъект, НачальнаяДатаДокумента) Экспорт   // в разработке

	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;

	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);

	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);

	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);

	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачалоДня(НачальнаяДатаДокумента) - НачалоДня(ДокументОбъект.Дата);

	Иначе
		Возврат;

	КонецЕсли;

	Если РазностьДат <> 0 Тогда
		ДокументОбъект.Номер = "";
	КонецЕсли;

КонецПроцедуры // ПроверитьНомерДокумента()

// Функция спрашивает пользователя записать ли объект, или нет, если он новый
//
// Параметры
//  ФормаОбъекта - Форма объекта, из которой пытаются произвести действия
//
// Возвращаемое значение:
//   Булево - Объект записан или нет
//
Функция ЗаписатьНовыйОбъектВФорме(ФормаОбъекта) Экспорт

	Если ФормаОбъекта.ЭтоНовый() Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ФормаОбъекта.ЭтотОбъект.Ссылка)) Тогда
			ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать?";
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Возврат ФормаОбъекта.ЗаписатьВФорме();
			Исключение
				Сообщить(ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки()));
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли; 

КонецФункции // ЗаписатьНовыйОбъектВФорме()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДГОТОВКИ ИНФОРМАЦИИ В ФОРМЕ

// Процедура возвращает паспортные данные физлица в виде строки
//
// Параметры: 
//  Валюта                         - Валюта, курс которой необходимо отобразить
//  Курс                           - курс, которой необходимо отобразить
//  Кратность                      - кратность, которую необходимо отобразить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  СформироватьСкобки             - признак необходимости скобок
//
// Возвращаемое значение:
//  Строка с данными о курсе и кратности валюты
//
Функция ПолучитьИнформациюКурсаВалютыСтрокой(Валюта, Курс, Кратность, ВалютаРегламентированногоУчета, СформироватьСкобки = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Возврат "";

	Иначе
		Возврат ?(СформироватьСкобки, "(", "") + Кратность + " "
		      + СокрЛП(Валюта)
		      + " = "
		      + Курс + " " 
		      + СокрЛП(ВалютаРегламентированногоУчета)
		      + ?(СформироватьСкобки, ")", "");
	КонецЕсли;

КонецФункции // ПолучитьИнформациюКурсаВалютыСтрокой()

// Заполняет список пунктов подменю выбора вида операции значениями переданной коллекции объектов метаданных,
// соответствующей перечислению видов операций для данного документа.
// Всем кнопкам назначается одно переданное действие.
// Обычно используется для заполнения пунктов подменю "ПодменюВидаОперации" командной панели
// формы документа значениями перечисления "Вид операции" для данного вида документа
//
// Параметры:
//  ЭлементМеню                   - кнопка командной панели формы, соответствующая подменю, которое надо заполнить, 
//  ОбъектЗаполнения              - коллекция для заполнения пунктов подменю, 
//  ОбъектОбработкиВыбораОперации - действие, которое надо выполнить при выборе любого пункта подменю.
//
Процедура УстановитьПодменюВыбораВидаОперации(ЭлементМеню, ОбъектЗаполнения, ОбъектОбработкиВыбораОперации) Экспорт

	Для Каждого ЭлементЗаполнения Из ОбъектЗаполнения Цикл
		Если Лев(ЭлементЗаполнения.Имя,7) = "Удалить" Тогда
			Продолжить;
		КонецЕсли;
		ПунктМеню = ЭлементМеню.Кнопки.Добавить(ЭлементЗаполнения.Имя, ТипКнопкиКоманднойПанели.Действие, 
		                                        ЭлементЗаполнения.Синоним, ОбъектОбработкиВыбораОперации);
		ПунктМеню.ИзменяетДанные = Истина;
	КонецЦикла;

КонецПроцедуры // УстановитьПодменюВыбораВидаОперации()

// Процедура вызывается формирования кнопки "Подбор" для формы видов расчетов Планов Видов Расчетов.
//
// Параметры:
//  СсылкаПВР 	   	   - ссылка на ПВР;
//  ФормаЭлемента 	   - Форма вида расчета.
//  ВедущиеВидыРасчета - булево, Истина - если нужно формировать кнопку в командной
//						 панели ТЧ "ВедущиеВидыРасчета".
//
Процедура СоздатьКнопкуПодбораДляПВР(СсылкаПВР, ФормаЭлемента, ВедущиеВидыРасчета = Ложь, ЯвляетсяБазойДля = Ложь) Экспорт

	МассивДоступныхТипов = Новый Массив;
	
	КоллекцияБазовыхВидовРасчета = Метаданные.ПланыВидовРасчета[СсылкаПВР.Метаданные().Имя].БазовыеВидыРасчета;
	
	Если КоллекцияБазовыхВидовРасчета.Количество() > 1 Тогда
		
		ФормаЭлемента.ЭлементыФормы.КоманднаяПанельБазовыеВидыРасчета.Кнопки.Подбор.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю;
		
		Если ВедущиеВидыРасчета Тогда
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельВедущиеВидыРасчета.Кнопки.Подбор.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю;
		КонецЕсли;
		
		Для Каждого СтрокаКолекции Из КоллекцияБазовыхВидовРасчета Цикл
			
			ДействиеПоКнопке = Новый Действие("КоманднаяПанельБазовыеВидыРасчетаПодборПодМеню");
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельБазовыеВидыРасчета.Кнопки.Подбор.Кнопки.Добавить(СтрокаКолекции.Имя, ТипКнопкиКоманднойПанели.Действие, СтрокаКолекции.Синоним, ДействиеПоКнопке);
			
			Если ВедущиеВидыРасчета Тогда
				
				ДействиеПоКнопке = Новый Действие("КоманднаяПанельВедущиеВидыРасчетаПодМеню");
				ФормаЭлемента.ЭлементыФормы.КоманднаяПанельВедущиеВидыРасчета.Кнопки.Подбор.Кнопки.Добавить(СтрокаКолекции.Имя, ТипКнопкиКоманднойПанели.Действие, СтрокаКолекции.Синоним, ДействиеПоКнопке);
				
				МассивДоступныхТипов.Добавить(Тип("ПланВидовРасчетаСсылка." + СтрокаКолекции.Имя));
				
			КонецЕсли;
			
		КонецЦикла; 
		
	Иначе
		
		ДействиеПоКнопке = Новый Действие("КоманднаяПанельБазовыеВидыРасчетаПодбор");
		ФормаЭлемента.ЭлементыФормы.КоманднаяПанельБазовыеВидыРасчета.Кнопки.Подбор.ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
		ФормаЭлемента.ЭлементыФормы.КоманднаяПанельБазовыеВидыРасчета.Кнопки.Подбор.Действие  = ДействиеПоКнопке;
		
		Если ВедущиеВидыРасчета Тогда
			
			ДействиеПоКнопке = Новый Действие("КоманднаяПанельВедущиеВидыРасчетаПодбор");
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельВедущиеВидыРасчета.Кнопки.Подбор.Действие = ДействиеПоКнопке;
			
			Для Каждого СтрокаКолекции Из КоллекцияБазовыхВидовРасчета Цикл
				
				МассивДоступныхТипов.Добавить(Тип("ПланВидовРасчетаСсылка." + СтрокаКолекции.Имя));
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ВедущиеВидыРасчета Тогда
		
		ФормаЭлемента.ЭлементыФормы.ВедущиеВидыРасчета.Колонки.ВидРасчета.ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов(МассивДоступныхТипов);
		Если КоллекцияБазовыхВидовРасчета.Количество() = 1 Тогда
			ФормаЭлемента.ЭлементыФормы.ВедущиеВидыРасчета.Колонки.ВидРасчета.ЭлементУправления.ВыбиратьТип = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЯвляетсяБазойДля Тогда
		
		// получим список ПВР для которых мы базовые
		ЭталонныйПВР = СсылкаПВР.Метаданные().Имя;
		СтруктураДоступныхТипов = Новый Структура;
		Для каждого ТекПВР Из Метаданные.ПланыВидовРасчета Цикл
			Если Найти(ТекПВР.Имя,"Удалить") <> 0 Тогда
				Продолжить;
			КонецЕсли;	
			Для каждого ТекБазовыйПВР Из ТекПВР.БазовыеВидыРасчета Цикл
				Если ТекБазовыйПВР.Имя = ЭталонныйПВР Тогда
					СтруктураДоступныхТипов.Вставить(ТекПВР.Имя, ТекПВР.Синоним);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		//	Если элемент один тогда кнопка сама должна выполнять действие 
		//	если несколько надо выдавать список
		
		Если СтруктураДоступныхТипов.Количество() = 1 Тогда
			
			ДействиеПоКнопке = Новый Действие("КоманднаяПанельЯвляетсяБазойДляПодбор");
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельЯвляетсяБазойДля.Кнопки.Подбор.ТипКнопки = ТипКнопкиКоманднойПанели.Действие;
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельЯвляетсяБазойДля.Кнопки.Подбор.Действие  = ДействиеПоКнопке;
			
			ФормаЭлемента.ЭлементыФормы.ЯвляетсяБазойДля.Колонки.ВидРасчета.ЭлементУправления.ВыбиратьТип = Ложь;
			ФормаЭлемента.ЭлементыФормы.ЯвляетсяБазойДля.Колонки.ВидРасчета.ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов(СтруктураДоступныхТипов);
			
		Иначе	
			
			МассивДоступныхТипов = Новый Массив;
			ФормаЭлемента.ЭлементыФормы.КоманднаяПанельЯвляетсяБазойДля.Кнопки.Подбор.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю;
			
			Для каждого СтрокаКолекции Из СтруктураДоступныхТипов Цикл
				
				ДействиеПоКнопке = Новый Действие("КоманднаяПанельЯвляетсяБазойДляПодМеню");
				ФормаЭлемента.ЭлементыФормы.КоманднаяПанельЯвляетсяБазойДля.Кнопки.Подбор.Кнопки.Добавить(СтрокаКолекции.Ключ, ТипКнопкиКоманднойПанели.Действие, СтрокаКолекции.Значение, ДействиеПоКнопке);
				МассивДоступныхТипов.Добавить(Тип("ПланВидовРасчетаСсылка." + СтрокаКолекции.Ключ));
				
			КонецЦикла;
			
			ФормаЭлемента.ЭлементыФормы.ЯвляетсяБазойДля.Колонки.ВидРасчета.ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов(МассивДоступныхТипов);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
КонецПроцедуры // СоздатьКнопкуПодбораДляПВР()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ и ФУНКЦИИ ИНФОРМИРОВАНИЯ ПОЛЬЗОВАТЕЛЯ

// Проверяет модифицированность документа перед печатью, и если необходимо 
// записывает его
// 
// Параметры
//  Документ - (ДокументОбъект.*) - проверяемый документ
//
Функция ПроверитьМодифицированность(Документ) Экспорт
	
	Результат = Ложь;
	
	Если Документ.Модифицированность() Тогда
		
		Проведен = ?(Документ.Проведен, " и провести","");
		
		Ответ = ЗадатьВопрос("Документ изменен. Для печати его необходимо записать"+ Проведен +"." + Символы.ПС + "Записать" + Проведен + "?", РежимДиалогаВопрос.ОКОтмена, КодВозвратаДиалога.Отмена, "Документ изменен");
		
		Если Ответ = КодВозвратаДиалога.ОК Или Ответ = КодВозвратаДиалога.Таймаут Тогда
			
			Если Документ.Проведен Тогда
				
				ДатаДока = НачалоДня(Документ.Дата);
				ДатаДня  = НачалоДня(ТекущаяДата());
				
				Попытка
					
					Если ДатаДока = ДатаДня и Документ.Метаданные().ОперативноеПроведение = Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
						Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
					Иначе
						Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					КонецЕсли;
					
				Исключение
					
					ВывестиПредупреждение("Операция не выполнена!");
					Возврат Результат = Истина;
					
				КонецПопытки;
				
			Иначе
				Документ.Записать();
			КонецЕсли;
			
			Результат = Истина;
			
		КонецЕсли;
		
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверитьМодифицированность()

// Проверяет модифицированность документа / справочника перед печатью, и если необходимо 
// записывает его
// 
// Параметры
//  Объект - (ДокументОбъект.*, СправочникОбъект.*) - проверяемый документ / справочник
//  Форма    - форма проверяемого документа / справочника
//
Функция ПроверитьМодифицированностьВФорме(Объект, Форма) Экспорт
	
	Результат = Ложь;
	
	Если Форма.Модифицированность Тогда
		
		Проведен    = Метаданные.Документы.Содержит(Объект.Метаданные()) И Объект.Проведен;
		СтрПроведен = ?(Проведен, " и провести","");
		
		Ответ = ЗадатьВопрос("Документ изменен. Для печати его необходимо записать "+ СтрПроведен +".
		|Записать" + СтрПроведен + "?",
		РежимДиалогаВопрос.ОКОтмена, 
		КодВозвратаДиалога.Отмена,
		"Документ изменен");
		
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			
			Если Проведен Тогда
				
				Попытка
					
					Отказ = Не Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
					
				Исключение
					
					ВывестиПредупреждение("Операция не выполнена!");
					Возврат Результат = Истина;
					
				КонецПопытки;
				
				Если Отказ Тогда
					Возврат Результат = Истина;
				КонецЕсли;
			Иначе
				Отказ = Не Форма.ЗаписатьВФорме();
				Если Отказ Тогда
					Возврат Результат = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Результат = Истина;
			
		КонецЕсли;
		
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверитьМодифицированность()

// Процедура вызывается для вывода сообщений пользователю
//
// Параметры:
//  СсылкаСправочника - ссылка на справочник, объект которого проверяется;
//  ИмяРеквизита - строка, имя реквизита, который не заполнен.
//
Процедура СообщитьПользователюНезаполненРеквизит(СсылкаСправочника, ИмяРеквизита) Экспорт

	ТекстСообщения = "Перед записью в элементе справочника """ + СсылкаСправочника.Метаданные().Синоним + """ необходимо заполнить """ + ИмяРеквизита + """!";

	Сообщить(ТекстСообщения, СтатусСообщения.Важное);

КонецПроцедуры // СообщитьПользователюНезаполненРеквизит()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ ДОКУМЕНТОВ

// Процедура выполняет открытие формы работы со свойствами документа
//
// Параметры:
//  ДокументОбъект - объект редактируемого документа,
//  ФормаДокумента - форма редактируемого документа
//
Процедура ОткрытьСвойстваДокумента(ДокументОбъект, ФормаДокумента) Экспорт

	Если ДокументОбъект.ЭтоНовый() Тогда
		Вопрос = "Перед началом работы со свойствами необходимо записать документ. Записать?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);

		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ФормаДокумента.ЗаписатьВФорме();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Форма = Обработки.ЗначенияСвойствОбъекта.ПолучитьФорму("ЗначенияСвойствОбъекта", ФормаДокумента, ДокументОбъект.Ссылка);

	Форма.НазначениеСвойств      = ОбщегоНазначения.ПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке(ДокументОбъект.Ссылка);
	Форма.ОбъектОтбораЗначений   = ДокументОбъект.Ссылка;
	Форма.ОбъектОтбораНазначений = ДокументОбъект.Ссылка;

	Форма.ПрочитатьЗаполнитьСвойстваИЗначения();
	Форма.Открыть();

КонецПроцедуры // ОткрытьСвойстваДокумента()

// Процедура выполняет открытие формы работы с категориями документа
//
// Параметры:
//  ДокументОбъект - объект редактируемого документа,
//  ФормаДокумента - форма редактируемого документа
//
Процедура ОткрытьКатегорииДокумента(ДокументОбъект, ФормаДокумента) Экспорт

	Если ДокументОбъект.ЭтоНовый() Тогда
		Вопрос = "Перед началом работы с категориями необходимо записать документ. Записать?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);

		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ФормаДокумента.ЗаписатьВФорме();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Форма = Обработки.КатегорииОбъекта.ПолучитьФорму("КатегорииОбъекта", ФормаДокумента, ДокументОбъект.Ссылка);

	Форма.ОбъектОтбораКатегорий = ФормаДокумента.Ссылка;

	Форма.ПрочитатьЗаполнитьКатегорииОбъекта();
	Форма.Открыть();

КонецПроцедуры // ОткрытьКатегорииДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ИСТОРИЕЙ ВВОДА ЗНАЧЕНИЙ

// Функция по для переданной строке пути возвращает список заполненных значений
//
// Параметры
//  Путь - Строка .с указанием объекта метаданных и поля ввода 
// сокращением
//
// Возвращаемые значения
//  Возвращается список значений с историей ввода в это поле
//
Функция ПолучитьСписокИсторииВвода(Путь) Экспорт

	СтрокаИстории = ВосстановитьЗначение(Путь);

	Если СтрокаИстории = Неопределено Тогда
		Возврат Новый СписокЗначений();
	КонецЕсли;
	
	СохранятьСписокИстории = Ложь;

	СписокИстории = ЗначениеИзСтрокиВнутр(СтрокаИстории);
	ТипСписокЗначений = Тип("СписокЗначений");
	ТипЗначенияЭлементов = Неопределено;

	Если ТипЗнч(СписокИстории) = Тип("СписокЗначений") Тогда
		
		КолвоЭлементовКоллекции = СписокИстории.Количество(); 
		Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл 
		     ЭлементСписка = СписокИстории[КолвоЭлементовКоллекции - ОбратныйИндекс];
			 Если ТипЗнч(ЭлементСписка.Значение) <> Тип("Строка") Тогда
				СписокИстории.Удалить(ЭлементСписка);
				СохранятьСписокИстории = Истина;
				Продолжить;
			КонецЕсли;
			ЗначениеЭлементаСписка = ЗначениеИзСтрокиВнутр(ЭлементСписка.Значение);
			Если ТипЗнч(ЗначениеЭлементаСписка) = ТипСписокЗначений Тогда												
				ЗначениеЭлементаСписка = ЗначениеЭлементаСписка[0].Значение;
				Если ТипЗнч(ЗначениеЭлементаСписка) = ТипСписокЗначений Тогда
					СписокИстории.Удалить(ЭлементСписка);
					СохранятьСписокИстории = Истина;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ЭлементСписка.Значение = ЗначениеЭлементаСписка;
			
			Если ТипЗначенияЭлементов = Неопределено Тогда
				// Тип значения определяет первый элемент списка
				ТипЗначенияЭлементов = ТипЗнч(ЭлементСписка.Значение);
			КонецЕсли;			
			
		КонецЦикла;
		
		Если ТипЗначенияЭлементов <> Тип("Строка") Тогда
			ОпределитьПредставлениеЭлементовСписка(ТипЗначенияЭлементов, СписокИстории, СохранятьСписокИстории);
		КонецЕсли;
		
		//Если СохранятьСписокИстории Тогда
		//	СохранитьЗначение(Путь, ЗначениеВСтрокуВнутр(СписокИстории));
		//КонецЕсли;			
			
		Возврат СписокИстории;

	Иначе
		Возврат Новый СписокЗначений();

	КонецЕсли;

КонецФункции // ПолучитьСписокИсторииВвода()

// Процедура по для переданной строке пути и строковому представлению //
//
// Параметры
//  Название - Строка .для которой определяется необходимость дополнения 
// сокращением
//  Уровень - уровень, для которго необходимо составить список сокращений
//
Процедура ДополнитьСписокИсторииВвода(Путь, Знач Значение) Экспорт

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;

	СтрокаИстории = ВосстановитьЗначение(Путь);

	Если СтрокаИстории = Неопределено Тогда
		СписокИстории = Новый СписокЗначений();
	Иначе
		СписокИстории = ЗначениеИзСтрокиВнутр(СтрокаИстории);
	КонецЕсли;

	Если ТипЗнч(СписокИстории) <> Тип("СписокЗначений") Тогда
		СписокИстории = Новый СписокЗначений();
	КонецЕсли;

	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Значение = ЗначениеВСтрокуВнутр(Значение);
	КонецЕсли;

	НайденныйЭлемент = СписокИстории.НайтиПоЗначению(Значение);
	Пока НайденныйЭлемент <> Неопределено Цикл
		 СписокИстории.Удалить(НайденныйЭлемент);
		 НайденныйЭлемент = СписокИстории.НайтиПоЗначению(Значение);
	КонецЦикла;

	СписокИстории.Вставить(0, Значение);

	Пока СписокИстории.Количество() > 5 Цикл
		СписокИстории.Удалить(5);
	КонецЦикла;

	СохранитьЗначение(Путь, ЗначениеВСтрокуВнутр(СписокИстории));

КонецПроцедуры // ДополнитьСписокИсторииВвода()

// Печатает движения документа
//
// Параметры:
//  ДокументСсылка - ссылка на документ, движения которого печатаем
//
Процедура НапечататьДвиженияДокумента(ДокументСсылка) Экспорт
	
	Форма = Отчеты.ДвиженияДокумента.ПолучитьФорму(,,Новый УникальныйИдентификатор);
	Форма.Открыть();
	Форма.Документ = ДокументСсылка;
	Форма.СформироватьИВывестиОтчет();

КонецПроцедуры // НапечататьДвиженияДокумента()

// Процедура инициирует диалог выбора времени.
//
// Параметры
//  Форма - Форма, в которой производится выбор
//  ДатаВремен - дата для выбора времени
//  ТекЭлемент - элемент формы
//  ПолныйГод - булево, показывать год 4-мя цифрами или 2-мя
//
// Возвращаемое значение:
//  НЕТ
//
Процедура ВыбратьВремяДня(Форма, ДатаВремен, ТекЭлемент, Пользователь, ПоГрафику = Истина, ПолныйГод = Истина, ВыбиратьТолькоВремя = Ложь, ДатаНачала = Неопределено) Экспорт

	ДлинаЧаса = 3600;
	
	Если ПоГрафику Тогда
		СтруктураРабочегоВремени = УправлениеКонтактами.ОпределитьНачалоИОкончаниеРабочегоДняПользователя(Пользователь, ДатаВремен);
		
		НачалоРабочегоДняКонстанта    = СтруктураРабочегоВремени.ДатаНачала;
		ОкончаниеРабочегоДняКонстанта = СтруктураРабочегоВремени.ДатаОкончания;
	Иначе
		НачалоРабочегоДняКонстанта      = '00010101000000';
		ОкончаниеРабочегоДняКонстанта   = '00010101235959';
	КонецЕсли;
		
	СписокВремен = Новый СписокЗначений;
	НачалоРабочегоДня = НачалоЧаса(НачалоДня(ДатаВремен) + Час(НачалоРабочегоДняКонстанта) * ДлинаЧаса + Минута(НачалоРабочегоДняКонстанта)*60);
	ОкончаниеРабочегоДня = КонецЧаса(НачалоДня(ДатаВремен) + Час(ОкончаниеРабочегоДняКонстанта) * ДлинаЧаса + Минута(ОкончаниеРабочегоДняКонстанта)*60) - ДлинаЧаса;

	// Если в процедуру дата начала не передана, список начнется с даты начала рабочего дня
	// В противном случае, необходимо взять из даты начала время, а саму дату взять из ДатаВремен
	ВремяНачала = ?(ДатаНачала = Неопределено, НачалоРабочегоДня, НачалоДня(ДатаВремен) + (ДатаНачала - НачалоДня(ДатаНачала)));
	ВремяСписка = ВремяНачала;
	Пока НачалоЧаса(ВремяСписка) <= НачалоЧаса(ОкончаниеРабочегоДня) Цикл
		Если НЕ ЗначениеЗаполнено(ВремяСписка) И ВыбиратьТолькоВремя Тогда
			ПредставлениеВремени = "00:00";
			
		Иначе
			Если ВыбиратьТолькоВремя Тогда
				ПредставлениеВремени = Формат(ВремяСписка,"ДФ=ЧЧ:мм");
				
			Иначе
				ПредставлениеВремени = Формат(ВремяСписка,"ДФ='дд.ММ.гг" + ?(ПолныйГод,"гг","") + " ЧЧ:мм'");
				
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			РазностьДат = (ВремяСписка - ВремяНачала) / ДлинаЧаса;
			
			Если РазностьДат = 0 Тогда
				ПредставлениеВремени = ПредставлениеВремени + " (0 мин.)";
				
			ИначеЕсли РазностьДат = 0.5 Тогда
				ПредставлениеВремени = ПредставлениеВремени + " (30 мин.)";
				
			Иначе
				ПредставлениеВремени = ПредставлениеВремени + " (" + РазностьДат + " час.)";
				
			КонецЕсли;
		КонецЕсли;
		
		СписокВремен.Добавить(ВремяСписка, ПредставлениеВремени);
		
		ВремяСписка = ВремяСписка + ДлинаЧаса / 2; // по полчаса
	КонецЦикла;

	НачальноеЗначение = СписокВремен.НайтиПоЗначению(ДатаВремен);
	Если НачальноеЗначение = Неопределено Тогда
		ВыбранноеВремя = Форма.ВыбратьИзСписка(СписокВремен, ТекЭлемент);
	Иначе
		ВыбранноеВремя = Форма.ВыбратьИзСписка(СписокВремен, ТекЭлемент, НачальноеЗначение);
	КонецЕсли;

	Если ВыбранноеВремя <> Неопределено Тогда
		ДатаВремен = ВыбранноеВремя.Значение;
	КонецЕсли;
	
КонецПроцедуры // ВыбратьВремя()

// Процедура выводить форму структуры подчиненности документа
Процедура ПоказатьСтруктуруПодчиненностиДокумента(ДокументСсылка) Экспорт
	
	ФормаСтруктурыПодчиненности = ПолучитьОбщуюФорму("ФормаСтруктурыПодчиненности");
	Если ФормаСтруктурыПодчиненности.Открыта() Тогда
		ФормаСтруктурыПодчиненности.Закрыть();
	КонецЕсли;
	ФормаСтруктурыПодчиненности.ДокументСсылка = ДокументСсылка;
	ФормаСтруктурыПодчиненности.Открыть();
	 
КонецПроцедуры

// Вызывается в обработчике события "Начало выбора" при выборе счета.
// используется для фильтрации по признаку забалансовый
//
Процедура ВыборСчета(Элемент, СтандартнаяОбработка, Забалансовый) Экспорт

	СтандартнаяОбработка = Ложь;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Забалансовый", Забалансовый);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Забалансовый = &Забалансовый";
	ВыборкаСчетов = Запрос.Выполнить().Выбрать();
	СписокСчетов  = Новый СписокЗначений;
	Пока ВыборкаСчетов.Следующий() Цикл
		СписокСчетов.Добавить(ВыборкаСчетов.Счет);
	КонецЦикла;

	ФормаВыбора = ПланыСчетов.Хозрасчетный.ПолучитьФормуВыбора("ФормаВыбора", Элемент,);

	ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.ВидСравнения  = ВидСравнения.ВСписке;
	ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.Использование = Истина;
	ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.Значение      = СписокСчетов;

	ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;

	ФормаВыбора.ПараметрТекущаяСтрока = Элемент.Значение;

	ФормаВыбора.Открыть();

Конецпроцедуры // ВыборСчета

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ РЕКВИЗИТОВ В ФОРМЕ

// Процедура предназначена для заполнения реквизитов формы,
// вызывается в обработчиках событий "ПриОткрытии" в модулях форм обработок.
//
// Параметры:
//  ЗаполняемаяФорма  - форма, реквизиты которой следует заполнить,
//  ТекПользователь - ссылка на справочник, определяет текущего пользователя  
//
Процедура ЗаполнитьРеквизитыФормы(ЗаполняемаяФорма, ТекПользователь) Экспорт
	
	Элементы	=	ЗаполняемаяФорма.ЭлементыФормы;
	Для Каждого Элемент из	Элементы	Цикл
		
		Если	Элемент.Имя	=	"Организация"	тогда
			Элемент.Значение	=	УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
		КонецЕсли;
		
	КонецЦикла;
	//Если	Элементы.Найти()	<>	Неопределено
	//КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРеквизитыФормы()

Процедура УстановитьДоступностьЯчееекПоСчету(Счет, Субконто1, Субконто2, Субконто3) Экспорт
	
	ЭлементыСубконто = Новый Структура("Субконто1,Субконто2,Субконто3", Субконто1, Субконто2, Субконто3);
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ЭлементыСубконто["Субконто" + Сч].Доступность = (Сч <= ЧислоАктивныхСубконто);
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает видимость приказа в документе
//
Процедура УстановитьВидимостьПриказа(ЗаполняемаяФорма,Организация,УчетнаяПолитикаПоПерсоналуОрганизаций) Экспорт
	
	Элементы	=	ЗаполняемаяФорма.ЭлементыФормы;
	Для Каждого Элемент из	Элементы	Цикл
		Если Строка(ТипЗнч(Элемент)) = "Табличное поле" Тогда
			Колонки	= Элемент.Колонки;
			Для Каждого Колонка Из Колонки Цикл
				Если Колонка.Имя = "Приказ" Тогда
					Колонка.Видимость			= УчетнаяПолитикаПоПерсоналуОрганизаций[Организация].ПоддержкаВнутреннегоСовместительства;
					Колонка.ИзменятьВидимость	= УчетнаяПолитикаПоПерсоналуОрганизаций[Организация].ПоддержкаВнутреннегоСовместительства;		
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если (Элемент.Имя = "Приказ") или (Элемент.Имя = "НадписьПриказОПриеме") Тогда
				Элемент.Видимость			= УчетнаяПолитикаПоПерсоналуОрганизаций[Организация].ПоддержкаВнутреннегоСовместительства;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВидимостьТабельногоНомера(ЗаполняемаяФорма,ПоддержкаТабельногоНомера) Экспорт
	
	Элементы	=	ЗаполняемаяФорма.ЭлементыФормы;
	Для Каждого Элемент из	Элементы	Цикл
		Если Строка(ТипЗнч(Элемент)) = "Табличное поле" Тогда
			Колонки	= Элемент.Колонки;
			Для Каждого Колонка Из Колонки Цикл
				Если (Колонка.Имя = "СтарыйТабельныйНомер") Или (Колонка.Имя = "ТабельныйНомер") Тогда
					Колонка.Видимость			= ПоддержкаТабельногоНомера;
					Колонка.ИзменятьВидимость	= ПоддержкаТабельногоНомера;		
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеПоОгранизацииДаннымиПоУмолчанию(ЗаполняемаяФорма, ПараметрОтборПоРегистратору, ИспользоватьГоловнуюОрганизацию = Истина, ТекущийПользователь, ТекстЗаголовка = "") Экспорт
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("СторнируемыйДокумент") <> Неопределено Тогда
			
			МетаданныеДокумента 		= ПараметрОтборПоРегистратору.СторнируемыйДокумент.Метаданные();
			ПараметрОтборПоРегистратору = ПараметрОтборПоРегистратору.СторнируемыйДокумент;
			
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Если ИспользоватьГоловнуюОрганизацию Тогда
				Организация = ОбщегоНазначения.ГоловнаяОрганизация(ПараметрОтборПоРегистратору.Организация);
			Иначе
				Организация = ПараметрОтборПоРегистратору.Организация;
			КонецЕсли;
			
			ЗаполняемаяФорма.Отбор.Организация.Значение = Организация;
			ЗаполняемаяФорма.Заголовок = ТекстЗаголовка + Организация.Наименование;
			ЗаполняемаяФорма.ЭлементыФормы.Организация.ТолькоПросмотр = Истина
			
		КонецЕсли;
		
		ЗаполняемаяФорма.Отбор.Организация.Использование = Истина;
		
	Иначе
		Если ИспользоватьГоловнуюОрганизацию Тогда 
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнаяОрганизация");
		Иначе
			Организация = ОбщегоНазначения.ГоловнаяОрганизация(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнаяОрганизация"));
		КонецЕсли;
		ЗаполняемаяФорма.Отбор.Организация.Значение = Организация;
		ЗаполняемаяФорма.Заголовок = ТекстЗаголовка + Организация.Наименование;
	    ЗаполняемаяФорма.Отбор.Организация.Использование = Не Организация.Пустая();

	КонецЕсли;
КонецПроцедуры

Процедура ОтобразитьПоляПоказателейСхемМотивации(Форма) Экспорт
	
	СпособРасчета = Форма.СпособРасчета;
	
	СворачиватьПанельФормулы = Не ЗначениеЗаполнено(СпособРасчета);
	Форма.ЭлементыФормы.ПанельПредставлениеФормулы.Свертка = ?(СворачиватьПанельФормулы, РежимСверткиЭлементаУправления.Верх, РежимСверткиЭлементаУправления.Нет);
	
КонецПроцедуры //ЭтаФорма

// Формирует и устанавливает текст заголовка формы справочника
//
// Параметры:
//  СтрокаВида 		 - строка вида, 
//  СправочникОбъект - объект справочника, 
//  ФормаСправочника - форма справочника.
//
Процедура УстановитьЗаголовокФормыСправочника(СтрокаВида = "", СправочникОбъект, ФормаСправочника) Экспорт

	ФормаСправочника.АвтоЗаголовок = Ложь; // заголовок будем писать сами
	
	Если ПустаяСтрока(СтрокаВида) Тогда
		Заголовок = СправочникОбъект.Метаданные().Синоним + ": ";
	Иначе
		Заголовок = СправочникОбъект.Метаданные().Синоним + ": " + СтрокаВида + ". ";
	КонецЕсли;
		
	Если СправочникОбъект.ЭтоНовый() Тогда  
		Заголовок = Заголовок + "Новый";
	КонецЕсли;
	
	ФормаСправочника.Заголовок = Заголовок;

КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

//Функция возвращает список подразделений организации, соответствующих 
//подразделению и организации в регистре сведений 
//СоответствиеПодразделенийИПодразделенийОрганизаций 
// Параметры:
//  Подразделение - Справочник Подразделения,
//  Организации   - Справочник Организации,
Функция ПолучитьСписокПодразделенийОрганизаций(Подразделение,Организация)Экспорт 
	
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	               |ИЗ
	               |	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	               |
	               |ГДЕ
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение И
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации <> &ПустоеПодразделениеОрганизации И
	               |	СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация";
				   
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ПустоеПодразделениеОрганизации",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.ПодразделениеОрганизации);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

// Процедура вызывается из обработчиков событий изменения организации и принадлежности к бухучету
// заполняет подразделение организации если может:))
Процедура ЗаполнениеПодразделенияОрганизацииПоРегистру(ОтражатьВБухгалтерскомУчете,
													   ПодразделениеОрганизации,
													   Подразделение,
													   Организация) Экспорт
													   
	Если Не  ОтражатьВБухгалтерскомУчете Или  НЕ ЗначениеЗаполнено(Подразделение) 
		 Или НЕ ЗначениеЗаполнено(Организация) тогда
		 // тут делать нечего
		Возврат;
	КонецЕсли;
													   
	СписокВыбора = ПолучитьСписокПодразделенийОрганизаций(Подразделение,Организация);
	
	Если СписокВыбора.Количество()=0 тогда
		Возврат;
	КонецЕсли;
	
	// если в списке 1 элемент и подразделение организации заполнено -
	// спросим все - таки пользователя хочет ли он такого заполнения
	// если не заполнено - просто подставляем
	Если СписокВыбора.Количество()=1 тогда
		мПодразделениеОрганизации = СписокВыбора[0].Значение;
		Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) тогда
			ПодразделениеОрганизации = мПодразделениеОрганизации;
		ИначеЕсли ПодразделениеОрганизации <> мПодразделениеОрганизации тогда
			Если Вопрос("Заменить значение подразделения организации """
				+ ПодразделениеОрганизации+ """ на """
				+ мПодразделениеОрганизации+ """ ?",
				РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
				ПодразделениеОрганизации = мПодразделениеОрганизации;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

// Процедура заполняет вычисляемую колонку ТЧ документа "ТабельныйНомерСтрока"
//
// Параметры
//  ТЧДокумента  – Табличное поле
//  ОформленияСтрок – Коллекция значений типа ОформлениеСтроки табличного поля ТЧДокумента
//
Процедура УстановитьЗначенияКолонкиТабельныйНомерСтрока(ТЧДокумента, ОформленияСтрок, КодПоНазначению = Ложь) Экспорт
	
	Если ТЧДокумента.Колонки.Найти("ТабельныйНомерСтрока") = Неопределено 
		Или Не ТЧДокумента.Колонки.ТабельныйНомерСтрока.Видимость Тогда
		Возврат;
	КонецЕсли;

	МассивСотрудников = Новый Массив;
	Если КодПоНазначению Тогда
		Для Каждого СтрокаТабличнойЧасти Из ОформленияСтрок Цикл
			МассивСотрудников.Добавить(СтрокаТабличнойЧасти.ДанныеСтроки.Назначение);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТабличнойЧасти Из ОформленияСтрок Цикл
			МассивСотрудников.Добавить(СтрокаТабличнойЧасти.ДанныеСтроки.Сотрудник);
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Код КАК ТабельныйНомер,
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&парамМассивСотрудников)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамМассивСотрудников", МассивСотрудников);
	
	ТабельныеНомера = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТабельныеНомера[Выборка.Сотрудник] = Выборка.ТабельныйНомер;
	КонецЦикла; 
	
	Для Каждого СтрокаТабличнойЧасти Из ОформленияСтрок Цикл
		ТабельныйНомер = ?( КодПоНазначению,
		ТабельныеНомера[СтрокаТабличнойЧасти.Ячейки.Назначение.Значение],
		ТабельныеНомера[СтрокаТабличнойЧасти.Ячейки.Сотрудник.Значение]);
		СтрокаТабличнойЧасти.Ячейки.ТабельныйНомерСтрока.УстановитьТекст(ТабельныйНомер);
	КонецЦикла;

КонецПроцедуры // УстановитьЗначенияКолонкиТабельныйНомерСтрока()

Процедура НачалоВыбораИзСпискаПредставительКонтрагента(Элемент, СтандартнаяОбработка, Форма, Контрагент) Экспорт

	СтандартнаяОбработка = Ложь;

	// Формирование списка выбора.
	Список = Новый СписокЗначений();
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КонтактныеЛица.Должность КАК Должность,
	|	КонтактныеЛица.КонтактноеЛицо.Фамилия КАК Фамилия,
	|	КонтактныеЛица.КонтактноеЛицо.Имя КАК Имя,
	|	КонтактныеЛица.КонтактноеЛицо.Отчество КАК Отчество
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &Контрагент
	|УПОРЯДОЧИТЬ ПО
	|	Должность, Фамилия, Имя, Отчество
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Список.Добавить(?(ПустаяСтрока(Выборка.Должность),"",СокрЛП(Выборка.Должность) + " ") + 
						?(ПустаяСтрока(Выборка.Фамилия),"",СокрЛП(Выборка.Фамилия) + " ") + 
						?(ПустаяСтрока(Выборка.Имя),"",СокрЛП(Выборка.Имя) + " ") + 
						СокрЛП(Выборка.Отчество));
	КонецЦикла;

	// Выбор из списка и обработка выбора.
	РезультатВыбора = Форма.ВыбратьИзСписка(Список, Элемент);
	Если РезультатВыбора <> Неопределено Тогда
		Элемент.Значение = РезультатВыбора.Значение;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАСТРОЙКИ ПЕРИОДА РЕГИСТРАЦИИ ДОКУМЕНТА

// Функция преобразовывает дату в представление периода
//
// Параметры:
//   ПериодРегистрации - Дата периода
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации) Экспорт

	Возврат Формат(ПериодРегистрации, "ДФ='MMMM yyyy'");

КонецФункции

// Формирует представление переданного способа отражения с "предметной" точки зрения
//
// Параметры
//  СпособОтраженияВУпручете -	СправочникСсылка.СпособыОтраженияЗарплатыВУпрУчете - описываемый
//								способ отражения
//
// Возвращаемое значение:
//   строка - сформированное представление
//
Функция ПолучитьПредставлениеСпособаОтраженияНачисленияВУпрУчете(СпособОтраженияВУпручете) Экспорт
	
	Если СпособОтраженияВУпручете.Пустая() Тогда
		РасшифровкаТекст = "Способ отражения определяется по данным о работнике и его плановых начислениях";
	ИначеЕсли СпособОтраженияВУпручете = Справочники.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете Тогда
		РасшифровкаТекст = "Начисление не отражается в управленческом учете";
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",	СпособОтраженияВУпручете);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат,
		|	СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа,
		|	СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства
		|ИЗ
		|	Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
		|ГДЕ
		|	СпособыОтраженияЗарплатыВУпрУчете.Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		РасшифровкаТекст = "Управленческий учет: ";
		Если Выборка.СтатьяЗатрат.Пустая() Тогда
			РасшифровкаТекст = РасшифровкаТекст + "статья затрат <не указана>";
		Иначе
			РасшифровкаТекст = РасшифровкаТекст + "статья затрат " + Выборка.СтатьяЗатрат;
		КонецЕсли;
		Если Выборка.НоменклатурнаяГруппа.Пустая() Тогда
			РасшифровкаТекст = РасшифровкаТекст + "; номенклатурная группа <не указана>";
		Иначе
			РасшифровкаТекст = РасшифровкаТекст + "; номенклатурная группа " + Выборка.НоменклатурнаяГруппа;
		КонецЕсли;
		Если Выборка.ОбъектСтроительства.Пустая() Тогда
			РасшифровкаТекст = РасшифровкаТекст + "; объект строительства <не указан>";
		Иначе
			РасшифровкаТекст = РасшифровкаТекст + "; объект строительства " + Выборка.ОбъектСтроительства;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасшифровкаТекст;
	
КонецФункции // ПолучитьПредставлениеСпособаОтраженияНачисленияВУчетах()

// Процедура обрабатывает событие регулирования в поле периода регистрации
//
Процедура РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ПериодРегистрации, ПредставлениеПериодаРегистрации) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		ПериодРегистрации = КонецМесяца(ПериодРегистрации) + 1;
	ИначеЕсли Направление = -1 Тогда
		ПериодРегистрации = НачалоМесяца(ПериодРегистрации - 1);
	КонецЕсли;

	ПредставлениеПериодаРегистрации = ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);

КонецПроцедуры

// Процедура обрабатывает событие начала выбора из списка в поле периода регистрации
// Процедура исполняется только на клиенте
//
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, НачальноеЗначение = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, ВыбранныйЭлемент.Значение);
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = ВыбранныйЭлемент.Значение;
	Элемент.Значение  = ДатаКакМесяцПредставление(ПериодРегистрации);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ И ОБРАБОТКИ МЕНЮ

// Процедура предназначена для управления видимостью элементов формы,
// вызывается в обработчиках событий "ПриОткрытии" форм, при изменении реквизита Организация
//
// Параметры:
//  ЭлементыФормы  - массив с коллекцией ЭУ формы, видимость которых необходимо определить
//  УчетнаяПолитикаПоПерсоналу - структура, содержит данные учетной политики    
//    предприятия или конкретной организации
//
Процедура УстановитьВидимостьЭУПоУчетнойПолитикеПоПерсоналу(ЭлементыФормы,УчетнаяПолитикаПоПерсоналу,Организация = Неопределено) Экспорт
	
	ИспользуютсяНачисленияВВалюте			= Ложь;
	ПоказыватьТабельныеНомераВДокументах	= Ложь;
	ПоддерживатьНесколькоСхемМотивации		= Ложь;
	ПоддержкаВнутреннегоСовместительства	= Ложь;
	
	Если Организация = Неопределено Тогда
		Если УчетнаяПолитикаПоПерсоналу <> Неопределено Тогда
			Если Не УчетнаяПолитикаПоПерсоналу.Свойство("ИспользуютсяНачисленияВВалюте",ИспользуютсяНачисленияВВалюте) Тогда
				ИспользуютсяНачисленияВВалюте = Ложь;
			КонецЕсли;
			Если Не УчетнаяПолитикаПоПерсоналу.Свойство("ПоказыватьТабельныеНомераВДокументах",ПоказыватьТабельныеНомераВДокументах) Тогда
				ПоказыватьТабельныеНомераВДокументах = Ложь;
			КонецЕсли;
			Если Не УчетнаяПолитикаПоПерсоналу.Свойство("ПоддерживатьНесколькоСхемМотивации",ПоддерживатьНесколькоСхемМотивации) Тогда
				ПоддерживатьНесколькоСхемМотивации = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИспользуютсяНачисленияВВалюте			= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналу, Организация, "ИспользуютсяНачисленияВВалюте");
		ПоказыватьТабельныеНомераВДокументах	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналу, Организация, "ПоказыватьТабельныеНомераВДокументах");
		ПоддержкаВнутреннегоСовместительства	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналу, Организация, "ПоддержкаВнутреннегоСовместительства");
	КонецЕсли;
	
	ТипКолонкаТабличногоПоля = Тип("КолонкаТабличногоПоля");
	ТипПолеВвода = Тип("ПолеВвода");
	ТипНадпись = Тип("Надпись");
	
	Для каждого Элемент из ЭлементыФормы Цикл
		Если ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "ТабельныйНомерСтрока" Тогда
			Элемент.Видимость			= ПоказыватьТабельныеНомераВДокументах;
			Элемент.ИзменятьВидимость	= Ложь;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта1" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта2" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта3" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;	
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта4" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта5" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;	
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Валюта6" Тогда
			Элемент.Видимость			= ИспользуютсяНачисленияВВалюте;
			Элемент.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;	
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "ВидСхемыМотивации" Тогда
			Элемент.Видимость			= Элемент.Видимость И ПоддерживатьНесколькоСхемМотивации;
			Элемент.ИзменятьВидимость	= ПоддерживатьНесколькоСхемМотивации;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "ПоВременнойСхемеМотивации" Тогда
			Элемент.Видимость			= Элемент.Видимость И ПоддерживатьНесколькоСхемМотивации;
			Элемент.ИзменятьВидимость	= ПоддерживатьНесколькоСхемМотивации;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Сотрудник" Тогда
			Элемент.Видимость			= Элемент.Видимость И ПоддержкаВнутреннегоСовместительства;
			Элемент.ИзменятьВидимость	= ПоддержкаВнутреннегоСовместительства;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Подразделение" Тогда
			Элемент.Видимость			= Элемент.Видимость И ПоддержкаВнутреннегоСовместительства;
			Элемент.ИзменятьВидимость	= ПоддержкаВнутреннегоСовместительства;
		ИначеЕсли ТипЗнч(Элемент) = ТипКолонкаТабличногоПоля и Элемент.Имя = "Должность" Тогда
			Элемент.Видимость			= Элемент.Видимость И ПоддержкаВнутреннегоСовместительства;
			Элемент.ИзменятьВидимость	= ПоддержкаВнутреннегоСовместительства;
			
		// в качестве ЭлементыФормы	передана форма
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Колонки	= Элемент.Колонки;
			Для Каждого Колонка Из Колонки Цикл
				Если (Колонка.Имя = "ТабельныйНомерСтрока") Тогда
					Колонка.Видимость			= ПоказыватьТабельныеНомераВДокументах;
					Колонка.ИзменятьВидимость	= ПоказыватьТабельныеНомераВДокументах;
				КонецЕсли;
				Если Колонка.Имя = "Валюта" Тогда
					Колонка.Видимость			= ИспользуютсяНачисленияВВалюте;
					Колонка.ИзменятьВидимость	= ИспользуютсяНачисленияВВалюте;
				КонецЕсли;
				Если Колонка.Имя = "ВидСхемыМотивации" Тогда
					Колонка.Видимость			= Колонка.Видимость И ПоддерживатьНесколькоСхемМотивации;
					Колонка.ИзменятьВидимость	= ПоддерживатьНесколькоСхемМотивации;
				КонецЕсли;
				Если Колонка.Имя = "ПоВременнойСхемеМотивации" Тогда
					Колонка.Видимость			= ПоддерживатьНесколькоСхемМотивации;
					Колонка.ИзменятьВидимость	= ПоддерживатьНесколькоСхемМотивации;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(Элемент) = ТипПолеВвода и Элемент.Имя = "ВалютаДокумента" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипНадпись и Элемент.Имя = "НадписьВалютаДокумента" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипПолеВвода и Элемент.Имя = "ВалютаТарифнойСтавки" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипНадпись и Элемент.Имя = "НадписьВалютаТарифнойСтавки" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипПолеВвода и Элемент.Имя = "ВалютаТарифнойСтавки1" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипНадпись и Элемент.Имя = "НадписьВалютаТарифнойСтавки1" Тогда
			Элемент.Видимость = ИспользуютсяНачисленияВВалюте;
		ИначеЕсли ТипЗнч(Элемент) = ТипПолеВвода и Элемент.Имя = "ВидСхемыМотивации" Тогда
			Элемент.Видимость = ПоддерживатьНесколькоСхемМотивации;
		ИначеЕсли ТипЗнч(Элемент) = ТипНадпись и Элемент.Имя = "НадписьВидСхемыМотивации" Тогда
			Элемент.Видимость = ПоддерживатьНесколькоСхемМотивации;
		ИначеЕсли ТипЗнч(Элемент) = Тип("Панель") и Элемент.Имя = "ПанельСхемыМотивации" Тогда
			СверткаПанелиМотивации = ?(ПоддерживатьНесколькоСхемМотивации, РежимСверткиЭлементаУправления.Нет, РежимСверткиЭлементаУправления.Верх);	
			Элемент.Свертка = СверткаПанелиМотивации;
		ИначеЕсли ТипЗнч(Элемент) = Тип("Переключатель") и Элемент.Имя = "ВнутреннееСовместительство" Тогда
			Элемент.Видимость = ПоддержкаВнутреннегоСовместительства;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УстановитьВидимостьЭУПоУчетнойПолитикеПоПерсоналу()


Процедура ЗаполнениеОтбораПоОрганизацииПоУмолчанию(Форма, ЭлементОтбора = Неопределено, ЭлементФормы, ПараметрОтборПоРегистратору = Неопределено, ИспользоватьГоловнуюОрганизацию = Истина, ТекущийПользователь, ТекстЗаголовка = Неопределено) Экспорт
	
	ЭлементФормы.ТолькоПросмотр = Ложь;
	
	Если ЗначениеЗаполнено(ПараметрОтборПоРегистратору) Тогда
		
		МетаданныеДокумента = ПараметрОтборПоРегистратору.Метаданные();
		
		Если МетаданныеДокумента.Реквизиты.Найти("СторнируемыйДокумент") <> Неопределено Тогда
			
			МетаданныеДокумента 		= ПараметрОтборПоРегистратору.СторнируемыйДокумент.Метаданные();
			ПараметрОтборПоРегистратору = ПараметрОтборПоРегистратору.СторнируемыйДокумент;
			
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
			
			Если ИспользоватьГоловнуюОрганизацию Тогда
				Организация = ОбщегоНазначения.ГоловнаяОрганизация(ПараметрОтборПоРегистратору.Организация);
			Иначе
				Организация = ПараметрОтборПоРегистратору.Организация;
			КонецЕсли;
			
			ЭлементОтбора.Значение = Организация;
			ЭлементФормы.ТолькоПросмотр = Истина;
			Если ТекстЗаголовка <> Неопределено Тогда
				Форма.Заголовок = ТекстЗаголовка + Организация.Наименование;
			КонецЕсли; 
			
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		
	Иначе
		
		Если ИспользоватьГоловнуюОрганизацию Тогда 
			Организация = ОбщегоНазначения.ГоловнаяОрганизация(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнаяОрганизация"));
		Иначе
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнаяОрганизация");
		КонецЕсли;
		
		Если ЭлементОтбора <> Неопределено Тогда
			ЭлементОтбора.Значение = Организация;
			ЭлементОтбора.Использование = Не Организация.Пустая();
		КонецЕсли;
		
		Если ТекстЗаголовка <> Неопределено Тогда
			Если Организация.Пустая() Тогда
				Форма.Заголовок = СтрЗаменить(ТекстЗаголовка,"организации","организаций");
			Иначе 
				Форма.Заголовок = ТекстЗаголовка + Организация;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ВВОДА ДАТЫ КАК МЕСЯЦА

// Предназначена для реализации "произвольного" ввода даты-месяца
// подбирает по переданному тексту строку-представление даты или список таких строк
// в переданный параметр ДатаПоТексту возвращает подобранную по тексту дату
Функция ДатаКакМесяцПодобратьДатуПоТексту(Текст, ДатаПоТексту = НеОпределено) ЭКспорт
    СписокВозврата = Новый СписокЗначений;
    ТекущийГод = Год(ТекущаяДата());
    
    Если ПустаяСтрока(Текст) Тогда
        Возврат СписокВозврата;
    КонецЕсли;
    Если Найти(Текст, ".") <> 0 Тогда
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, ".");
    ИначеЕсли Найти(Текст, ",") <> 0 Тогда
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, ",");
    ИначеЕсли Найти(Текст, "-") <> 0 Тогда
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "-");
    ИначеЕсли Найти(Текст, "/") <> 0 Тогда
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "/");
    ИначеЕсли Найти(Текст, "\") <> 0 Тогда
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "\");
    Иначе
        Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, " ");
    КонецЕсли;
    Если Подстроки.Количество() = 1 Тогда
        // единственное слово - пытаемся получить месяц
        Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Текст) Тогда
            МесяцЧислом = Число(Текст);
            Если МесяцЧислом >= 1 и МесяцЧислом <=12 Тогда
                ДатаПоТексту = Дата(ТекущийГод, МесяцЧислом, 1);
                Если СтрДлина(Текст) = 1 Тогда
                    СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='М/гг'"));
                Иначе
                    СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММ/гг'"));
                КонецЕсли;
            Иначе
                Возврат СписокВозврата;
            КонецЕсли;                
        Иначе
            СписокМесяцев = СписокМесяцевПоСтроке(Текст);
            Для Каждого Месяц Из СписокМесяцев Цикл
                ДатаПоТексту = Дата(ТекущийГод, Месяц, 1);
                СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММММ гг'"));
            КонецЦикла;
        КонецЕсли;
    ИначеЕсли Подстроки.Количество() = 2 Тогда
        // два слова - первое считаем месяцем, второе - годом
        Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
            Если ПустаяСтрока(Подстроки[1]) Тогда
                ГодЧислом = 0;
                Подстроки[1] = "0";
                ТекстВозврата = Текст + "0";
            Иначе
                ГодЧислом = Число(Подстроки[1]);
                ТекстВозврата = "";
            КонецЕсли;
            Если ГодЧислом > 3000 Тогда
                Возврат СписокВозврата;
            КонецЕсли;
            Если СтрДлина(Подстроки[1]) <= 1 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 3) + Подстроки[1]);
                СтрокаФорматированияГода = "г";
            ИначеЕсли СтрДлина(Подстроки[1]) = 2 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 2) + Подстроки[1]);
                СтрокаФорматированияГода = "гг";
            ИначеЕсли СтрДлина(Подстроки[1]) = 3 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 1) + Подстроки[1]);
                СтрокаФорматированияГода = "гггг";
            КонецЕсли;                    
        Иначе
            // второе слово может быть только годом
            Возврат СписокВозврата;
        КонецЕсли;                
        Если ЗначениеЗаполнено(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
            МесяцЧислом = Число(Подстроки[0]);
            Если МесяцЧислом >= 1 и МесяцЧислом <= 12 Тогда
                // если "правильный" месяц и год
                ДатаПоТексту = Дата(ГодЧислом, МесяцЧислом, 1);
                СписокВозврата.Добавить(ТекстВозврата);
            Иначе
                Возврат СписокВозврата;
            КонецЕсли;                
        Иначе
            СписокМесяцев = СписокМесяцевПоСтроке(Подстроки[0]);
            Если СписокМесяцев.Количество() = 1 Тогда
                ДатаПоТексту = Дата(ГодЧислом, СписокМесяцев[0], 1);
                СписокВозврата.Добавить("");
            Иначе
                Для Каждого Месяц Из СписокМесяцев Цикл
                    ДатаПоТексту = Дата(ГодЧислом, Месяц, 1);
                    СписокВозврата.Добавить(Формат(Дата(ГодЧислом, Месяц, 1), "ДФ='ММММ гг'"));
                КонецЦикла;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    Возврат СписокВозврата;
КонецФункции

// подбирает массив номеров месяцев, соответствующих переданной строке
// например, для строки "ма" это будут 3 и 5, для "а" - 4 и 8
// используется в ПодобратьДатуПоТексту
//
Функция СписокМесяцевПоСтроке(Текст)
	
	СписокМесяцев = Новый СписокЗначений;
	Месяцы = Новый Соответствие;
	МесяцыВозврата = Новый Массив;
	
	
	Для Счетчик = 1 По 12 Цикл
		Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='ММММ'");
		СписокМесяцев.Добавить(Счетчик, Представление);
		СписокМесяцев.Добавить(Счетчик, Представление);
		Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='МММ'");
		СписокМесяцев.Добавить(Счетчик, Представление);
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из СписокМесяцев Цикл
		Если ВРег(Текст) = ВРег(Лев(ЭлементСписка.Представление, СтрДлина(Текст))) Тогда
			Месяцы[ЭлементСписка.Значение] = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из Месяцы Цикл
		МесяцыВозврата.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Возврат МесяцыВозврата;
	
КонецФункции

Процедура ДатаКакМесяцАвтоПодборТекста(Текст, ТекстАвтоПодбора, СтандартнаяОбработка) Экспорт
    Список = ДатаКакМесяцПодобратьДатуПоТексту(Текст);
    Если Список.Количество() = 1 Тогда
        ТекстАвтоПодбора = Список[0];
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ДатаКакМесяцОкончаниеВводаТекста(Текст, Значение, СтандартнаяОбработка) Экспорт
    Список = ДатаКакМесяцПодобратьДатуПоТексту(Текст);
    Если Список.Количество() = 1 Тогда
        Значение = Текст;
    Иначе
        Значение = Список;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

Функция ДатаКакМесяцПредставление(ДатаДата) Экспорт
    Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА ВСТРОЕННОЙ СПРАВКИ

Функция ПолучитьПутьККартинкеДляHTML(Картинка, ПолеHTMLДокумента) Экспорт
	
	МетаУрл	= ПолеHTMLДокумента.ПолучитьURL(Метаданные);
	МетаУрл	= Лев(МетаУрл,Найти(МетаУрл,"mdobject")-1);
	КартИД	= ЗначениеВСтрокуВнутр(Картинка);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Лев(КартИД,НАйти(КартИД,"}")-1);
	
	Если Лев(КартИД,1) = "-" Тогда
		КартИд	= "n"+КартИД;
	Иначе
		КартИД	= Сред(КартИД,3);
	КонецЕсли;
	
	Возврат МетаУрл+"mdpicture/id" + КартИД;
	
КонецФункции // КартинкаУрл()

Функция ВернутьШестнадцатиричноеПредставлениеЦвета(ВыбранныйЦвет) Экспорт
	
	Если ТипЗнч(ВыбранныйЦвет) <> Тип("Цвет") Тогда
		Возврат "";
	КонецЕсли;
	
	Красный	= ОбщегоНазначения.ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Красный);
	Зеленый	= ОбщегоНазначения.ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Зеленый);
	Синий	= ОбщегоНазначения.ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Синий);
	
	Возврат "#" + Красный + Зеленый + Синий;
	
КонецФункции

Процедура УстановитьВидимостьТекста(Документ, Ид, ВключитьВидимость, Параметр = "inline") Экспорт
	
	// Документ должен быть всегда загружен и в нем должен найтись нужный нам элемент
	// Пользователь может увидеть данные сообщения только в том случае, если при кодировании
	// механизма были допущены ошибки
	
	// Данное сообщение будет выведено, если мы пытаемся обновить справку ПриОткрытии формы
	// Обновлять справку в этом событии не нужно, так как текст справки был изначально
	// сформирован правильно
	Если Документ.readyState <> "complete" Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Справка: справка еще не загружена");
		Возврат;
	КонецЕсли;
	
	// Данное сообщение будет выведено, если мы пытаемся переключить видимость элемента
	// которого нет в справке. Такое может только в случае, если бы допустили ошибку в коде
	Элемент = Документ.getElementById(Ид);
	Если Элемент = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Справка: не найден элемент " + Ид);
		Возврат;
	КонецЕсли;
	
	Элемент.style.display = ?(ВключитьВидимость, Параметр, "none");
	
КонецПроцедуры

Процедура ПолеHTMLДокументаOnClick(Элемент, pEvtObj, Форма) Экспорт
	
	ЭлементHTML = НайтиЭлемент(pEvtObj.srcElement, "A");
	Если ЭлементHTML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементHTML.id = "Команда" Тогда
		Попытка
			Форма.ВыполнитьКомандуФормы(ЭлементHTML.pathname, ЭлементHTML.target);
		Исключение
			// в случае неверной или недоступной по правам команды ничего не делаем
		КонецПопытки;
		pEvtObj.returnValue = Ложь;
		
	ИначеЕсли ЭлементHTML.id = "ОткрытьСписок" Тогда
		Менеджер = Вычислить(ЭлементHTML.pathname);
		Попытка
			ФормаСписка = Менеджер.ПолучитьФормуСписка();
			ФормаСписка.Открыть();
		Исключение
			// в случае неверной или недоступной по правам команды ничего не делаем
		КонецПопытки;
		
		pEvtObj.returnValue = Ложь;
		
	ИначеЕсли ЭлементHTML.id = "АктивизироватьЭУ" Тогда
		Форма.ТекущийЭлемент = Вычислить("Форма.ЭлементыФормы." + ЭлементHTML.pathname);
		pEvtObj.returnValue = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЭлемент(ЭлементHTML, НазваниеТега)
	
	ТекущийЭлементHTML = ЭлементHTML;
	Пока Истина Цикл
		Если ТекущийЭлементHTML.tagName = "BODY" Тогда
			Возврат Неопределено;
		ИначеЕсли ТекущийЭлементHTML.tagName = НазваниеТега Тогда
			Возврат ТекущийЭлементHTML;
		Иначе
			ТекущийЭлементHTML = ТекущийЭлементHTML.parentNode;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура ПолеHTMLДокументаOnMouseOver(Элемент, pEvtObj, ВыделятьРазделы = Ложь) Экспорт
	
	Если ВыделятьРазделы Тогда
		ЭлементHTML = НайтиЭлемент(pEvtObj.srcElement, "DIV");
		Если ЭлементHTML <> Неопределено Тогда
			ЭлементHTML.style.paddingtop		= 0;
			ЭлементHTML.style.paddingright		= 3;
			ЭлементHTML.style.paddingbottom		= 2;
			ЭлементHTML.style.paddingleft		= 3;
			ЭлементHTML.style.borderwidth		= 1;
			ЭлементHTML.style.borderstyle		= "solid";
			ЭлементHTML.style.backgroundcolor	= "#FFFBF0";
		КонецЕсли;
	КонецЕсли;
	ЭлементHTML = НайтиЭлемент(pEvtObj.srcElement, "A");
	Если ЭлементHTML <> Неопределено Тогда
		ЭлементHTML.style.backgroundcolor	= ВернутьШестнадцатиричноеПредставлениеЦвета(ВстроеннаяСправка_ФонВыделеннойСсылки());
		ЭлементHTML.style.color				= ВернутьШестнадцатиричноеПредставлениеЦвета(ВстроеннаяСправка_ЦветВыделеннойСсылки());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолеHTMLДокументаOnMouseOut(Элемент, pEvtObj, ВыделятьРазделы = Ложь) Экспорт
	
	Если ВыделятьРазделы Тогда
		ЭлементHTML = НайтиЭлемент(pEvtObj.srcElement, "DIV");
		Если ЭлементHTML <> Неопределено Тогда
			ЭлементHTML.style.paddingtop		= 1;
			ЭлементHTML.style.paddingright		= 4;
			ЭлементHTML.style.paddingbottom		= 3;
			ЭлементHTML.style.paddingleft		= 4;
			ЭлементHTML.style.borderstyle		= "none";
			ЭлементHTML.style.backgroundcolor	= "";
		КонецЕсли;
	КонецЕсли;
	ЭлементHTML = НайтиЭлемент(pEvtObj.srcElement, "A");
	Если ЭлементHTML <> Неопределено Тогда
		ЭлементHTML.style.backgroundcolor	= "";
		ЭлементHTML.style.color				= "";
	КонецЕсли;
	
КонецПроцедуры

Функция ВстроеннаяСправка_ЦветФона() Экспорт
	
	Возврат Новый Цвет(255, 255, 255);
	
КонецФункции

Функция ВстроеннаяСправка_ЦветРамки() Экспорт
	
	Возврат Новый Цвет(137, 132, 119);
	
КонецФункции

Функция ВстроеннаяСправка_ЦветСсылки() Экспорт
	
	Возврат Новый Цвет(0, 0, 0);
	
КонецФункции

Функция ВстроеннаяСправка_ЦветВыделеннойСсылки() Экспорт
	
	Возврат Новый Цвет(255, 255, 255);
	
КонецФункции

Функция ВстроеннаяСправка_ФонВыделеннойСсылки() Экспорт
	
	Возврат Новый Цвет(64, 94, 172);
	
КонецФункции

// Возвращает описание стилей, используемых при показе встроенной ситуационно-зависимой справки
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   строка
//
Функция ВстроеннаяСправка_СтилиДокумента() Экспорт

	Возврат "
	|		<STYLE type=text/css>
	|			DIV.top {
	|				PADDING: 0;
	|			}
	|			DIV {
	|				PADDING: 3px 0px 3px 3px;
	|				BORDER-TOP-COLOR: #dadac4;
	|				BORDER-RIGHT-COLOR: #dadac4;
	|				BORDER-BOTTOM-COLOR: #dadac4;
	|				BORDER-LEFT-COLOR: #dadac4;
	|			}
	|			A {
	|				PADDING-TOP: 1px;
	|				PADDING-BOTTOM: 1px;
	|			}
	|			BODY {
	|				SCROLLBAR-FACE-COLOR: #fffbf0;
	|				SCROLLBAR-HIGHLIGHT-COLOR: #dadac4;
	|				SCROLLBAR-3DLIGHT-COLOR: #fff; MARGIN: 5px;
	|				SCROLLBAR-ARROW-COLOR: #708090;
	|				SCROLLBAR-TRACK-COLOR: #fffbf0;
	|				SCROLLBAR-DARKSHADOW-COLOR: #fff;
	|				MARGIN: 5px 0px 5px 5px;
	|				FONT-SIZE: 8pt;
	|			}
	|			IMG {
	|				MARGIN-LEFT: 3px;
	|			}
	|		</STYLE>";

КонецФункции // ()

Процедура ИзменитьВидимостьПанелиПоГоризонтали(Форма, ОтображатьПанель, ИмяОсновнойПанели, ПостфиксЭлементов) Экспорт
	
	Перем Элемент, Граница, Пусто;
	
	ОсновнаяПанель	= Форма.ЭлементыФормы[ИмяОсновнойПанели];
	Панель			= Форма.ЭлементыФормы["Панель" + ПостфиксЭлементов];
	Разделитель		= Форма.ЭлементыФормы["Разделитель" + ПостфиксЭлементов];
	
	Если ОтображатьПанель Тогда
		Если Панель.Свертка = РежимСверткиЭлементаУправления.Право Тогда
			// установить привязку основной панели к разделителю
			ОсновнаяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Право, Разделитель, ГраницаЭлементаУправления.Лево);
			
			// развернуть разделитель
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Нет;
			
			// развернуть панель
			Панель.Свертка = РежимСверткиЭлементаУправления.Нет;
			
			Если Панель.Ширина > Форма.Ширина / 2 Тогда
				// если максимизировать форму с закрытой справкой, а потом открыть справку, то форма
				// будет выглядеть очень некрасиво
				// поэтому необходимо ограничить ширину панели справки в случаях, когда справка получается на шире чем 1/2 формы
				РазницаВШирине = Форма.Ширина - 250 - Разделитель.Лево;
			Иначе
				РазницаВШирине = Панель.Ширина - Макс(250, Мин(Форма.Ширина - 350, Панель.Ширина));
			КонецЕсли;
			Если РазницаВШирине < 0 Тогда
				РазницаВШирине = 0;
			КонецЕсли;
			
			// восстановить привязки разделителя
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Лево, Форма.Панель, ГраницаЭлементаУправления.Право);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, Разделитель, ГраницаЭлементаУправления.Лево);
			
			// установить привязку панели справки к разделителю
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Лево, Разделитель, ГраницаЭлементаУправления.Право);
			
			Разделитель.Лево = Разделитель.Лево + РазницаВШирине;
		КонецЕсли;
	Иначе
		Если Панель.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
			ШиринаОсновнойПанели = ОсновнаяПанель.Ширина + Разделитель.Ширина + Панель.Ширина;
			
			// сбросить привязку панели к разделителю
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
			
			// установить привязку разделителя к панели справки
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, Панель, ГраницаЭлементаУправления.Лево);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Лево, Панель, ГраницаЭлементаУправления.Лево);
			
			// свернуть панель
			Панель.Свертка = РежимСверткиЭлементаУправления.Право;
			// свернуть разделитель
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Право;
			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Лево, Панель, ГраницаЭлементаУправления.Право);
			
			// установить привязку основной панели к форме
			ОсновнаяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Право, Форма.Панель, ГраницаЭлементаУправления.Право);
			ОсновнаяПанель.Ширина = ШиринаОсновнойПанели;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьВидимостьПанелиПоВертикали(Форма, ОтображатьПанель, ИмяОсновнойПанели, ПостфиксЭлементов) Экспорт
	
	Перем Элемент, Граница, Пусто;
	
	ОсновнаяПанель	= Форма.ЭлементыФормы[ИмяОсновнойПанели];
	Панель			= Форма.ЭлементыФормы["Панель" + ПостфиксЭлементов];
	Разделитель		= Форма.ЭлементыФормы["Разделитель" + ПостфиксЭлементов];
	
	Если ОтображатьПанель Тогда
		Если Панель.Свертка = РежимСверткиЭлементаУправления.Верх Тогда
			// установить привязку основной панели к разделителю
			ОсновнаяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Разделитель, ГраницаЭлементаУправления.Низ);
			
			// развернуть разделитель
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Нет;
			
			// развернуть панель
			Панель.Свертка = РежимСверткиЭлементаУправления.Нет;
			
			// восстановить привязки разделителя
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Форма.Панель, ГраницаЭлементаУправления.Верх);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Разделитель, ГраницаЭлементаУправления.Низ);
			
			// установить привязку панели справки к разделителю
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Разделитель, ГраницаЭлементаУправления.Верх);
		КонецЕсли;
	Иначе
		Если Панель.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
			ВысотаОсновнойПанели = ОсновнаяПанель.Высота + (ОсновнаяПанель.Верх - Панель.Верх);
			
			// сбросить привязку панели к разделителю
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Низ);
			
			// установить привязку разделителя к панели справки
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Панель, ГраницаЭлементаУправления.Низ);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
			
			// свернуть панель
			Панель.Свертка = РежимСверткиЭлементаУправления.Верх;
			// свернуть разделитель
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Верх;
			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Верх);
			
			// установить привязку основной панели к форме
			ОсновнаяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Форма.Панель, ГраницаЭлементаУправления.Верх);
			ОсновнаяПанель.Верх		= Панель.Верх;
			ОсновнаяПанель.Высота	= ВысотаОсновнойПанели;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ С ДИАЛОГОМ ОТЧЕТА
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ СО СТАТЬЯМИ НАЛОГОВЫХ ДЕКЛАРАЦИЙ

Функция СформироватьСодержимоеНабораСтатей(Набор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Набор",Набор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаборыСтатейНалоговыхДеклараций.Набор,
	               |	НаборыСтатейНалоговыхДеклараций.Статья,
				   |	ПРЕДСТАВЛЕНИЕ(НаборыСтатейНалоговыхДеклараций.Статья) КАК СтатьяПредставление
	               |ИЗ
	               |	РегистрСведений.НаборыСтатейНалоговыхДеклараций КАК НаборыСтатейНалоговыхДеклараций
				   |ГДЕ
				   |	НаборыСтатейНалоговыхДеклараций.Набор = &Набор";
	Результат = Запрос.Выполнить().Выбрать();
	
	СписокСтатей = Новый СписокЗначений;
	
	
	Пока Результат.Следующий() Цикл
		СписокСтатей.Добавить(Результат.Статья,Результат.СтатьяПредставление);
	КонецЦикла;

	Возврат СписокСтатей;
	
КонецФункции	

Функция СформироватьСодержимоеДекларации(ВидДекларации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНалоговойДекларации", ВидДекларации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиНалоговыхДеклараций.Ссылка КАК Статья,
	               |	ПРЕДСТАВЛЕНИЕ(СтатьиНалоговыхДеклараций.Ссылка) КАК СтатьяПредставление
	               |ИЗ
	               |	Справочник.СтатьиНалоговыхДеклараций КАК СтатьиНалоговыхДеклараций
	               |ГДЕ
	               |	СтатьиНалоговыхДеклараций.ВидНалоговойДекларации = &ВидНалоговойДекларации";
	Результат = Запрос.Выполнить().Выбрать();
	
	СписокСтатей = Новый СписокЗначений;
	
	
	Пока Результат.Следующий() Цикл
		СписокСтатей.Добавить(Результат.Статья,Результат.СтатьяПредставление);
	КонецЦикла;

	Возврат СписокСтатей;
	
КонецФункции	

// По переданному списку элементов справочника СтатьиНалоговыхДеклараций формирует новый список, содержащий
// все плюс иерархию элементов - родителей
// Параметры:
//  Список  – список, содержащий элементы справочника СтатьиНалоговыхДеклараций
//
// Возвращаемое значение:
//   СписокЗначений - дополненный иерархией владельцев входящий список
//
Функция ДополнитьСписокРодителями(Список) Экспорт

	 Запрос = Новый Запрос();
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	СтатьиНалоговыхДеклараций.Родитель КАК Родитель
	                |ИЗ
	                |	Справочник.СтатьиНалоговыхДеклараций КАК СтатьиНалоговыхДеклараций
	                |ГДЕ
	                |	СтатьиНалоговыхДеклараций.Ссылка В(&Список)
	                |	И НЕ (СтатьиНалоговыхДеклараций.Родитель В(&Список))";
					
	Запрос.УстановитьПараметр("Список", Список);
	
	Родители = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Родитель");
	
	СписокСРодителями = Список.Скопировать();
	
	Если  НЕ Родители.Количество() = 0 
	    И НЕ (Родители.Количество() = 1 
		    И Родители[0] = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка()) Тогда
			
		// получим родителей для родителей
		СписокРодителей = Новый СписокЗначений;
 		СписокРодителей.ЗагрузитьЗначения(Родители);
		
		СписокРодителейСРодителями = ДополнитьСписокРодителями(СписокРодителей);
		
		Для каждого Родитель Из СписокРодителейСРодителями Цикл
			
			Если ЗначениеЗаполнено(Родитель.Значение) Тогда
			
				СписокСРодителями.Добавить(Родитель.Значение,Родитель.Представление)		
			
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат СписокСРодителями;
	
КонецФункции // ДобавитьРодителей(СписокЗначений)()

// Вызывается в обработчике события "Начало выбора" при выборе статьи налоговой декларации
//
Процедура НачалоВыбораСтатьяНалоговойДекларации(ЭлементФормы, СтандартнаяОбработка, НазваниеНалоговойДекларации, Набор = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;

	ФормаВыбора = Справочники.СтатьиНалоговыхДеклараций.ПолучитьФормуВыбора(,ЭлементФормы,);
	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойДекларации.Значение      = НазваниеНалоговойДекларации;
	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойДекларации.Использование = Истина;
	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойДекларации.ВидСравнения  = ВидСравнения.Равно;
	Если Набор = Неопределено Тогда
		ФормаВыбора.ВсеСтатьи = Истина;
		ФормаВыбора.Набор = Справочники.НаборыСтатейНалоговыхДеклараций.ПустаяСсылка();
		ФормаВыбора.ЭлементыФормы.ВсеСтатьи.Доступность = Ложь;
		ФормаВыбора.ЭлементыФормы.Подходящие.Доступность = Ложь;
		ФормаВыбора.СправочникСписок.Отбор.Ссылка.Использование = Ложь;
	Иначе
		ФормаВыбора.ВсеСтатьи = Ложь;
		ФормаВыбора.Набор = Набор;
		ФормаВыбора.ЭлементыФормы.ВсеСтатьи.Доступность = Истина;
		ФормаВыбора.ЭлементыФормы.Подходящие.Доступность = Истина;
		ФормаВыбора.СправочникСписок.Отбор.Ссылка.ВидСравнения  = ВидСравнения.ВСписке;
		
		СписокСтатей = СформироватьСодержимоеНабораСтатей(Набор);
		ФормаВыбора.ДопустимыеСтатьи = СписокСтатей;
		
		ФормаВыбора.СправочникСписок.Отбор.Ссылка.Значение      = ДополнитьСписокРодителями(СписокСтатей);
		
		ФормаВыбора.СправочникСписок.Отбор.Ссылка.Использование = Истина;
	КонецЕсли;	
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидНалоговойДекларации.Доступность = Ложь;

	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;
	ФормаВыбора.Открыть();

КонецПроцедуры

// Записывает документ спросив об этом у пользователя
//
// Параметры
//  Объект        - ДокументОбъект
//  ФормаОбъекта  – Тип - Форма
//                 форма документа из которого вызвана функция
//  ТекстВопроса  – Тип – Строка
//                 текст вопроса
//
// Возвращаемое значение:
//   Истина   – если не требуется запись документа или запись прошла успешно
//   Ложь     - отказ пользователя от записи или не удачная попытка записи
//
Функция ЗаписатьДокументПередВыполнениемДействия(Объект, ФормаОбъекта, ТекстВопроса) Экспорт

	Если Объект.Модифицированность() Тогда
		Ответ  = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Попытка
				Возврат ФормаОбъекта.ЗаписатьВФорме();
			Исключение
				Возврат Ложь;
			КонецПопытки;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли; 	
	
	Возврат Истина;

КонецФункции // ЗаписатьДокументПередВыполнениемДействия()

// Записывает документ в режиме отмены проведения, спросив об этом у пользователя
// Параметры
//  Объект        - ДокументОбъект
//  ФормаОбъекта  – Тип - Форма
//                 форма документа из которого вызвана функция
//  ТекстДействие  – Тип – Строка
//                 текст вопроса
//
// Возвращаемое значение:
//   Истина   – если не требуется запись документа или запись прошла успешно
//   Ложь     - отказ пользователя от записи или не удачная попытка записи
Функция ЗаписатьДокументОтменивПроведениеПередВыполнениемДействия(Объект, ФормаОбъекта, ТекстДействие = НеОпределено, ТекстВопрос1 = НеОпределено, ТекстВопрос2 = НеОпределено) Экспорт

	Если Объект.Проведен Тогда
		
		Если ТекстВопрос1 = Неопределено Тогда
			Если Вопрос("Автоматически "+ТекстДействие+" документ можно только после отмены его проведения. Выполнить отмену проведения документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если Вопрос(ТекстВопрос1, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли; 
		
		Попытка
			Возврат ФормаОбъекта.ЗаписатьВФорме(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			Возврат Ложь;
		КонецПопытки;
				
	ИначеЕсли Объект.Модифицированность() Тогда
		
		Если ТекстВопрос2 = Неопределено Тогда
			Если Вопрос("Автоматически "+ТекстДействие+" документ можно только после его записи. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если Вопрос(ТекстВопрос2, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			Возврат ФормаОбъекта.ЗаписатьВФорме(РежимЗаписиДокумента.Запись);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ЗаписатьДокументОтменивПроведение()

// Процедура заполняет вычисляемые колонки формы списка справочника СотрудникиОрганизаций
//
// Параметры
//  ТабличноеПоле   – Табличное поле
//  ОформленияСтрок – Коллекция значений типа ОформлениеСтроки табличного поля ТЧДокумента
//  ДатаСреза	 	- тип дата, дата на которую получаем данные работников организации
//
Процедура ЗаполнитьДанныеПоРаботникамОрганизации(ТабличноеПоле, ОформленияСтрок, ДатаСреза = Неопределено)Экспорт

	КолонкиТабличногоПоля = ТабличноеПоле.Колонки;
	ПоказыватьЗанимаемыхСтавок 			= КолонкиТабличногоПоля.ЗанимаемыхСтавок.Видимость;
	ПоказыватьПодразделениеОрганизации 	= КолонкиТабличногоПоля.ПодразделениеОрганизации.Видимость;
	ПоказыватьДолжность 				= КолонкиТабличногоПоля.Должность.Видимость;
	ПоказыватьГрафикРаботы 				= КолонкиТабличногоПоля.ГрафикРаботы.Видимость;
	ПоказыватьСостояние			 		= КолонкиТабличногоПоля.Состояние.Видимость;
	
	Если Не (ПоказыватьЗанимаемыхСтавок
		или ПоказыватьПодразделениеОрганизации 
		или ПоказыватьДолжность
		или ПоказыватьГрафикРаботы
		или ПоказыватьСостояние) Тогда
		
		Возврат;
	
	КонецЕсли; 
	
	МассивСотрудников = Новый Массив;
	Для Каждого СтрокаТабличногПоля Из ОформленияСтрок Цикл
		ДанныеСтроки = СтрокаТабличногПоля.ДанныеСтроки;
		Если ДанныеСтроки.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		МассивСотрудников.Добавить(ДанныеСтроки.Ссылка);
	КонецЦикла;

	РезультатЗапроса = ПолныеПрава.ПолучитьДанныеСотрудниковОрганизаций(МассивСотрудников, ДатаСреза, ПоказыватьПодразделениеОрганизации, ПоказыватьДолжность, ПоказыватьЗанимаемыхСтавок, ПоказыватьГрафикРаботы, ПоказыватьСостояние);
		
	Выборка = РезультатЗапроса.Выбрать();

	Для Каждого СтрокаТабличногПоля Из ОформленияСтрок Цикл
		ДанныеСтроки = СтрокаТабличногПоля.ДанныеСтроки;
		Если ДанныеСтроки.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(ДанныеСтроки.Ссылка, "Сотрудник") Тогда
			Если ПоказыватьЗанимаемыхСтавок Тогда
				СтрокаТабличногПоля.Ячейки.ЗанимаемыхСтавок.УстановитьТекст(Выборка.ЗанимаемыхСтавок);
			КонецЕсли;
			Если ПоказыватьПодразделениеОрганизации Тогда
				СтрокаТабличногПоля.Ячейки.ПодразделениеОрганизации.УстановитьТекст(Выборка.Подразделение);
			КонецЕсли;
			Если ПоказыватьДолжность Тогда
				СтрокаТабличногПоля.Ячейки.Должность.УстановитьТекст(Выборка.Должность);
			КонецЕсли;
			Если ПоказыватьГрафикРаботы Тогда
				СтрокаТабличногПоля.Ячейки.ГрафикРаботы.УстановитьТекст(Выборка.ГрафикРаботы);
			КонецЕсли;
			Если ПоказыватьСостояние Тогда
				СтрокаТабличногПоля.Ячейки.Состояние.УстановитьТекст(Выборка.Состояние + Формат(Выборка.Период,"ДФ=dd.MM.yyyy") + ". "+Выборка.ВидЗанятости);
			КонецЕсли;
		ИначеЕсли ПоказыватьСостояние Тогда
			//нет данных в регистре сведений РаботникиОрганизаций
			ВидДоговора = ДанныеСтроки.ВидДоговора;
			Если ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
				СтрокаСостояние = "Не принят(а)";	
			Иначе
				СтрокаСостояние = ВидДоговора;
			КонецЕсли;
			СтрокаТабличногПоля.Ячейки.Состояние.УстановитьТекст(СтрокаСостояние);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА КОММЕНТИРОВАНИЯ ДЕЙСТВИЙ

Процедура ОткрытьГрафик(Параметры) Экспорт
	
	Если Параметры.Количество() < 2 Тогда
		Для Каждого Элемент Из Параметры Цикл
			Сообщить(Элемент);
		КонецЦикла;

	Иначе
		ГрафикРаботы = Параметры[0];
		Дата = Параметры[1];
		Если ТипЗнч(ГрафикРаботы) = Тип("СправочникСсылка.ГрафикиРаботы") Тогда
			// Открываем справочник ГрафикиРаботы.
			ГрафикРаботы.ПолучитьФорму().Открыть();
		ИначеЕсли ТипЗнч(ГрафикРаботы) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			// Ищем и открываем документ Табель, если его нет, тогда индивидуальныйГрафик
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Сотрудник", ГрафикРаботы);
			Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ГрафикиРаботы.Документ
			|ПОМЕСТИТЬ ВТПодневныеДокументы
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
			|ГДЕ
			|	ГрафикиРаботы.ГрафикРаботы = &Сотрудник
			|	И НАЧАЛОПЕРИОДА(ГрафикиРаботы.Дата, МЕСЯЦ) = &Дата
			|	И ГрафикиРаботы.Месяц = &Дата
			|	И (НЕ ГрафикиРаботы.Документ В (ЗНАЧЕНИЕ(Документ.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.СдельныйНаряд.ПустаяСсылка)))
			|
			|СГРУППИРОВАТЬ ПО
			|	ГрафикиРаботы.Документ,
			|	ГрафикиРаботы.План";
			Запрос.Выполнить();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СводныеТабели.Регистратор, ЕСТЬNULL(ПодневныеТабели.Документ, ЕСТЬNULL(СводныеНаряды.Регистратор, ЕСТЬNULL(ПодневныеНаряды.Документ, ЕСТЬNULL(СводныеГрафики.Регистратор, ПодневныеГрафики.Документ))))) КАК документ
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СводныеТабели.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК СводныеТабели
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(СводныеТабели.Период, ДЕНЬ) = &Дата
			|			И СводныеТабели.Сотрудник = &Сотрудник
			|			И СводныеТабели.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
			|		
			|		СГРУППИРОВАТЬ ПО
			|			СводныеТабели.Регистратор) КАК СводныеТабели
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодневныеДокументы КАК ПодневныеТабели
			|		ПО (ПодневныеТабели.Документ ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СводныеНаряды.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК СводныеНаряды
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(СводныеНаряды.Период, ДЕНЬ) = &Дата
			|			И СводныеНаряды.Сотрудник = &Сотрудник
			|			И СводныеНаряды.Регистратор ССЫЛКА Документ.СдельныйНаряд
			|		
			|		СГРУППИРОВАТЬ ПО
			|			СводныеНаряды.Регистратор) КАК СводныеНаряды
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодневныеДокументы КАК ПодневныеНаряды
			|		ПО (ПодневныеНаряды.Документ ССЫЛКА Документ.СдельныйНаряд)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СводныеГрафики.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеГрафики
			|		ГДЕ
			|			СводныеГрафики.Сотрудник = &Сотрудник
			|			И СводныеГрафики.Месяц = &Дата) КАК СводныеГрафики
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодневныеДокументы КАК ПодневныеГрафики
			|		ПО (ПодневныеГрафики.Документ ССЫЛКА Документ.ВводИндивидуальныхГрафиковРаботыОрганизации)
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Сотрудник
			|	И ЕСТЬNULL(СводныеТабели.Регистратор, ЕСТЬNULL(ПодневныеТабели.Документ, ЕСТЬNULL(СводныеНаряды.Регистратор, ЕСТЬNULL(ПодневныеНаряды.Документ, ЕСТЬNULL(СводныеГрафики.Регистратор, ПодневныеГрафики.Документ))))) ЕСТЬ НЕ NULL ";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Выборка.Документ.ПолучитьФорму().Открыть();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает список предопределенных показателей схем мотивации 
//
Функция ПолучитьСписокПредопределенныхПоказателей() Экспорт 
	
	СписокПредопределенныхПоказателей = Новый СписокЗначений;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиСхемМотивации.Ссылка КАК Ссылка,
	|	ПоказателиСхемМотивации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПоказателиСхемМотивации КАК ПоказателиСхемМотивации
	|ГДЕ
	|	ПоказателиСхемМотивации.Предопределенный";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПредопределенныхПоказателей.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат СписокПредопределенныхПоказателей;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСПРАВЛЕНИЕ ДОКУМЕНТОВ

// В документах на одного сотрудника (отпуск, б/л и пр.) в зависимости от состояния 
// 	документа кнопки исправлений либо не показываются вообще, либо показывается одна из них
//
// Параметры
//	ПериодРегистрацииДокумента - дата - определяет месяц начисления документа
//  ДокументИсправлен, ДокументСторнирован - булево, флажки состояния документа
//	Кнопки - коллекция кнопок соответствующей панели документа
//  КнопкаИсправление, КнопкаОтменаИсправление - кнопки-эталоны
//
Процедура УстановитьКнопкиИсправленияДокументаОдногоСотрудника(ПериодРегистрацииДокумента, ДокументИсправлен, ДокументСторнирован, Кнопки, КнопкаИсправление, КнопкаОтменаИсправление) Экспорт

	Если Кнопки.Найти(КнопкаИсправление.Имя) <> Неопределено Или Кнопки.Найти(КнопкаОтменаИсправление.Имя) <> Неопределено Тогда
		СтароеИмя = Кнопки[Кнопки.Количество() - 1].Имя;
		НовоеИмя = "";
		Если Не ДокументСторнирован Тогда // Документ не был отсторнирован
			Если ДокументИсправлен Тогда  // Документ исправлен
				НовоеИмя = КнопкаОтменаИсправление.Имя;
			ИначеЕсли ПериодРегистрацииДокумента < НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату()) Тогда
				НовоеИмя = КнопкаИсправление.Имя;
			КонецЕсли;
		КонецЕсли;
		Если НовоеИмя <> СтароеИмя Тогда
			Кнопки.Удалить(Кнопки.Количество() - 1);
			Если НовоеИмя = КнопкаОтменаИсправление.Имя Тогда
				НоваяКнопка = Кнопки.Добавить("Новая", ТипКнопкиКоманднойПанели.Действие, , КнопкаОтменаИсправление.Действие);
				ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаОтменаИсправление);
			ИначеЕсли НовоеИмя = КнопкаИсправление.Имя Тогда
				НоваяКнопка = Кнопки.Добавить("Новая", ТипКнопкиКоманднойПанели.Действие, , КнопкаИсправление.Действие);
				ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаИсправление);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не ДокументСторнирован Тогда // Документ не был отсторнирован
		Если ДокументИсправлен Тогда  // Документ исправлен
			НоваяКнопка = Кнопки.Добавить("Новая", ТипКнопкиКоманднойПанели.Действие, , КнопкаОтменаИсправление.Действие);
			ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаОтменаИсправление);
		ИначеЕсли ПериодРегистрацииДокумента < НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату()) Тогда
			НоваяКнопка = Кнопки.Добавить("Новая", ТипКнопкиКоманднойПанели.Действие, , КнопкаИсправление.Действие);
			ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаИсправление);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает новый документ, заполняет его данными исправляемого документа 
// 	и предъявляет пользователю для дальнейшей работы
//
// Параметры
//	ИсправляемыйДокумент - тип ДокументОбъект.<Имя документа> - документ, для которого вводится исправление
//  ФормаИсправляемогоДокумента - форма этого документа
//  Сотрудники - массив сотрудников, по которым выполняется исправление; необязательный, если не указан - по всем
//
Функция ВвестиДокументИсправление(ИсправляемыйДокумент, ФормаИсправляемогоДокумента = Неопределено, Сотрудники = Неопределено, ПериодРегистрации = Неопределено, ТекПользователь = Неопределено) Экспорт 
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;	
	
	Если ИсправляемыйДокумент.Проведен Тогда
		
		Если ФормаИсправляемогоДокумента <> Неопределено Тогда
			ТекстВопроса = "Для исправления необходимо записать документ. Продолжить?";
			Если Не ЗаписатьДокументПередВыполнениемДействия(ИсправляемыйДокумент, ФормаИсправляемогоДокумента, ТекстВопроса) Тогда
				Возврат Неопределено
			КонецЕсли;
		КонецЕсли;

		Исправление = Документы[ИсправляемыйДокумент.Метаданные().Имя].СоздатьДокумент();
		Исправление.Дата = ОбщегоНазначения.ПолучитьРабочуюДату();
		Исправление.Организация = ИсправляемыйДокумент.Организация;
		Исправление.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
		Исправление.ПериодРегистрации = Макс(?(ЗначениеЗаполнено(ПериодРегистрации),ПериодРегистрации,НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату())),ДобавитьМесяц(ИсправляемыйДокумент.ПериодРегистрации,1));
		Исправление.ЗаполнитьПоПерерассчитываемомуДокументу(ИсправляемыйДокумент, Сотрудники);
		ФормаДокумента = Исправление.ПолучитьФорму(,,ИсправляемыйДокумент.Ссылка);
		ФормаДокумента.Открыть();
		
		Возврат ФормаДокумента
		
	Иначе
		Предупреждение("Исправить можно только проведенный документ!");
		Возврат Неопределено
	КонецЕсли;

КонецФункции

// Процедура собирает данные о существующих документах-исправлениях всех уровней,
// 	и формирует текст информирования пользователя, показывает его и запрашивает согласие 
// 	пользователя на удаление исправлений.
// 	Если пользователь согласился, очищает в найденных документах-исправлениях  
// 	поле ПерерассчитываемыйДокумент и помечает документы на удаление.
//
// Параметры
//	ИсправленныйДокумент - тип ДокументСсылка.<Имя документа> - ошибочно исправленный документ
//
Процедура ОтменитьИсправлениеДокумента(ИсправленныйДокумент) Экспорт 
	
	МетаданныеДокумента = ИсправленныйДокумент.Метаданные();
	РежимПоиска = ?(МетаданныеДокумента.Реквизиты.Найти("Сотрудник") = Неопределено, "КритерийОтбора","ТаблицаДокумента");	
	ИмяДокумента = МетаданныеДокумента.Имя;

	ИсправленияКОтмене = Новый Массив;
	Исправление = ПроведениеРасчетов.ПолучитьДокументИсправление(ИсправленныйДокумент, РежимПоиска, ИмяДокумента);
	Пока ЗначениеЗаполнено(Исправление) Цикл
		
		Если РежимПоиска = "КритерийОтбора" Тогда
			ИсправлениеСледующегоУровня = Новый Массив;
			Для каждого Значение Из Исправление Цикл
				ИсправленияКОтмене.Добавить(Значение);
				Для каждого ЗначениеСледующегоУровня Из ПроведениеРасчетов.ПолучитьДокументИсправление(Значение, РежимПоиска, ИмяДокумента) Цикл
					ИсправлениеСледующегоУровня.Добавить(ЗначениеСледующегоУровня);
				КонецЦикла;
			КонецЦикла;
			Исправление = ИсправлениеСледующегоУровня;
		Иначе
			ИсправленияКОтмене.Добавить(Исправление);
			Исправление = ПроведениеРасчетов.ПолучитьДокументИсправление(Исправление, РежимПоиска, ИмяДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	ВсегоИсправлений = ИсправленияКОтмене.Количество();
	Если ВсегоИсправлений <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Исправления",ИсправленияКОтмене);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(Документы.ПериодРегистрации) КАК ПериодРегистрацииС,
		|	МАКСИМУМ(Документы.ПериодРегистрации) КАК ПериодРегистрацииПо,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документы.ПериодРегистрации) КАК ВсегоПериодовРегистрации
		|ИЗ
		|	Документ." + ИмяДокумента + " КАК Документы
		|ГДЕ
		|	Документы.Ссылка В (&Исправления)";
		Запрос.Выполнить();
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Если Выборка.ВсегоПериодовРегистрации = 1 Тогда
			Месяц = Формат(Выборка.ПериодРегистрацииС, "ДФ=MMMM");
			ОписаниеПериода = НРег(Месяц) + " " + Формат(Выборка.ПериодРегистрацииС,"ДФ=гггг") + " г."
		ИначеЕсли Выборка.ВсегоПериодовРегистрации = 2 Тогда
			Месяц = Формат(Выборка.ПериодРегистрацииС, "ДФ=MMMM");
			ОписаниеПериода = НРег(Месяц) + " " + Формат(Выборка.ПериодРегистрацииС,"ДФ=гггг") + " г. и "; 
			Месяц = Формат(Выборка.ПериодРегистрацииПо, "ДФ=MMMM");
			ОписаниеПериода = ОписаниеПериода + НРег(Месяц) + " " + Формат(Выборка.ПериодРегистрацииС,"ДФ=гггг") + " г." 
		Иначе
			Месяц = Формат(Выборка.ПериодРегистрацииС, "ДФ=MMMM");
			ОписаниеПериода = "в период с " + НРег(Месяц) + " " + Формат(Выборка.ПериодРегистрацииС,"ДФ=гггг") + " г. по "; 
			Месяц = Формат(Выборка.ПериодРегистрацииПо, "ДФ=MMMM");
			ОписаниеПериода = ОписаниеПериода + НРег(Месяц) + " " + Формат(Выборка.ПериодРегистрацииС,"ДФ=гггг") + " г." 
		КонецЕсли;
		
		ТекстВопроса =  ОбщегоНазначения.ФормаМножественногоЧисла("Найден ","Найдено ","Найдено ",ВсегоИсправлений) + ВсегоИсправлений 
					+ ОбщегоНазначения.ФормаМножественногоЧисла(" документ-исправление"," документа-исправления"," документов-исправлений",ВсегоИсправлений) 
					+ ОбщегоНазначения.ФормаМножественногоЧисла(", зарегистрированный ",", зарегистрированных ",", зарегистрированных ",ВсегоИсправлений) 
					+ ОписаниеПериода + " Отменить исправления?";
		
		Ответ  = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, ,КодВозвратаДиалога.ОК);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
			ОбработкаКомментариев.УдалитьСообщения();
			Заголовок = ОбщегоНазначения.КомментарийРасчета("Удаление документов-исправлений");
			Если ВсегоИсправлений > 1 Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			Для Сч = 1 По ВсегоИсправлений Цикл
				Значение = ИсправленияКОтмене[ВсегоИсправлений - Сч];
				Документ = Значение.ПолучитьОбъект();
				ОбщегоНазначения.КомментарийРасчета("Документ №" + Документ.Номер + " от " + Документ.Дата + " обработан успешно. ", Заголовок, "Открыть", Значение);
				Документ.ПерерассчитываемыйДокумент = Неопределено;
				Документ.ПометкаУдаления = Истина;
				Попытка
					Документ.Записать(?(Документ.Проведен, РежимЗаписиДокумента.ОтменаПроведения,РежимЗаписиДокумента.Запись));
				Исключение
					Если ВсегоИсправлений > 1 Тогда
						ОтменитьТранзакцию();
					КонецЕсли;
					ОбщегоНазначения.КомментарийРасчета("Документ №" + Документ.Номер + " от " + Документ.Дата + " удалить не удалось! Процедура отмены исправлений отменена. ", , "Открыть", Значение,Перечисления.ВидыСообщений.Ошибка);
					ОбработкаКомментариев.ПоказатьСообщения();
					Возврат;
				КонецПопытки;
			КонецЦикла;
			Если ВсегоИсправлений > 1 Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			ОбработкаКомментариев.ПоказатьСообщения();
	
		Иначе
			Возврат 
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

// Устанавливает имя и доступность кнопки ТекущийСотрудник механизма исправлений
//
// Параметры
//	ТипДанных - тип Тип.- определяет тип переданного текущего элемента: Сотрудник или Физлицо
//  ТекущийСотрудник - тип СправочникСсылка.СотрудникиОрганизаций или СправочникСсылка.ФизическиеЛица, текущий сотрудник формы
//  СотрудникиСИсправлениями - тип Соответствие, содержит всех сотрудников, чьи расчеты уже подвергались исправлениям
//  Кнопка - описываемая кнопка командной панели
//  ИмяБезСотрудника - строка, имя кнопки "по умолчанию"
//
Функция ОбновитьКнопкуИсправленияРасчетовСотрудника(ТипДанных, ТекущийСотрудник, СотрудникиСИсправлениями, Кнопка, ИмяБезСотрудника = "Расчеты текущего сотрудника") Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Кнопка.Текст = ИмяБезСотрудника;             
		Кнопка.Доступность = Истина;
		Возврат ""
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудник", ТекущийСотрудник);
		Если ТипДанных = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Наименование,
			|	СотрудникиОрганизаций.Физлицо.Пол КАК Пол
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Сотрудник";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.Пол
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Сотрудник";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Не Выборка.Следующий() Тогда
			Кнопка.Текст = ИмяБезСотрудника;             
			Кнопка.Доступность = Истина;
			Возврат ""
		КонецЕсли;
		
		ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.Наименование);
		
		ПозицияПервогоПробела = Найти(ФИО + " "," ");
		Фамилия  = Лев(ФИО,ПозицияПервогоПробела-1);
		Инициалы = Сред(ФИО,ПозицияПервогоПробела+1);
		
		Кнопка.Текст = "Расчеты " + ФИО;
		Кнопка.Доступность = (СотрудникиСИсправлениями[ТекущийСотрудник] = Неопределено);
		
		Возврат ФИО;
		
	КонецЕсли;	
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРЕДСТАВЛЕНИЯ ИНФОРМАЦИИ В ФОРМЕ

// По описателям состояния расчетного документа (флажкам) формирует текст инфо-строки и важность сообщения
//
// Параметры
//	НеЗаполнен,ЗаполненСОшибками,Рассчитан,Проведен,ЭтоИсправление,ДокументИсправлен,Отсторнирован - булево (все)
//		описывают достижение документом того или иного состояния
//
// Возвращаемое значение:
//	Структура из двух строковых значений - ТекстСообщения и ВажностьСообщения
//
Функция ПолучитьОписаниеРасчетногоДокумента(Заполнен = Ложь, ЗаполненСОшибками = Ложь, Рассчитан = Ложь, Проведен = Ложь, ЭтоИсправление = Ложь, ДокументИсправлен = Ложь, Отсторнирован = Ложь, ТолькоПросмотр = Ложь, ИмеетПродолжение = Ложь, ЯвляетсяПродолжением = Ложь) Экспорт 

	ТекстСообщения = "";
	ВажностьСообщения = "";
	
	Если Не Заполнен Тогда
		ВажностьСообщения = "СообщениеОПроблемах";
		ТекстСообщения = "Документ не заполнен";
	ИначеЕсли ЭтоИсправление Тогда
		ТекстСообщения = "Документ является исправлением документа прошлого периода; ";
		Если ДокументИсправлен Тогда
			ВажностьСообщения = "СообщениеОПроблемах";
			Если Не Рассчитан Тогда
				ТекстСообщения = ТекстСообщения + "не был рассчитан, но ";
			КонецЕсли;
			ТекстСообщения = ТекстСообщения + "был исправлен; редактирование документа запрещено"
		ИначеЕсли ЗаполненСОшибками Тогда
			ВажностьСообщения = "СообщениеОПроблемах";
			ТекстСообщения = ТекстСообщения + "поля документа заполнены не полностью или неверно";
		ИначеЕсли Не Рассчитан Тогда
			ВажностьСообщения = "ВажнаяИнформация";
			ТекстСообщения = ТекстСообщения + "документ не рассчитан";
		ИначеЕсли Рассчитан И Не Проведен Тогда
			ВажностьСообщения = "Информация";
			ТекстСообщения = ТекстСообщения + "рассчитан, но не проведен";
		ИначеЕсли Рассчитан И Проведен Тогда
			ВажностьСообщения = "Информация";
			ТекстСообщения = ТекстСообщения + "рассчитан и проведен";
		КонецЕсли;
	ИначеЕсли ДокументИсправлен Тогда
		ВажностьСообщения = "СообщениеОПроблемах";
		ТекстСообщения = "Документ ";
		Если Не Рассчитан Тогда
			ТекстСообщения = ТекстСообщения + "не был рассчитан, но ";
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + "был исправлен; редактирование документа запрещено"
	ИначеЕсли Отсторнирован Тогда
		ВажностьСообщения = "СообщениеОПроблемах";
		ТекстСообщения = "Документ был отменен полностью (отсторнирован); редактирование документа запрещено";
	ИначеЕсли ЗаполненСОшибками Тогда
		ВажностьСообщения = "СообщениеОПроблемах";
		ТекстСообщения = "Поля документа заполнены не полностью или неверно";
	ИначеЕсли Не Рассчитан Тогда
		ВажностьСообщения = "ВажнаяИнформация";
		ТекстСообщения = "Документ не рассчитан";
	ИначеЕсли Рассчитан И Не Проведен Тогда
		ВажностьСообщения = "Информация";
		ТекстСообщения = "Документ рассчитан, но не проведен";
	ИначеЕсли Рассчитан И Проведен Тогда
		ВажностьСообщения = "Информация";
		ТекстСообщения = "Документ рассчитан и проведен";
	КонецЕсли;
	
	Если ТолькоПросмотр и НЕ ДокументИсправлен и НЕ Отсторнирован Тогда
		ТекстСообщения = ТекстСообщения + ". Редактирование документа запрещено";
	КонецЕсли;
	
	ТекстПродолжений = "";
	Если ЯвляетсяПродолжением Тогда
		ТекстПродолжений = "Этот больничный является б/л-продолжением. ";
	КонецЕсли;
	Если ИмеетПродолжение Тогда
		ТекстПродолжений = ТекстПродолжений + "Этот больничный имеет продолжение. ";
	КонецЕсли;
	
	Возврат Новый Структура("ТекстСообщения,ВажностьСообщения", ТекстПродолжений + ТекстСообщения, ВажностьСообщения)

КонецФункции

// Выводит надпись и соответствующую ей картинку
//
// Параметры
//  ЭУНадпись, ЭУКартинка - элементы управления формы, соответственно надпись и картинка
//  ТекстСообщения - строка - выводимое сообщение
//  ВажностьСообщения - строка - определяет расцветку текста и картинку
//		допустимые значения: "СообщениеОПроблемах", "ВажнаяИнформация" и "Информация"
//
Процедура ПоказатьИнформациюОДокументе(ЭУНадпись = Неопределено, ЭУКартинка = Неопределено, ТекстСообщения = "", ВажностьСообщения = "") Экспорт 

	Если ЭУНадпись = Неопределено Или ЭУКартинка = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ВажностьСообщения = "ВажнаяИнформация" Тогда
		ЭУКартинка.Картинка = БиблиотекаКартинок.СообщениеВажнаяИнформация;
		ЭУНадпись.ЦветТекста = ЦветаСтиля.ТекстСообщенияВажнойИнформации;
	ИначеЕсли ВажностьСообщения = "СообщениеОПроблемах" Тогда
		ЭУКартинка.Картинка = БиблиотекаКартинок.СообщениеОПроблемах;
		ЭУНадпись.ЦветТекста = ЦветаСтиля.ТекстСообщенияОПроблемах;
	ИначеЕсли ВажностьСообщения = "Ошибка" Тогда
		ЭУКартинка.Картинка = БиблиотекаКартинок.СообщениеОшибка;
		ЭУНадпись.ЦветТекста = ЦветаСтиля.ТекстСообщенияОПроблемах;
	Иначе
		ЭУКартинка.Картинка	= БиблиотекаКартинок.СообщениеИнформация;
		ЭУНадпись.ЦветТекста = ЦветаСтиля.ТекстСообщенияИнформации;
	КонецЕсли;
	ЭУНадпись.Заголовок = ТекстСообщения;
	
КонецПроцедуры // ПоказатьИнформациюОДокументе()

Процедура УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ФормаДокумента) Экспорт
	
	Если НЕ ФормаДокумента.ТолькоПросмотр Тогда
		ФормаДокумента.ТолькоПросмотр = НастройкаПравДоступа.ДокументВЗакрытомПериоде(ДокументОбъект);
	КонецЕсли;
	
КонецПроцедуры	// УстановитьДоступностьФормыДляРедактирования

Процедура УстановитьОтборыИСверткуПоказателей(ЭлементыФормы, Показатели, ПроизвольнаяФормулаРасчета = Истина) Экспорт
	
	ПоказателиДляОтбора = Новый СписокЗначений;
	Если ПроизвольнаяФормулаРасчета Тогда
		Для Каждого СтрокаПоказатель Из Показатели Цикл
			Показатель = СтрокаПоказатель.Показатель;
			Если Показатель.ВозможностьИзменения = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется И Не Показатель.Предопределенный
				И Не (Показатель.ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная Или Показатель.ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
				И Не (Показатель.ТарифнаяСтавка ИЛИ Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная
				ИЛИ Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная 
				ИЛИ Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)Тогда
				
				ПоказателиДляОтбора.Добавить(Показатель);
			КонецЕсли;
		КонецЦикла;
		ЭлементыФормы.Показатели.ОтборСтрок.Показатель.Использование = Истина;
		ЭлементыФормы.Показатели.ОтборСтрок.Показатель.ВидСравнения = ВидСравнения.ВСписке;
		ЭлементыФормы.Показатели.ОтборСтрок.Показатель.Значение = ПоказателиДляОтбора;
	КонецЕсли;
	
	ИзменитьВидимостьПанелиПоВертикалиНиз(ЭлементыФормы.ПанельПредставлениеФормулы, ПоказателиДляОтбора.Количество() <> 0, ЭлементыФормы.СпособРасчетаПредставление, ЭлементыФормы.ПанельПоказателей, ЭлементыФормы.РазделительПоказателей)
	
КонецПроцедуры

// Процедура управляет отображением панелей формы путем свертки в низ
// Пареметры
//	 Панель - Панель, к низу которой производим привязку панели ВерхняяПанель при свертке панели НижняяПанель
//	 ОтображатьПанель - булево
//	 ВерхняяПанель - панель формы, которая всегда видима
//	 НижняяПанель - панель формы, которую сворачиваем в низ
//	 Разделитель - разделитель верхней и нижней панели
//
Процедура ИзменитьВидимостьПанелиПоВертикалиНиз(Панель, ОтображатьПанель, ВерхняяПанель, НижняяПанель, Разделитель) Экспорт
	
	Если ОтображатьПанель Тогда
		
		Если НижняяПанель.Свертка = РежимСверткиЭлементаУправления.Низ Тогда
			// необходимо развернуть панель
			
			// текущая высота основной панели
			НачальнаяВысотаОсновнойПанели = ВерхняяПанель.Высота;
			
			// на основную панель отдаем половину высоты
			ВерхняяПанель.Высота = Окр(НачальнаяВысотаОсновнойПанели * 0.6 ,0);
			
			// развернем разделитель, устатановим его внизу основной панели, настроим привязки
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Нет;
			Разделитель.Верх = ВерхняяПанель.Верх + ВерхняяПанель.Высота;
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Верх, Панель, ГраницаЭлементаУправления.Низ);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Разделитель, ГраницаЭлементаУправления.Низ);
			
			// развернем нижнюю панель,установим ее к разделителю, настроим привязки
			НижняяПанель.Свертка = РежимСверткиЭлементаУправления.Нет;
			НижняяПанель.Верх = Разделитель.Верх + 6;
            НижняяПанель.Высота = НачальнаяВысотаОсновнойПанели - ВерхняяПанель.Высота - 6;
			НижняяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Разделитель, ГраницаЭлементаУправления.Верх);
			НижняяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
			
		КонецЕсли;
		
		ВерхняяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Разделитель, ГраницаЭлементаУправления.Верх);
		
	Иначе // надо скрыть нижнюю панель	
		
		Если НижняяПанель.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
			
			//это та высота основной панели, которую необходимо установить
			ВысотаОсновнойПанели = НижняяПанель.Верх + НижняяПанель.Высота - ВерхняяПанель.Верх;
			
			// свернем элементы
			Разделитель.Свертка = РежимСверткиЭлементаУправления.Низ;
			НижняяПанель.Свертка = РежимСверткиЭлементаУправления.Низ;
			
			//перенесем ЭУ в низ формы и переопределим привязки
			Разделитель.Верх  = ВысотаОсновнойПанели;
			НижняяПанель.Верх = ВысотаОсновнойПанели;
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
			НижняяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);

			
			// распахнем и привяжем основную панель
			ВерхняяПанель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
			ВерхняяПанель.Высота = ВысотаОсновнойПанели;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура открывает редактор формулы расчета из вида расчета
//
// Параметры
//  ФормаПВР  - форма вида расчета из которой вызывается редактор формул расчета
//	Показатели - таблица показателей 
//  Наименование - наименование вида расчета
//  ФормулаРасчета - формула расчета
//
Процедура ОткрытьФормуРедактированияФормулы(ФормаПВР, Показатели, Наименование, ФормулаРасчета, ВидРасчета, ВидПВР = "") Экспорт 
	
	РедакторФормулРасчета = ПолучитьОбщуюФорму("РедакторФормулРасчета", ФормаПВР);
	РедакторФормулРасчета.Заголовок = "Редактирование формулы расчета: " + Наименование;
	
	ПоказателиДляФормыВвода = Новый СписокЗначений;
	
	ФормулаРасчетаДляФормулы = ФормулаРасчета;
	
	ФормулаРасчетаДляФормулы = СтрЗаменить(ФормулаРасчетаДляФормулы,"ПроведениеРасчетов.", "");

	
	Для Каждого Показатель Из Показатели Цикл
		
		//ПоказательДляФормулы = Строка(Показатель.Показатель.Идентификатор);
		//				
		//ФормулаРасчетаДляФормулы	= СтрЗаменить(ФормулаРасчетаДляФормулы, "ИсходныеДанные.Показатель"+Показатель.НомерСтроки, ПоказательДляФормулы);
		//
		ПоказателиДляФормыВвода.Добавить(Показатель.Показатель);
		
	КонецЦикла;
	
	ФормулаРасчетаДляФормулы = ПроведениеРасчетов.ПолучитьHTLMКодФормулыРасчета(ФормулаРасчетаДляФормулы, Показатели, "Текст", Истина);

	
	РедакторФормулРасчета.ВидРасчета	= ВидРасчета;
	РедакторФормулРасчета.Показатели	= ПоказателиДляФормыВвода;	
	РедакторФормулРасчета.ФормулаРасчета= ФормулаРасчетаДляФормулы;
	РедакторФормулРасчета.ВидПВР		= ВидПВР;
	РедакторФормулРасчета.Открыть();
	

КонецПроцедуры //ОткрытьФормуРедактированияФормулы

// Эта функция возвращает информацию о виде расчета из переданного соответствия
// Если в соответствии не найдена информация о виде расчета - она подготавливается и 
// помещается в соответствие
// Применяется для работы с формами, в которых активно требуется получать 
// информащцию о видах расчета, например, при выводе строки табличного поля
//
// Параметры:      
//	СведенияОВидахРасчета - соответствие, у котрого в качестве ключа - ПланВидовРасчетаСсылка, а 
//  				  в качестве значения - структура из элементов
//					  РазмерТребуется - булево - если да, то при вводе такого 
//										вида расчета требуется проставлять значение "размер" 
//										(суммы, проценты и проч. показатели, используемые при расчете)
//
//	ВидРасчета - ПланВидовРасчетаСсылка
//
// Возвращаемое значение:
//  Описанная выше структура
//
Функция ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ВидРасчета, Режим = "ПлановыеНачисления") Экспорт
	
	СведенияОВидеРасчета = СведенияОВидахРасчета[ВидРасчета];
	
	Если СведенияОВидеРасчета = Неопределено Тогда
		ТипВидРасчета = ТипЗнч(ВидРасчета);
		ИзменениеПоказателяНеУказано = Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка();
				
		СведенияОВидеРасчета = Новый Структура("КоличествоПоказателей,РазмерТребуется,НеТребуетВалюты,ТребуетВводаТарифногоРазряда,ФактКоличествоПоказателей",1, Ложь, Ложь, Ложь,0);
																					
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.Показатель,
		|	ВЫБОР
		|		КОГДА  НЕ Показатели.ЗапрашиватьПриКадровыхПеремещениях
		|			ТОГДА ИСТИНА
		|       ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НЕЗапрашиватьПриКадровыхПеремещениях,
		|	ВЫБОР
		|		КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ПустаяСсылка) 
		|			ТОГДА ИСТИНА
		|	    ИНАЧЕ Показатели.Показатель.Предопределенный
		|	КОНЕЦ КАК Предопределенный,
		|	ВЫБОР КОГДА Показатели.Показатель.Предопределенный ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПредопределенный,
		|	Показатели.Показатель.Наименование КАК ПоказательНаименование,
		|	Показатели.Показатель.ТипПоказателя,
		|	ЕСТЬNULL(Показатели.Показатель.ВозможностьИзменения, ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)) КАК ПоказательВозможностьИзменения,
		|	Показатели.НомерСтроки,
		|	Максимум(Показатели.НомерСтроки) КАК КоличествоПоказателей
		|ИЗ ПланВидовРасчета."+ВидРасчета.Метаданные().Имя+".Показатели КАК Показатели
		////Если ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ПланВидовРасчета."+ВидРасчета.Метаданные().Имя+".Показатели КАК Показатели";
		////ИначеЕсли ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ПланВидовРасчета.Удержания.Показатели КАК Показатели";
		////КонецЕсли;
		////Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	Показатели.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Показатели.Показатель,
		|	ВЫБОР
		|		КОГДА  НЕ Показатели.ЗапрашиватьПриКадровыхПеремещениях
		|			ТОГДА ИСТИНА
		|       ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Показатели.Показатель = Значение(Справочник.ПоказателиСхемМотивации.ПустаяСсылка) 
		|			ТОГДА ИСТИНА
		|	    ИНАЧЕ Показатели.Показатель.Предопределенный
		|	КОНЕЦ,
		|	Показатели.Показатель.Наименование,
		|	Показатели.Показатель.ТипПоказателя,
		|	ЕСТЬNULL(Показатели.Показатель.ВозможностьИзменения, ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)),
		|	Показатели.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка",ВидРасчета);

		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			СтрокаТаблицыСведений = РезультатЗапроса.Выбрать();
			Пока СтрокаТаблицыСведений.Следующий() Цикл
				
				СведенияОВидеРасчета["КоличествоПоказателей"] = Макс(СведенияОВидеРасчета["КоличествоПоказателей"], СтрокаТаблицыСведений["КоличествоПоказателей"]);
				СведенияОВидеРасчета["ФактКоличествоПоказателей"] = Макс(СтрокаТаблицыСведений["КоличествоПоказателей"],СведенияОВидеРасчета["ФактКоличествоПоказателей"]);
				
				СчПоказателей 			= СтрокаТаблицыСведений.НомерСтроки;
				
				ВозможностьИзменения	= СтрокаТаблицыСведений["ПоказательВозможностьИзменения"];
				ТипПоказателя			= СтрокаТаблицыСведений["ПоказательТипПоказателя"];
				
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",3);
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "ВозможностьИзменения",СтрокаТаблицыСведений["ПоказательВозможностьИзменения"]);
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Наименование",СтрокаТаблицыСведений["ПоказательНаименование"]);
				
				СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей ,СтрокаТаблицыСведений["Показатель"]);
				

				Если СтрокаТаблицыСведений["НЕЗапрашиватьПриКадровыхПеремещениях"] <> Null
					И СтрокаТаблицыСведений["НЕЗапрашиватьПриКадровыхПеремещениях"] 
					И Не СтрокаТаблицыСведений["ЭтоПредопределенный"] Тогда
					Если Режим = "ПлановыеНачисления" Тогда
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
				   Иначе
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость" ,Истина);
						Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Числовой Тогда
							
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный Тогда

							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",2);
							
							
						ИначеЕсли (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
							Или (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная) Тогда

							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						Иначе
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
							СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
							СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
							СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
							
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли СтрокаТаблицыСведений["Предопределенный"] <> Null И СтрокаТаблицыСведений["Предопределенный"] Тогда
					
					Если Режим <> "ПлановыеНачисления" И (СтрокаТаблицыСведений.Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная
						     или СтрокаТаблицыСведений.Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная
							 или СтрокаТаблицыСведений.Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая) Тогда
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Истина);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);	 
					Иначе
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
					КонецЕсли;	
				ИначеЕсли Режим = "ПлановыеНачисления" 
					и (СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВводитсяПриРасчете
					Или СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете) Тогда
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость", Ложь);
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость" , Ложь);
					СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость" , Ложь);
					СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость" , Ложь);
					СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость" , Ложь);
					
				Иначе
					СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "НаименованиеВидимость" ,Истина);
					Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Числовой Тогда

						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный Тогда
						
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Точность",2);
						
						
					ИначеЕсли (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
						Или (ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная) Тогда
						
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Ложь);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					Иначе
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "НаименованиеВидимость", Ложь);
						СведенияОВидеРасчета.Вставить("ПоказательТР" + СчПоказателей + "Видимость", Ложь);						
						СведенияОВидеРасчета.Вставить("Показатель" + СчПоказателей + "Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта" + СчПоказателей + "Видимость", Ложь);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СведенияОВидеРасчета.Вставить("Показатель1Наименование", "");
			СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель1Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель1Точность", 2);
			СведенияОВидеРасчета.Вставить("Показатель1ВозможностьИзменения", Ложь);
			СведенияОВидеРасчета.Вставить("ПоказательТР1НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("ПоказательТР1Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Ложь);


			СведенияОВидеРасчета.Вставить("Показатель2Наименование", "");
			СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель2Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Валюта2Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель2Точность", 2);
			СведенияОВидеРасчета.Вставить("Показатель2ВозможностьИзменения", Ложь);
			
			СведенияОВидеРасчета.Вставить("ПоказательТР2НаименованиеВидимость", Ложь);
			СведенияОВидеРасчета.Вставить("ПоказательТР2Видимость", Ложь);
			СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Ложь);

			
		КонецЕсли;
		
		// заполним для регламентированных способов оплаты труда
		Если ЗначениеЗаполнено(ВидРасчета) И (ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")
				Или ТипВидРасчета = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций")) Тогда
			СтруктураВидаРасчета = Новый Структура("СпособРасчета,ТребуетВводаТарифногоРазряда");
			ЗаполнитьЗначенияСвойств(СтруктураВидаРасчета,ВидРасчета);
			Если СтруктураВидаРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
				СведенияОВидеРасчета.Вставить("ФактКоличествоПоказателей",0);
				СведенияОВидеРасчета["Показатель1Точность"] = 3;
				Если СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Процент оплаты");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке	Тогда
					Если СтруктураВидаРасчета.ТребуетВводаТарифногоРазряда Тогда
						СведенияОВидеРасчета.Вставить("ПоказательТР1НаименованиеВидимость", Истина);
						СведенияОВидеРасчета.Вставить("ПоказательТР1Видимость", Истина);
						СведенияОВидеРасчета.Вставить("ПоказательТР1Наименование", "Тарифная ставка");
						СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
					Иначе
						СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Оклад/Тариф");
						СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
						СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
						СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
					КонецЕсли;
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы Тогда
					СведенияОВидеРасчета["КоличествоПоказателей"] = 2;
					СведенияОВидеРасчета["ФактКоличествоПоказателей"] = 2;
					Если Режим = "ПлановыеНачисления" Тогда
						СведенияОВидеРасчета["Показатель1Наименование"] = "Часовой тариф";
						СведенияОВидеРасчета["Показатель1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Ложь;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель2Наименование"] = "Процент доплаты";
						СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					Иначе
						СведенияОВидеРасчета["Показатель1Наименование"] = "Часовой тариф";
						СведенияОВидеРасчета["Показатель1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2Наименование"] = "Процент доплаты";
						СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					КонецЕсли;
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеУмножитьНаПроцент
					Тогда
					СведенияОВидеРасчета["КоличествоПоказателей"] = 2;
					СведенияОВидеРасчета["ФактКоличествоПоказателей"] = 2;
					Если Режим = "ПлановыеНачисления" Тогда
						СведенияОВидеРасчета["Показатель1Наименование"] = "Часовой тариф";
						СведенияОВидеРасчета["Показатель1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Ложь;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель2Наименование"] = "Процент доплаты";
						СведенияОВидеРасчета["Показатель2Видимость"] = Ложь;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Ложь;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					Иначе
						СведенияОВидеРасчета["Показатель1Наименование"] = "Часовой тариф";
						СведенияОВидеРасчета["Показатель1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта1Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2Наименование"] = "Процент доплаты";
						СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
						СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;				
						СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;
					КонецЕсли;	
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпуска
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма средней");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуКомпенсацияОтпуска Тогда
					СведенияОВидеРасчета["КоличествоПоказателей"] = 2;
					СведенияОВидеРасчета["ФактКоличествоПоказателей"] = 2;
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма средней");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
					
					СведенияОВидеРасчета.Вставить("Показатель2Наименование", "Время");
					СведенияОВидеРасчета.Вставить("Показатель2Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель2НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта2Видимость", Ложь);
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма средней");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);	
				ИначеЕсли СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ВыходноеПособие Тогда
					СведенияОВидеРасчета["КоличествоПоказателей"] = 2;
					СведенияОВидеРасчета["ФактКоличествоПоказателей"] = 2;

					СведенияОВидеРасчета["Показатель1Наименование"] = "Сумма средней";
					СведенияОВидеРасчета["Показатель1Видимость"] = Истина;
					СведенияОВидеРасчета["Показатель1НаименованиеВидимость"] = Истина;			
					СведенияОВидеРасчета["Валюта1Видимость"] = Ложь;
					
					СведенияОВидеРасчета["Показатель2Наименование"] = "Время";
					СведенияОВидеРасчета["Показатель2Видимость"] = Истина;
					СведенияОВидеРасчета["Показатель2НаименованиеВидимость"] = Истина;			
					СведенияОВидеРасчета["Валюта2Видимость"] = Ложь;	
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма по договору");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);	
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом 
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом 
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела
					Или СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Процент удержаний");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела
					Или  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Сумма");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
				ИначеЕсли  СтруктураВидаРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор Тогда
					СведенияОВидеРасчета.Вставить("Показатель1Наименование", "Процент сбора");
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Ложь);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Ложь);
					СведенияОВидеРасчета.Вставить("Валюта1Видимость", Ложь);
				ИначеЕсли ПроведениеРасчетов.СпособРасчетаТребуетРазмер(СтруктураВидаРасчета.СпособРасчета) Тогда
					СведенияОВидеРасчета.Вставить(СведенияОВидеРасчета.РазмерТребуется, Истина);
					СведенияОВидеРасчета.Вставить("Показатель1НаименованиеВидимость", Истина);
					СведенияОВидеРасчета.Вставить("Показатель1Видимость", Истина);
					Если НЕ ПроведениеРасчетов.СпособРасчетаНеТребуетВалюты(СтруктураВидаРасчета.СпособРасчета) И Найти(Строка(СтруктураВидаРасчета.СпособРасчета), "П1") = 0 Тогда
						СведенияОВидеРасчета.Вставить("Валюта1Видимость", Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СведенияОВидахРасчета[ВидРасчета] = СведенияОВидеРасчета;
	КонецЕсли;

	Возврат СведенияОВидеРасчета;
	
КонецФункции  // ПолучитьСведенияОВидеРасчетаСхемыМотивации

                
// Формирует представление переданного способа отражения с "предметной" точки зрения
//
// Параметры
//  СпособОтраженияВБухучете - СправочникСсылка.СпособыОтраженияЗарплатыВРеглУчете - описываемый 
//                 способ отражения
//  НетБазовыхРасчетов - булево - указывает на наличие/отсутствие у в.р. расчетной базы
//
// Возвращаемое значение:
//   строка - сформированное представление
//
Функция ПолучитьПредставлениеСпособаОтраженияНачисленияВУчетах(СпособОтраженияВБухучете, НетБазовыхРасчетов) Экспорт
	
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",СпособОтраженияВБухучете);
		Запрос.УстановитьПараметр("Подразделения",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СпособыОтраженияЗарплатыВРеглУчете.СчетДт.Код, """") КАК СчетДт,
		|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт1) КАК СубконтоДт1Представление,
		|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт2) КАК СубконтоДт2Представление,
		|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт3) КАК СубконтоДт3Представление,
		|	ЕСТЬNULL(СпособыОтраженияЗарплатыВРеглУчете.СчетКт.Код, """") КАК СчетКт
		|ИЗ
		|	(ВЫБРАТЬ
		|		СпособыОтраженияЗарплатыВРеглУчете.Ссылка КАК Ссылка,
		|		СпособыОтраженияЗарплатыВРеглУчете.СчетДт КАК СчетДт,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт1 КАК СубконтоДт1,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт2 КАК СубконтоДт2,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт3 КАК СубконтоДт3,
		|		СпособыОтраженияЗарплатыВРеглУчете.СчетКт КАК СчетКт,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт1 КАК СубконтоКт1,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт2 КАК СубконтоКт2,
		|		СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт3 КАК СубконтоКт3
		|	ИЗ
		|		Справочник.СпособыОтраженияЗарплатыВРеглУчете КАК СпособыОтраженияЗарплатыВРеглУчете
		|	ГДЕ
		|		СпособыОтраженияЗарплатыВРеглУчете.Ссылка = &Ссылка) КАК СпособыОтраженияЗарплатыВРеглУчете";
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		РасшифровкаТекст = "Бухгалтерский учет: ";
		Если ЗначениеЗаполнено(Выборка.СчетДт) Тогда
			РасшифровкаТекст = РасшифровкаТекст + "Дт " + Выборка.СчетДт;
		ИначеЕсли НетБазовыхРасчетов Тогда
			РасшифровкаТекст = РасшифровкаТекст + "Дт <не указано>";
		Иначе
			РасшифровкаТекст = РасшифровкаТекст + "счет дебета определяется по расчетной базе";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СчетКт) Тогда
			РасшифровкаТекст = РасшифровкаТекст + " Кт " + Выборка.СчетКт;
		ИначеЕсли НетБазовыхРасчетов Тогда
			РасшифровкаТекст = РасшифровкаТекст + " Кт <не указано>";
		Иначе
			РасшифровкаТекст = РасшифровкаТекст + "; счет кредита определяется по расчетной базе";
		КонецЕсли;
		
	Возврат РасшифровкаТекст	
	
КонецФункции // ПолучитьПредставлениеСпособаОтраженияНачисленияВУчетах()

// Выводит строки показателей в списке регистра сведений плановых удержаний
//
Процедура ОформитьСтрокиПлановыхУдержаний(Элемент, мСведенияОВидахРасчета, ОформленияСтрок) Экспорт
	
	ДлинаСуток = 86400;

	Для каждого Строка Из ОформленияСтрок Цикл
		
		ДанныеСтроки = Строка.ДанныеСтроки;
		ВидРасчета = ДанныеСтроки.ВидРасчета;
		
		СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВидРасчета);
		
		ЕстьПоказатели = Ложь;
		Для СчПоказателей = 1 По 6 Цикл
			
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				ВидимостьПоказателяИВалюты = Истина;
				Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
					Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
					ЕстьПоказатели = Истина;
					Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				Иначе
					Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				КонецЕсли;
				Если ВидимостьПоказателяИВалюты Тогда
					Строка.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];		
					Строка.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
				Иначе
					Строка.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;		
					Строка.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
				КонецЕсли;
			Иначе
				Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				Строка.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;		
				Строка.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;			
			КонецЕсли;
			
		КонецЦикла;
		
		Если не ЕстьПоказатели Тогда		
			Строка.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
			Строка.Ячейки["Показатель1"].Видимость = Истина;		
			Строка.Ячейки["Валюта1"].Видимость = Истина;		
		КонецЕсли;	
		Строка.Ячейки.Показатели.Видимость = Ложь;
		
		
	КонецЦикла;	
	
КонецПроцедуры

// Выводит строки показателей в списке регистра сведений плановых начислений
//
Процедура ОформитьСтрокиПлановыхНачислений(Элемент, мСведенияОВидахРасчета, ОформленияСтрок) Экспорт

	ДлинаСуток = 86400;
	
	Для каждого Строка Из ОформленияСтрок Цикл
		
		ДанныеСтроки = Строка.ДанныеСтроки;
		ВидРасчета = ДанныеСтроки.ВидРасчета;
		
		Если ТипЗнч(ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			
			СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВидРасчета);
			
			ЕстьПоказатели = Ложь;
			Для СчПоказателей = 1 По 6 Цикл
				Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
					ВидимостьПоказателяИВалюты = Истина;
					Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
						Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
						ЕстьПоказатели = Истина;
						Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
						Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;
					ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] Тогда
						ВидимостьПоказателяИВалюты = Ложь;
						ЕстьПоказатели = Истина;
						Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);
						Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Истина;	
						Строка.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Истина;
					Иначе
						Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;
					КонецЕсли;
					Если ВидимостьПоказателяИВалюты Тогда
						Строка.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
						Строка.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
						Если Строка.Ячейки["Показатель" + СчПоказателей].Видимость Тогда
							Строка.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
						КонецЕсли;
					Иначе
						Строка.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
						Строка.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
					КонецЕсли;
				Иначе
					Строка.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
					Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
					Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
					Строка.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;				
					Строка.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
				КонецЕсли;
			КонецЦикла;
			Если не ЕстьПоказатели Тогда
				Строка.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
				Строка.Ячейки["Показатель1"].Видимость = Истина;
				Строка.Ячейки["Валюта1"].Видимость = Истина;
				Строка.Ячейки["НаименованиеПоказательТР1"].Видимость = Ложь;
				Строка.Ячейки["ТарифныйРазряд1"].Видимость = Ложь;
			КонецЕсли;
			Строка.Ячейки.Показатели.Видимость = Ложь;
			
		Иначе
			
			СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ДанныеСтроки.ВидРасчета);
			
			Строка.Ячейки["НаименованиеПоказатель1"].Видимость	= Истина;
			Строка.Ячейки["НаименованиеПоказательТР1"].Видимость	= Ложь;
			Строка.Ячейки["ТарифныйРазряд1"].Видимость			= Ложь;
			Строка.Ячейки["Показатель1"].Видимость				= Истина;
			Строка.Ячейки["Валюта1"].Видимость					= Истина;
			Строка.Ячейки["НаименованиеПоказатель1"].УстановитьТекст(СведенияОВидеРасчета["Показатель1Наименование"]);
			
			Для СчПоказателей = 2 По 6 Цикл
				Строка.Ячейки["НаименованиеПоказатель" + СчПоказателей ].Видимость	= Ложь;
				Строка.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость	= Ложь;
				Строка.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость				= Ложь;
				Строка.Ячейки["Показатель" + СчПоказателей].Видимость					= Ложь;
				Строка.Ячейки["Валюта" + СчПоказателей].Видимость						= Ложь;
			КонецЦикла;
			Строка.Ячейки.Показатели.Видимость = Ложь;
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьПВРНаПустыеСтрокиВТЧ(ВидРасчета, ЕстьВытесняющиеВидыРасчета = Ложь) Экспорт
	
	КоничествоСтрок = ВидРасчета.БазовыеВидыРасчета.Количество() - 1;
	НомерСтроки = 0;
	Пока НомерСтроки <= КоничествоСтрок Цикл
		СтрокаБазовыйРасчет = ВидРасчета.БазовыеВидыРасчета[НомерСтроки];
		Если Не ЗначениеЗаполнено(СтрокаБазовыйРасчет.ВидРасчета) Тогда
			ВидРасчета.БазовыеВидыРасчета.Удалить(НомерСтроки );
			КоничествоСтрок = КоничествоСтрок - 1;
		Иначе
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
	КоничествоСтрок = ВидРасчета.ВедущиеВидыРасчета.Количество() - 1;
	НомерСтроки = 0;
	Пока НомерСтроки <= КоничествоСтрок Цикл
		СтрокаВедущийРасчет = ВидРасчета.ВедущиеВидыРасчета[НомерСтроки];
		Если Не ЗначениеЗаполнено(СтрокаВедущийРасчет.ВидРасчета) Тогда
			ВидРасчета.ВедущиеВидыРасчета.Удалить(НомерСтроки );
			КоничествоСтрок = КоничествоСтрок - 1;
		Иначе
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьВытесняющиеВидыРасчета Тогда
		
		КоничествоСтрок = ВидРасчета.ВытесняющиеВидыРасчета.Количество() - 1;
		НомерСтроки = 0;
		Пока НомерСтроки <= КоничествоСтрок Цикл
			СтрокаВытесняющейРасчет = ВидРасчета.ВытесняющиеВидыРасчета[НомерСтроки];
			Если Не ЗначениеЗаполнено(СтрокаВытесняющейРасчет.ВидРасчета) Тогда
				ВидРасчета.ВытесняющиеВидыРасчета.Удалить(НомерСтроки );
				КоничествоСтрок = КоничествоСтрок - 1;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецФункции

// управляет валютой в зависимости от способа расчета
//
Процедура ПриИзмененииВидаРасчета(ИмяОбъекта,Значение, ЭлементыФормы, мСведенияОВидахРасчета, мВалютаУправленческогоУчета) Экспорт

	СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, Значение);

	Для СчПоказателей = 1 По 6 Цикл		
		Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда			
			Если НЕ ЗначениеЗаполнено(ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Валюта" + СчПоказателей]) И 
				СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"] Тогда
				ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Валюта" + СчПоказателей] = мВалютаУправленческогоУчета;
			КонецЕсли;
			Если НЕ СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"] Тогда
				ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Валюта" + СчПоказателей] = Справочники.Валюты.ПустаяСсылка();
			КонецЕсли;
			Если НЕ СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] Тогда
				ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Показатель" + СчПоказателей] = 0;
			КонецЕсли;
		Иначе
			ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Валюта" + СчПоказателей]		= Справочники.Валюты.ПустаяСсылка();
			ЭлементыФормы[ИмяОбъекта].ТекущиеДанные["Показатель" + СчПоказателей]	= 0;						
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ПриИзмененииВидаРасчета

// Записывает документ в режиме отмены проведения, проверяет необходимость очистки табличных частей, спросив об этом у пользователя
// Параметры
//  Объект        - ДокументОбъект
//  ФормаОбъекта  – Тип - Форма
//                 форма документа из которого вызвана функция
//  ТекстВопроса1 и ТекстВопроса2  – Тип – Строка
//                 текст вопроса
//  ЗаписыватьДокумент - параметр определяет, производить запись документа или нет, с параметром Ложь функция
//						 вызывается при заполнении списком, т.е. запись документа необходимо произвести
//						 только если пользователь не откажется от заполнения списком в обработчике ОбработкаВыбора формы
//
// Возвращаемое значение:
//   Истина   – если не требуется запись документа или запись прошла успешно
//   Ложь     - отказ пользователя от записи или не удачная попытка записи
Функция ЗаписатьДокументОчиститьТаблицыПередВыполнениемДействия(Объект, ФормаОбъекта, ТабличныеЧасти, ТекстВопроса1, ТекстВопроса2, ЗаписыватьДокумент = Истина) Экспорт
	
	Если Объект.Проведен Тогда
		
		//документ проведен, необходимо записать документ отменив проведение и очистить табличные части
		
		Если Вопрос(ТекстВопроса1, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Если ЗаписыватьДокумент Тогда
			Попытка
				ФормаОбъекта.ЗаписатьВФорме(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		
		// документ не проведен, необходимо записать документ и очистиить табличные части, вопросы
		// пользователю задаем только по поводу очистки табличных частей
		НадоОчищатьТабличныеЧасти = Ложь;
		Если НЕ ТабличныеЧасти = Неопределено Тогда
			//проверим заполнение табличных частей			
			Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
				НадоОчищатьТабличныеЧасти = ТабличнаяЧасть.Количество() > 0;
				Если НадоОчищатьТабличныеЧасти Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НадоОчищатьТабличныеЧасти Тогда
				
				Ответ = Вопрос(ТекстВопроса2, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
				
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗаписыватьДокумент И Объект.Модифицированность() Тогда //запишем документ
			
			Попытка
				Возврат ФормаОбъекта.ЗаписатьВФорме(РежимЗаписиДокумента.Запись);
			Исключение
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

// Предназначена для реализации "произвольного" ввода даты-месяца
// подбирает по переданному тексту строку-представление даты или список таких строк
// в переданный параметр ДатаПоТексту возвращает подобранную по тексту дату
Функция ПериодПодобратьПоТексту(Текст, Периодичность, ДатаПоТексту = Неопределено) Экспорт
	
	СписокВозврата = Новый СписокЗначений;
	
	ТекущаяДата		= ОбщегоНазначения.ПолучитьРабочуюДату();
	ТекущийГод		= Год(ТекущаяДата);
	ТекущийКвартал	= Цел(Месяц(ТекущаяДата) / 4) + 1;
	ТекущийМесяц	= Месяц(ТекущаяДата);
	ТекущаяНеделя	= НеделяГода(ТекущаяДата);
	ТекущийДень		= День(ТекущаяДата);
	
	НачалоГода		= НачалоГода(ТекущаяДата);
	НачалоМесяца	= НачалоМесяца(ТекущаяДата);
	КонецГода		= КонецГода(ТекущаяДата);
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат СписокВозврата;
	КонецЕсли;
	
	Если Найти(Текст, ".") <> 0 Тогда
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, ".");
		ИспользуемыйРазделитель = ".";
		
	ИначеЕсли Найти(Текст, ",") <> 0 Тогда
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, ",");
		ИспользуемыйРазделитель = ",";
		
	ИначеЕсли Найти(Текст, "-") <> 0 Тогда
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "-");
		ИспользуемыйРазделитель = "-";
		
	ИначеЕсли Найти(Текст, "/") <> 0 Тогда
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "/");
		ИспользуемыйРазделитель = "/";
		
	ИначеЕсли Найти(Текст, "\") <> 0 Тогда
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, "\");
		ИспользуемыйРазделитель = "\";
		
	Иначе
		Подстроки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Текст, " ");
		ИспользуемыйРазделитель = " ";
		
	КонецЕсли;
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		КонецПериода = День(КонецМесяца(ТекущаяДата));
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		КонецПериода = НеделяГода(КонецГода);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		КонецПериода = 12;
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		КонецПериода = 4;
		
	КонецЕсли;
	
	Если Подстроки.Количество() = 1 И Периодичность <> Перечисления.Периодичность.Год Тогда
		// единственное слово - пытаемся получить период
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Текст) Тогда
			ПериодЧислом = Число(Текст);
			
			Если ПериодЧислом >= 1 И ПериодЧислом <= КонецПериода Тогда
				Если Периодичность = Перечисления.Периодичность.День Тогда
					ДатаПоТексту = ОбщегоНазначения.ДобавитьИнтервал(НачалоМесяца, Периодичность, ПериодЧислом - 1);
				Иначе
					ДатаПоТексту = ОбщегоНазначения.ДобавитьИнтервал(НачалоГода, Периодичность, ПериодЧислом - 1);
				КонецЕсли;
				
				Если Периодичность = Перечисления.Периодичность.День Тогда
					Если СтрДлина(Текст) = 1 Тогда
						ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ=d/MM/yyyy");
					Иначе
						ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ=dd/MM/yyyy");
					КонецЕсли;
					
				ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
					ФорматированнаяДата = Текст + Формат(ДатаПоТексту, "ДФ=/yyyy");
					
				ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
					ФорматированнаяДата = Текст + Формат(ДатаПоТексту, "ДФ=/yyyy");
					
				ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
					Если СтрДлина(Текст) = 1 Тогда
						ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ=M/yyyy");
					Иначе
						ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ=MM/yyyy");
					КонецЕсли;
					
				Иначе // Год
					ФорматированнаяДата = Текст;
					
				КонецЕсли;
				
				СписокВозврата.Добавить(ФорматированнаяДата);
			КонецЕсли;
				
		Иначе
			Если Периодичность = Перечисления.Периодичность.Месяц Тогда
				СписокМесяцев = СписокМесяцевПоСтроке(Текст);
				Для Каждого Месяц Из СписокМесяцев Цикл
					ДатаПоТексту = Дата(ТекущийГод, Месяц, 1);
					СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММММ гггг ""г""'"));
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	
	Иначе
		Если Периодичность = Перечисления.Периодичность.День Тогда
			Если Подстроки.Количество() >= 2 И Не ПустаяСтрока(Подстроки[1]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
				Месяц				= Число(Подстроки[1]);
				Если Месяц >= 1 И Месяц <= КонецПериода Тогда
					ФорматДляМесяца	= Прав("MM", СтрДлина(Подстроки[1]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
					Месяц				= ТекущийМесяц;
					ФорматДляМесяца		= "MM";
				Иначе
					СписокМесяцев = СписокМесяцевПоСтроке(Подстроки[1]);
					Если СписокМесяцев.Количество() = 1 Тогда
						Месяц				= СписокМесяцев[0];
						ФорматДляМесяца		= "MMMM";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Подстроки.Количество() >= 3 И Не ПустаяСтрока(Подстроки[2]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[2]) Тогда
				Год				= Число(Лев(Формат(ТекущийГод, "ЧГ="), 4-СтрДлина(Подстроки[2])) + Подстроки[2]);
				Если Год >= 1900 И Год < 3000 Тогда
					ФорматДляГода	= Прав("yyyy", СтрДлина(Подстроки[2]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Год				= ТекущийГод;
				ФорматДляГода	= "yyyy";
			КонецЕсли;
			
			Если Подстроки.Количество() >= 1 И Не ПустаяСтрока(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
				День				= Число(Подстроки[0]);
				Если День >= 1 И Месяц <> Неопределено И День <= День(КонецМесяца(Дата(Год, Месяц, 1))) Тогда
					ФорматДляДня	= Прав("dd", СтрДлина(Подстроки[0]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;
			
			ДатаПоТексту = Дата(Год, Месяц, День);
			
			Если Подстроки.Количество() < 3 ИЛИ ПустаяСтрока(Подстроки[2]) Тогда
				ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ='" + ФорматДляДня + ИспользуемыйРазделитель + ФорматДляМесяца + ИспользуемыйРазделитель + ФорматДляГода + "'");
			Иначе
				ФорматированнаяДата	= "";
			КонецЕсли;
			
		ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
			Если Подстроки.Количество() >= 2 И Не ПустаяСтрока(Подстроки[1]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
				Год				= Число(Лев(Формат(ТекущийГод, "ЧГ="), 4-СтрДлина(Подстроки[1])) + Подстроки[1]);
				Если Год >= 1900 И Год < 3000 Тогда
					ФорматДляГода	= Прав("yyyy", СтрДлина(Подстроки[1]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Год				= ТекущийГод;
				ФорматДляГода	= "yyyy";
			КонецЕсли;
			
			Если Подстроки.Количество() >= 1 И Не ПустаяСтрока(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
				Неделя	= Число(Подстроки[0]) - 1;
				Если Неделя < 1 ИЛИ Неделя > НеделяГода(Дата(Год, 12, 31)) Тогда
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;
			
			ДатаПоТексту = ОбщегоНазначения.ДобавитьИнтервал(Дата(Год, 1, 1), Периодичность, Неделя);
			
			Если Подстроки.Количество() < 2 ИЛИ ПустаяСтрока(Подстроки[1]) Тогда
				ФорматированнаяДата	= Подстроки[0] + ИспользуемыйРазделитель + Формат(ДатаПоТексту, "ДФ='" + ФорматДляГода + "'");
			Иначе
				ФорматированнаяДата	= "";
			КонецЕсли;
			
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
			Если Подстроки.Количество() >= 1 И Не ПустаяСтрока(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
				Месяц			= Число(Подстроки[0]);
				Если Месяц >= 1 И Месяц <= КонецПериода Тогда
					ФорматДляМесяца	= Прав("MM", СтрДлина(Подстроки[0]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;
			
			Если Подстроки.Количество() >= 2 И Не ПустаяСтрока(Подстроки[1]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
				Год				= Число(Лев(Формат(ТекущийГод, "ЧГ="), 4-СтрДлина(Подстроки[1])) + Подстроки[1]);
				Если Год >= 1900 И Год < 3000 Тогда
					ФорматДляГода	= Прав("yyyy", СтрДлина(Подстроки[1]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Год				= ТекущийГод;
				ФорматДляГода	= "yyyy";
			КонецЕсли;
			
			ДатаПоТексту = Дата(Год, Месяц, 1);
			
			Если Подстроки.Количество() < 2 ИЛИ ПустаяСтрока(Подстроки[1]) Тогда
				ФорматированнаяДата	= Формат(ДатаПоТексту, "ДФ='" + ФорматДляМесяца + ИспользуемыйРазделитель + ФорматДляГода + "'");
			Иначе
				ФорматированнаяДата	= "";
			КонецЕсли;
			
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
			Если Подстроки.Количество() >= 1 И Не ПустаяСтрока(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
				Квартал	= (Число(Подстроки[0]));
				Если Квартал < 1 ИЛИ Квартал > КонецПериода Тогда
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;
			
			Если Подстроки.Количество() >= 2 И Не ПустаяСтрока(Подстроки[1]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
				Год				= Число(Лев(Формат(ТекущийГод, "ЧГ="), 4-СтрДлина(Подстроки[1])) + Подстроки[1]);
				Если Год >= 1900 И Год < 3000 Тогда
					ФорматДляГода	= Прав("yyyy", СтрДлина(Подстроки[1]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Год				= ТекущийГод;
				ФорматДляГода	= "yyyy";
			КонецЕсли;
			
			ДатаПоТексту = Дата(Год, (Квартал - 1) * 3 + 1, 1);
			
			Если Подстроки.Количество() < 2 ИЛИ ПустаяСтрока(Подстроки[1]) Тогда
				ФорматированнаяДата	= Подстроки[0] + ИспользуемыйРазделитель + Формат(ДатаПоТексту, "ДФ='" + ФорматДляГода + "'");
			Иначе
				ФорматированнаяДата	= "";
			КонецЕсли;
			
		ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
			Если Подстроки.Количество() >= 1 И Не ПустаяСтрока(Подстроки[0]) И ОбщегоНазначения.ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
				Год				= Число(Лев(Формат(ТекущийГод, "ЧГ="), 4-СтрДлина(Подстроки[0])) + Подстроки[0]);
				Если Год >= 1900 И Год < 3000 Тогда
					ФорматДляГода	= Прав("yyyy", СтрДлина(Подстроки[0]));
				Иначе
					Возврат СписокВозврата;
				КонецЕсли;
			Иначе
				Возврат СписокВозврата;
			КонецЕсли;
			
			ДатаПоТексту = Дата(Год, 1, 1);
			
			Если Подстроки.Количество() < 2 ИЛИ ПустаяСтрока(Подстроки[1]) Тогда
				ФорматированнаяДата = Подстроки[0] + " год";
			Иначе
				ФорматированнаяДата	= "";
			КонецЕсли;
			
		КонецЕсли;
		
		СписокВозврата.Добавить(ФорматированнаяДата);
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции

Процедура ПериодАвтоПодборТекста(Текст, ТекстАвтоПодбора, Периодичность, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Список = ПериодПодобратьПоТексту(Текст, Периодичность);
	Если Список.Количество() = 1 Тогда
		ТекстАвтоПодбора = Список[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПериодОкончаниеВводаТекста(Текст, Значение, Периодичность, СтандартнаяОбработка, ДатаПоТексту = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Список = ПериодПодобратьПоТексту(Текст, Периодичность, ДатаПоТексту);
	Если Список.Количество() = 1 Тогда
		Значение = Список[0].Значение;
	Иначе
		Значение = Список;
	КонецЕсли;
	
КонецПроцедуры

// Делает страницу панели с переданным именем видимой и текущей, а остальные - невидимыми
//  Параметры:
//	ИмяСтраницы  - страница, которую необходимо сделать текущей
//  Панель - имя панели;
//
Процедура УстановитьТекущуюСтраницу(ИмяСтраницы, Панель) Экспорт
	
	Для Каждого Страница Из Панель.Страницы Цикл
		Если НЕ Страница.Имя=ИмяСтраницы Тогда
			Страница.Видимость=Ложь;
		Иначе
			Страница.Видимость=Истина;
		КонецЕсли;
	КонецЦикла;
	
	Панель.ТекущаяСтраница=Панель.Страницы[ИмяСтраницы];
	
КонецПроцедуры // УстановитьТекущуюСтраницу()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ СОХРАНЕНИЯ И ВОССТАНОВЛЕНИЯ ВЫПАДАЮЩИХ СПИСКОВ ПОСЛЕДНИХ 10 ЗНАЧЕНИЙ

// Процедура восстанавливает список 10 последних выпавших значений элемента
Процедура ВосстановитьСписокЗначенийУнивер(СписокЗначений, ИмяПараметраДляСохранения = "", СписокЭлементаВизуализации) Экспорт

	Если НЕ ЗначениеЗаполнено(ИмяПараметраДляСохранения) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗначений.Очистить();
	
	ВосстановленноеЗначение = ВосстановитьЗначение(ИмяПараметраДляСохранения);
	Если ТипЗнч(ВосстановленноеЗначение) = Тип("СписокЗначений") Тогда
		СписокЗначений = ВосстановленноеЗначение;
		СписокЭлементаВизуализации = СписокЗначений.Скопировать();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура добавляет в список последних 10-ти значений элементов
// Параметры :
//		СписокСохраняемыхЗначений - список значений куда нужно поместить очередной элемент
//      ИмяПараметраДляСохранения - под каким именем сохранить значение (если пустая - то ничего не сохраняем)
//      ЭлементСписка			  - выбранный элемент списка
Процедура ДобавитьВСписокЗначенийУнивер(СписокСохраняемыхЗначений, ИмяПараметраДляСохранения = "", ЭлементСписка, 
	Знач ЗначениеПоиска = "") Экспорт

	Если ПустаяСтрока(ЗначениеПоиска) Тогда
		ДобавляемоеЗначение = ЭлементСписка.Значение;
	Иначе
		ДобавляемоеЗначение = ЗначениеПоиска;
    КонецЕсли;
	
	НайденныйЭлемент = СписокСохраняемыхЗначений.НайтиПоЗначению(ДобавляемоеЗначение);
	Если НайденныйЭлемент <> Неопределено Тогда
		СписокСохраняемыхЗначений.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	СписокСохраняемыхЗначений.Вставить(0, ДобавляемоеЗначение);
	
	Пока СписокСохраняемыхЗначений.Количество() > 10 Цикл
		СписокСохраняемыхЗначений.Удалить(СписокСохраняемыхЗначений.Количество() - 1);
	КонецЦикла;
	
	Если (ЗначениеЗаполнено(ИмяПараметраДляСохранения)) И ТипЗнч(ИмяПараметраДляСохранения) = Тип("Строка") Тогда
		СохранитьЗначение(ИмяПараметраДляСохранения, СписокСохраняемыхЗначений.Скопировать());
	КонецЕсли;
	
	ЭлементСписка.СписокВыбора = СписокСохраняемыхЗначений.Скопировать();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ТИПОВЫХ ТАБЛИЧНЫХ ЧАСТЕЙ РАСЧЕТНЫХ ДОКУМЕНТОВ
	
// Выводит строки показателей в документах ввода плановых начислений и удержаний
//
Процедура ПриВыводеСтрокиПлановыхНачисленийИУдержаний(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета, ИспользуютсяТарифныеРазряды = Истина) Экспорт
		
	Если Найти(ТипЗнч(ДанныеСтроки),"Персональные надбавки") = 0 Тогда
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.ВидРасчета);
	Иначе
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.Надбавка);
	Конецесли;	
	ТолькоПросмотрЯчеек = Ложь;
	
	ЕстьПоказатели = Ложь;
	Для СчПоказателей = 1 По 6 Цикл
		УстановитьТолькоПросмотр = ТолькоПросмотрЯчеек;
		Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда			
			
			Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
				ЕстьПоказатели = Истина;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
				Если ИспользуютсяТарифныеРазряды Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Ложь;
				КонецЕсли;
				
			ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] И ИспользуютсяТарифныеРазряды Тогда
				ЕстьПоказатели = Истина;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Истина;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Истина;


			Иначе
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				Если ИспользуютсяТарифныеРазряды Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
					ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Ложь;
				КонецЕсли;

			КонецЕсли;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].ТолькоПросмотр = (НЕ СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"]) ИЛИ (УстановитьТолькоПросмотр);
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = УстановитьТолькоПросмотр;
		Иначе
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Ложь;			
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	Если не ЕстьПоказатели Тогда
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст("<ввод при расчете>");
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
		ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	
КонецПроцедуры //ПриВыводеСтрокиПлановыхНачислений

// Выводит строки показателей в документах ввода плановых начислений и удержаний
//
//	Параметры:
//		ДанныеСтроки - данные строки документа
//		ОформлениеСтроки - оформление строки документа
//		СведенияОВидахРасчета - соответствие содержащие сведения о видах расчетах документа 
//
Процедура ПриВыводеСтрокиНачисленийИУдержаний(ДанныеСтроки, ОформлениеСтроки, СведенияОВидахРасчета, ЭтоНачисление = Истина) Экспорт
	
	ДанныеСтрокиВидРасчета = ДанныеСтроки.ВидРасчета;
	
	СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.ВидРасчета, "ПриРасчете");					
	
	ЕстьПоказатели = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеСтрокиВидРасчета) Тогда
		
		ЕстьПоказатели = Ложь; 
		СчПоказателей = 0;
		Для СчПоказателей = 1 По 6 Цикл
			
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				
				ЕстьПоказатели = Истина;
				
				ВидимостьПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
				ВидимостьНаименованияПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"];
				
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = ВидимостьПоказателя;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = ВидимостьНаименованияПоказателя;
				
				// размеры показателя будут доступны только для видимых и изменяемых показателей
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется
					Или СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.Периодически
					Или СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете;
				КонецЕсли;
				
				// если отображается наименование - пропишем текст
				Если ВидимостьНаименованияПоказателя Тогда		
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] Тогда
					ВидимостьПоказателя = СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Видимость"];
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = ВидимостьПоказателя;
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр	= Не ВидимостьПоказателя Или СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете
					Или СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.Периодически;
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"];			
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);			
				КонецЕсли;
				
				Если ВидимостьПоказателя Тогда
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
				КонецЕсли;
				
			Иначе
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если не ЕстьПоказатели Тогда
			ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст("<рассчитываются автоматически>");
			ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость			= Истина;
			ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр				= Истина;
		КонецЕсли;
	Иначе
		
		Для СчПоказателей = 1 По 6 Цикл
			// настроим видимость ячеек
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	// управление видимостью ячеек, которые группируют некоторые элементы шапки
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	ОформлениеСтроки.Ячейки.Период.Видимость = Ложь;
	
	
	Если ЭтоНачисление Тогда
		ОформлениеСтроки.Ячейки.Отработано.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.Норма.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.НормаЗаМесяц.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.БазовыйПериод.Видимость = Ложь;
	КонецЕсли;
	
	// управление картинкой по колонке Автозаполение
	ЯчейкаСКартинкой = ОформлениеСтроки.Ячейки.Картинка;
	ЯчейкаСКартинкой.ОтображатьКартинку = Истина;
	ЯчейкаСКартинкой.ИндексКартинки = Число(ДанныеСтроки.Авторасчет);

КонецПроцедуры //ПриВыводеСтрокиНачисленийИУдержаний

///////////////// ПРИ ИЗМЕНЕНИИ ////////////////////////

// Процедура выполняет общие действия при изменнении даты документа
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  ФлагИзмененияКурса             - валюта регламентированного учета
//
Процедура ПриИзмененииЗначенияДатыДокумента(ДокументОбъект, ВалютаРегламентированногоУчета, ФлагИзмененияКурса = Неопределено) Экспорт

	МетаданныеДокумента            = ДокументОбъект.Метаданные();
	ЕстьВалютаДокумента            = МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено;
	ЕстьДоговорКонтрагента         = МетаданныеДокумента.Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено;
	ПроверкаПоВалютеВзаиморасчетов = Ложь;
	ФлагИзмененияКурса             = Ложь;

	// В некоторых документах нет валюты документа и договора.
	Если ЕстьВалютаДокумента Тогда
		Если ЕстьДоговорКонтрагента Тогда
			Договор = ДокументОбъект.ДоговорКонтрагента;
			Если НЕ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
				Если ЗначениеЗаполнено(Договор) Тогда
					Валюта = Договор.ВалютаВзаиморасчетов;
					ПроверкаПоВалютеВзаиморасчетов = Истина;
				Иначе
					Возврат;
				КонецЕсли;
			Иначе
				Валюта = ДокументОбъект.ВалютаДокумента;
			КонецЕсли;
		Иначе
			Валюта = ДокументОбъект.ВалютаДокумента;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	Если НЕ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		ЕстьКурсДокумента           = (МетаданныеДокумента.Реквизиты.Найти("КурсДокумента") <> Неопределено);
		ЕстьКратностьДокумента      = (МетаданныеДокумента.Реквизиты.Найти("КратностьДокумента") <> Неопределено);
		ЕстьКурсВзаиморасчетов      = (МетаданныеДокумента.Реквизиты.Найти("КурсВзаиморасчетов") <> Неопределено);
		ЕстьКратностьВзаиморасчетов = (МетаданныеДокумента.Реквизиты.Найти("КратностьВзаиморасчетов") <> Неопределено);
	Иначе
		ЕстьКурсДокумента           = Истина;
		ЕстьКратностьДокумента      = Истина;
	КонецЕсли;

	// В некоторых документах курс и кратность документа отсутствуют
	Если ПроверкаПоВалютеВзаиморасчетов
	   И ЕстьКурсВзаиморасчетов
	   И ЕстьКратностьВзаиморасчетов
	   И ЕстьКурсДокумента
	   И ЕстьКратностьДокумента Тогда

		ВалютаВзаиморасчетов          = Валюта;
		ВалютаДокумента               = ДокументОбъект.ВалютаДокумента;

		СтарыйКурсВзаиморасчетов      = ДокументОбъект.КурсВзаиморасчетов;
		СтараяКратностьВзаиморасчетов = ДокументОбъект.КратностьВзаиморасчетов;

		СтруктураВалюты               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, ДокументОбъект.Дата);
		НовыйКурсВзаиморасчетов       = СтруктураВалюты.Курс;
		НоваяКратностьВзаиморасчетов  = СтруктураВалюты.Кратность;

		СтарыйКурсДокумента           = ДокументОбъект.КурсДокумента;
		СтараяКратностьДокумента      = ДокументОбъект.КратностьДокумента;

		СтруктураВалюты               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДокументОбъект.Дата);
		НовыйКурсДокумента            = СтруктураВалюты.Курс;
		НоваяКратностьДокумента       = СтруктураВалюты.Кратность;

	ИначеЕсли ПроверкаПоВалютеВзаиморасчетов
	        И ЕстьКурсВзаиморасчетов
	        И ЕстьКратностьВзаиморасчетов Тогда

		ВалютаВзаиморасчетов          = Валюта;
		ВалютаДокумента               = Неопределено;

		СтарыйКурсВзаиморасчетов      = ДокументОбъект.КурсВзаиморасчетов;
		СтараяКратностьВзаиморасчетов = ДокументОбъект.КратностьВзаиморасчетов;

		СтруктураВалюты               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, ДокументОбъект.Дата);
		НовыйКурсВзаиморасчетов       = СтруктураВалюты.Курс;
		НоваяКратностьВзаиморасчетов  = СтруктураВалюты.Кратность;

		СтарыйКурсДокумента           = 0;
		СтараяКратностьДокумента      = 0;

		НовыйКурсДокумента            = 0;
		НоваяКратностьДокумента       = 0;

	ИначеЕсли НЕ ПроверкаПоВалютеВзаиморасчетов
	        И ЕстьКурсДокумента
	        И ЕстьКратностьДокумента Тогда

		ВалютаВзаиморасчетов          = Неопределено;
		ВалютаДокумента               = Валюта;

		СтарыйКурсВзаиморасчетов      = 0;
		СтараяКратностьВзаиморасчетов = 0;

		НовыйКурсВзаиморасчетов       = 0;
		НоваяКратностьВзаиморасчетов  = 0;

		СтарыйКурсДокумента           = ДокументОбъект.КурсДокумента;
		СтараяКратностьДокумента      = ДокументОбъект.КратностьДокумента;

		СтруктураВалюты               = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДокументОбъект.Дата);
		НовыйКурсДокумента            = СтруктураВалюты.Курс;
		НоваяКратностьДокумента       = СтруктураВалюты.Кратность;

	Иначе
		Возврат;
	КонецЕсли;

	ИзменилсяКурсВзаиморасчетов = НЕ (НовыйКурсВзаиморасчетов = СтарыйКурсВзаиморасчетов И НоваяКратностьВзаиморасчетов = СтараяКратностьВзаиморасчетов);
	ИзменилсяКурсДокумента      = НЕ (НовыйКурсДокумента      = СтарыйКурсДокумента      И НоваяКратностьДокумента      = СтараяКратностьДокумента);

	// Контроль изменений курса.
	Если ИзменилсяКурсВзаиморасчетов
	   И ИзменилсяКурсДокумента Тогда

		// Изменился курс документа и взаиморасчетов.
		ТекстВопроса = "На дату документа у валюты документа " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаДокумента,      СтарыйКурсДокумента,      СтараяКратностьДокумента,      ВалютаРегламентированногоУчета, Истина)) +
		               " и валюты взаиморасчетов " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаВзаиморасчетов, СтарыйКурсВзаиморасчетов, СтараяКратностьВзаиморасчетов, ВалютаРегламентированногоУчета, Истина)) +
		               " был задан другой курс." +
		               Символы.ПС +
		               "Установить курс документа " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаДокумента,      НовыйКурсДокумента,      НоваяКратностьДокумента,      ВалютаРегламентированногоУчета, Истина)) +
		               " и курс взаиморасчетов " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаВзаиморасчетов, НовыйКурсВзаиморасчетов, НоваяКратностьВзаиморасчетов, ВалютаРегламентированногоУчета, Истина)) +
		               " в соответствии с курсом валют?";

	ИначеЕсли ИзменилсяКурсВзаиморасчетов
	     И НЕ ИзменилсяКурсДокумента Тогда

		// Изменился курс взаиморасчетов.
		ТекстВопроса = "На дату документа у валюты взаиморасчетов " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаВзаиморасчетов, СтарыйКурсВзаиморасчетов, СтараяКратностьВзаиморасчетов, ВалютаРегламентированногоУчета, Истина)) +
		               " был задан другой курс." +
		               Символы.ПС +
		               "Установить курс взаиморасчетов " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаВзаиморасчетов, НовыйКурсВзаиморасчетов,  НоваяКратностьВзаиморасчетов,  ВалютаРегламентированногоУчета, Истина)) +
		               " в соответствии с курсом валюты?";

	ИначеЕсли ИзменилсяКурсДокумента Тогда

		// Изменился курс документа.
		ТекстВопроса = "На дату документа у валюты документа " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаДокумента, СтарыйКурсДокумента, СтараяКратностьДокумента, ВалютаРегламентированногоУчета, Истина)) +
		               " был задан другой курс." +
		               Символы.ПС +
		               "Установить курс документа " +
		               СокрЛП(ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаДокумента, НовыйКурсДокумента,  НоваяКратностьДокумента,  ВалютаРегламентированногоУчета, Истина)) +
		               " в соответствии с курсом валюты?";

	Иначе
		// Если курс неизменился, то выход.
		Возврат;
	КонецЕсли;

	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);

	Если Ответ = КодВозвратаДиалога.Да Тогда

		Если ИзменилсяКурсДокумента Тогда
			Если ЕстьКурсДокумента Тогда
				ДокументОбъект.КурсДокумента           = НовыйКурсДокумента;
			КонецЕсли;
			Если ЕстьКратностьДокумента Тогда
				ДокументОбъект.КратностьДокумента      = НоваяКратностьДокумента;
			КонецЕсли;
		КонецЕсли;

		Если ИзменилсяКурсВзаиморасчетов Тогда
			Если ЕстьКурсВзаиморасчетов Тогда
				ДокументОбъект.КурсВзаиморасчетов      = НовыйКурсВзаиморасчетов;
			КонецЕсли;
			Если ЕстьКратностьВзаиморасчетов Тогда
				ДокументОбъект.КратностьВзаиморасчетов = НоваяКратностьВзаиморасчетов;
			КонецЕсли;
		КонецЕсли;

		ФлагИзмененияКурса = Истина;
	КонецЕсли;

КонецПроцедуры // ПриИзмененииЗначенияДатыДокумента()

// Процедура вызывается из форм платежных документов при смене кассы или 
// банковского счета. Меняет валюту, курс документа и предлагает пересчитать сумму.
//
// Параметры:
//  ВалютаДокумента  - ссылка на справочник, валюта документа до изменения;
//  КурсДокумента    - число, курс документа до изменения; 
//  ДатаДокумента    - дата, дата на которую будем получать новый курс; 
//  СуммаДокумента   - число, сумма документа; 
//  ВалютаДенежныхСредств - ссылка на справочник, валюта выбранного счета или кассы 
//                     (новая валюта документа);
//
Процедура ПриИзмененииЗначенияКассыБанковскогоСчета(ВалютаДокумента, КурсДокумента, КратностьДокумента, ДатаДокумента, 
	                                        СуммаДокумента, ВалютаДенежныхСредств,ПересчитыватьСумму=Истина) Экспорт

	// Поменяем валюту до вопроса о пересчете, чтобы было видно, что она действительно поменялась.
	СтараяВалюта    = ВалютаДокумента; 
	СатрыйКурс      = КурсДокумента;
	СтараяКратность = КратностьДокумента;
	ВалютаДокумента = ВалютаДенежныхСредств; // должны строго совпадать

	СтруктураКурсаВалютаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента);
	КурсДокумента        = СтруктураКурсаВалютаДокумента.Курс;
	КратностьДокумента   = СтруктураКурсаВалютаДокумента.Кратность;

	Если ВалютаДокумента <>  СтараяВалюта
	   И СуммаДокумента > 0 Тогда

		// Надо предложить пересчитать сумму.
		Ответ = Вопрос("Изменилась валюта документа. Пересчитать сумму документа?", 
		               РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтараяВалюта, ВалютаДокумента, СатрыйКурс,
									    КурсДокумента,СтараяКратность,КратностьДокумента);
		Иначе
			ПересчитыватьСумму=Ложь;								
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры // ПриИзмененииЗначенияКассыБанковскогоСчета()


//////////////// НАЧАЛО ВЫБОРА //////////////////////////

// Процедура выполняет стандартные действия при начале выбора склада в формах документов.
//
// Параметры:
//  ДокументОбъект        - объект редактируемого документа;
//  ФормаДокумента        - форма редактируемого документа;
//  ЭлементФормы          - элемент формы документа, который надо заполнить; 
//  Склад                 - текущий склад в форме;
//  ВидСравненияНТТ       - Вид сравнения - равно или не равно неавтоматизированной торговой точке;
//  СтандартнаяОбработка, - булево, признак выполнения стандартной (системной) обработки события 
//                          начала выбора для данного элемента формы документа;
//
Процедура НачалоВыбораКонтактногоЛица(ЭлементФормы, ОбъектВладелец, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	ФормаВыбора          = Справочники.КонтактныеЛицаКонтрагентов.ПолучитьФормуВыбора(,ЭлементФормы,);

	ФормаВыбора.СправочникСписок.Отбор.Владелец.ВидСравнения 	= ВидСравнения.Равно;
	ФормаВыбора.СправочникСписок.Отбор.Владелец.Значение 		= ОбъектВладелец;
	ФормаВыбора.СправочникСписок.Отбор.Владелец.Использование = Истина;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;
    ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораКонтактногоЛица()


// Процедура выполняет стандартные действия при начале выбора сделки в формах документов.
//
// Параметры:
//  ДокументОбъект        - объект редактируемого документа;
//  ФормаДокумента        - форма редактируемого документа;
//  ЭлементФормы          - элемент формы документа, который надо заполнить; 
//  ДоговорКонтрагента - ссылка на справочник, определяет договор контрагента по сделке;
//  Сделка                - ссылка на документ, определяет собственно сделку;
//  СтандартнаяОбработка, - булево, признак выполнения стандартной (системной) обработки события 
//                          начала выбора для данного элемента формы документа;
//  СтрокаВидаДвижения    - строка, "Приход" или "Расход", определяет какие документы могут выступать
//                          в качестве расчетных: если документ выполняет расход по регистру то берем те,
//                          которые выполняют приход, и наоборот;
//  СтрокаТипаЗаказа      - строка, содержащая тип заказа (поставщику или покупателя).
//  СтруктураОтбора       - структура отбора, которая будет передана в открываемую форму выбора.
//
Процедура НачалоВыбораЗначенияСделки(ДокументОбъект, ФормаДокумента, ЭлементФормы, ДоговорКонтрагента, Сделка,
	                          СтандартнаяОбработка, СтрокаВидаДвижения, Знач СтрокаТипаЗаказа,СтруктураОтбора = Неопределено) Экспорт

							  
	ЭлементФормыКонтрагент = ФормаДокумента.ЭлементыФормы.Найти("Контрагент");						  
	// Тип выбираемого значения зависит от договора.
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение("Не выбран договор контрагента!");
		Если  ЭлементФормыКонтрагент<>неопределено Тогда
			ФормаДокумента.ТекущийЭлемент = ЭлементФормыКонтрагент;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	// Тип выбираемого значения зависит от договора.
	Если ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение("По договорам с видом ""Прочее"" не ведутся взаиморасчеты по сделкам!");
		Если  ЭлементФормыКонтрагент<>неопределено Тогда
			ФормаДокумента.ТекущийЭлемент = ЭлементФормыКонтрагент;
		КонецЕсли;

		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	Если (СтрокаТипаЗаказа = "ЗаказПоставщику") или (СтрокаТипаЗаказа = "ЗаказПокупателя") Тогда

		ТипДокументаСделки = СтрокаТипаЗаказа;
		ТипДокументаСчет = ?(СтрокаТипаЗаказа = "ЗаказПоставщику","СчетНаОплатуПоставщика","СчетНаОплатуПокупателю");

		Если ДокументОбъект.Метаданные().Реквизиты.Найти("Сделка") = Неопределено Тогда
			ЕстьТипСчет = Истина;
		Иначе
			ЕстьТипСчет = ДокументОбъект.Метаданные().Реквизиты.Сделка.Тип.СодержитТип( Тип("ДокументСсылка."+ТипДокументаСчет));
		КонецЕсли;
		Если ЕстьТипСчет Тогда
			Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда

				ТипДокументаСделки = ТипДокументаСчет;

			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
			      Или ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда

				ТипДокументаСделки = СтрокаТипаЗаказа;

			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Сделка) ИЛИ ТипЗнч(Сделка) <> Тип("ДокументСсылка." + СтрокаТипаЗаказа) Тогда
				Сделка = Документы[ТипДокументаСделки].ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		// для договоров комиссии с ведением расчетов по заказам необходимо нестандартное указание вида заказа при оплатах
		Если  ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			И ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			
			ТипДокументаСделки = "ЗаказПоставщику";
			Сделка = Документы[ТипДокументаСделки].ПустаяСсылка();

		КонецЕсли;
		
	Иначе // сделка может быть только заказом (поставщику или покупателя)
		Если ТипЗнч(Сделка) <> Тип("ДокументСсылка." + СтрокаТипаЗаказа) Тогда
			Сделка = Документы[СтрокаТипаЗаказа].ПустаяСсылка();
		КонецЕсли;

		ТипДокументаСделки = СтрокаТипаЗаказа;
	КонецЕсли; 

	// В качестве владельца формы выбора устанавливаем данный элемент,
	// чтобы выбранное значение было присвоено стандартно.
	ФормаВыбора = Документы[ТипДокументаСделки].ПолучитьФормуВыбора(,ЭлементФормы,);

	// Отфильруем список документов по договору.
	ФормаВыбора.Отбор.ДокументыПоДоговоруКонтрагента.Значение      = ДоговорКонтрагента;
	ФормаВыбора.Отбор.ДокументыПоДоговоруКонтрагента.Использование = Истина;

	// Отфильруем список документов.
	Если НЕ СтруктураОтбора = Неопределено Тогда
		Если ТипЗнч(СтруктураОтбора) = Тип("ТаблицаЗначений") Тогда
			Для Каждого ТекОтбор Из СтруктураОтбора Цикл
				ФормаВыбора.Отбор[ТекОтбор.Имя].ВидСравнения  = ТекОтбор.ВидСравнения;
				ФормаВыбора.Отбор[ТекОтбор.Имя].Значение      = ТекОтбор.Значение;
				ФормаВыбора.Отбор[ТекОтбор.Имя].Использование = Истина;
				Если ТекОтбор.НеИзменять Тогда
					ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора[ТекОтбор.Имя].Доступность = НЕ ТекОтбор.НеИзменять;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
				Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("СписокЗначений") Тогда
					ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравнения.ВСписке;
				КонецЕсли;
				ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Значение      = ЭлементСтруктуры.Значение;
				ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Использование = Истина;
				ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора[ЭлементСтруктуры.Ключ].Доступность = Ложь;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) И Сделка.ДоговорКонтрагента = ДоговорКонтрагента Тогда
		ФормаВыбора.НачальноеЗначениеВыбора = Сделка;
	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияСделки()

// Процедура выполняет стандартные действия при начале выбора документа расчетов с контрагентом в формах документов.
//
// Параметры:
//  ДокументОбъект        - объект редактируемого документа;
//  ФормаДокумента        - форма редактируемого документа;
//  ЭлементФормы          - элемент формы документа, который надо заполнить; 
//  ДоговорКонтрагента - ссылка на справочник, определяет договор контрагента по сделке;
//  Сделка                - ссылка на документ, определяет собственно сделку;
//  СтандартнаяОбработка, - булево, признак выполнения стандартной (системной) обработки события 
//                          начала выбора для данного элемента формы документа;
//  СтрокаВидаДвижения    - строка, "Приход" или "Расход", определяет какие документы могут выступать
//                          в качестве расчетных: если документ выполняет расход по регистру то берем те,
//                          которые выполняют приход, и наоборот.
//
Процедура НачалоВыбораЗначенияДокументаРасчетовСКонтрагентом(ДокументОбъект, ФормаДокумента, ЭлементФормы, ДоговорКонтрагента, Сделка,
	                          СтандартнаяОбработка, СтрокаВидаДвижения) Экспорт

	// Тип выбираемого значения зависит от договора.
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтандартнаяОбработка = Ложь;
		Предупреждение("Не выбран договор контрагента!");
		//в шапке документа может не быть реквизита Контрагент - например, в Авансовом отчете
		Если ФормаДокумента.ЭлементыФормы.Найти("Контрагент") <> Неопределено Тогда		
			ФормаДокумента.ТекущийЭлемент = ФормаДокумента.ЭлементыФормы.Контрагент;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	Если ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда

		// Заполним возможный список типов документов, которые могут быть расчетными.
		СписокТипов = Новый СписокЗначений;
		Если СтрокаВидаДвижения = "Приход" Тогда

			// Заполним список документов, которые могут делать расход по регистру.
			// Список документов зависит от вида договора
			Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			 Или ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда

				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровОтПокупателя"].Имя,               Метаданные.Документы["ВозвратТоваровОтПокупателя"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,       Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                       Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПриходныйКассовыйОрдер"].Имя,                   Метаданные.Документы["ПриходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеВходящее"].Имя,               Метаданные.Документы["ПлатежноеПоручениеВходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПолученный"].Имя,                     Метаданные.Документы["АккредитивПолученный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Имя, Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Имя,          Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОплатаОтПокупателяПлатежнойКартой"].Имя, 	   Метаданные.Документы["ОплатаОтПокупателяПлатежнойКартой"].Представление());
				
				Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
					СписокТипов.Добавить(Метаданные.Документы["РеализацияТоваровУслуг"].Имя,               Метаданные.Документы["РеализацияТоваровУслуг"].Представление());
					СписокТипов.Добавить(Метаданные.Документы["ОтчетКомиссионераОПродажах"].Имя,           Метаданные.Документы["ОтчетКомиссионераОПродажах"].Представление());
				КонецЕсли;
				
			ИначеЕсли ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			      Или ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,       Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                       Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОтчетКомитентуОПродажах"].Имя,                  Метаданные.Документы["ОтчетКомитентуОПродажах"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПолучениеУслугПоПереработке"].Имя, 			   Метаданные.Документы["ПолучениеУслугПоПереработке"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеДопРасходов"].Имя,                   Метаданные.Документы["ПоступлениеДопРасходов"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеТоваровУслуг"].Имя,                  Метаданные.Документы["ПоступлениеТоваровУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеТоваровУслугВНТТ"].Имя, 			   Метаданные.Документы["ПоступлениеТоваровУслугВНТТ"].Представление());
				
				СписокТипов.Добавить(Метаданные.Документы["ПриходныйКассовыйОрдер"].Имя,                   Метаданные.Документы["ПриходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеВходящее"].Имя,               Метаданные.Документы["ПлатежноеПоручениеВходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПолученный"].Имя,                     Метаданные.Документы["АккредитивПолученный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Имя, Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Имя,          Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОплатаОтПокупателяПлатежнойКартой"].Имя, 	   Метаданные.Документы["ОплатаОтПокупателяПлатежнойКартой"].Представление());
				
			Иначе // Прочее

				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровОтПокупателя"].Имя,               Метаданные.Документы["ВозвратТоваровОтПокупателя"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,       Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                       Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОтчетКомитентуОПродажах"].Имя,                  Метаданные.Документы["ОтчетКомитентуОПродажах"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеДопРасходов"].Имя,                   Метаданные.Документы["ПоступлениеДопРасходов"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеТоваровУслуг"].Имя,                  Метаданные.Документы["ПоступлениеТоваровУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПоступлениеТоваровУслугВНТТ"].Имя, 
				                                                                                           Метаданные.Документы["ПоступлениеТоваровУслугВНТТ"].Представление());
				
				СписокТипов.Добавить(Метаданные.Документы["ПриходныйКассовыйОрдер"].Имя,                   Метаданные.Документы["ПриходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеВходящее"].Имя,               Метаданные.Документы["ПлатежноеПоручениеВходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПолученный"].Имя,                     Метаданные.Документы["АккредитивПолученный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Имя, Метаданные.Документы["ПлатежноеТребованиеПоручениеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Имя,          Метаданные.Документы["ПлатежноеТребованиеВыставленное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерПоступлениеДенежныхСредств"].Представление());

			КонецЕсли;
		Иначе

			// Заполним список документов, которые могут делать приход по регистру.
			// Список документов зависит от вида договора
			Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			 Или ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда

				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,    Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АктОбОказанииПроизводственныхУслуг"].Имя,    Метаданные.Документы["АктОбОказанииПроизводственныхУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                    Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОтчетКомиссионераОПродажах"].Имя,            Метаданные.Документы["ОтчетКомиссионераОПродажах"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["РасходныйКассовыйОрдер"].Имя,                Метаданные.Документы["РасходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["РеализацияТоваровУслуг"].Имя,                Метаданные.Документы["РеализацияТоваровУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПередачаОС"].Имя,                            Метаданные.Документы["ПередачаОС"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Имя,           Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПереданный"].Имя,                  Метаданные.Документы["АккредитивПереданный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Имя,Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПолученное"].Имя,         Метаданные.Документы["ПлатежноеТребованиеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Представление());
                СписокТипов.Добавить(Метаданные.Документы["РеализацияУслугПоПереработке"].Имя,         Метаданные.Документы["РеализацияУслугПоПереработке"].Представление());

			ИначеЕсли ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			      Или ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда

				СписокТипов.Добавить(Метаданные.Документы["АвансовыйОтчет"].Имя,                        Метаданные.Документы["АвансовыйОтчет"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровПоставщику"].Имя,              Метаданные.Документы["ВозвратТоваровПоставщику"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровПоставщикуИзНТТ"].Имя, 
				                                                                                        Метаданные.Документы["ВозвратТоваровПоставщикуИзНТТ"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,    Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                    Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["РасходныйКассовыйОрдер"].Имя,                Метаданные.Документы["РасходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Имя,           Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПереданный"].Имя,                  Метаданные.Документы["АккредитивПереданный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Имя,Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПолученное"].Имя,         Метаданные.Документы["ПлатежноеТребованиеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Представление());

				Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
					СписокТипов.Добавить(Метаданные.Документы["ПоступлениеТоваровУслуг"].Имя,           Метаданные.Документы["ПоступлениеТоваровУслуг"].Представление());
					СписокТипов.Добавить(Метаданные.Документы["ОтчетКомитентуОПродажах"].Имя,           Метаданные.Документы["ОтчетКомитентуОПродажах"].Представление());
				КонецЕсли;
			Иначе // Прочее

				СписокТипов.Добавить(Метаданные.Документы["АвансовыйОтчет"].Имя,                        Метаданные.Документы["АвансовыйОтчет"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АктОбОказанииПроизводственныхУслуг"].Имя,    Метаданные.Документы["АктОбОказанииПроизводственныхУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровПоставщику"].Имя,              Метаданные.Документы["ВозвратТоваровПоставщику"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ВозвратТоваровПоставщикуИзНТТ"].Имя, 
				                                                                                        Метаданные.Документы["ВозвратТоваровПоставщикуИзНТТ"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Имя,    Метаданные.Документы["КорректировкаДолгаПоВозвратнойТаре"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["КорректировкаДолга"].Имя,                    Метаданные.Документы["КорректировкаДолга"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ОтчетКомиссионераОПродажах"].Имя,            Метаданные.Документы["ОтчетКомиссионераОПродажах"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["РасходныйКассовыйОрдер"].Имя,                Метаданные.Документы["РасходныйКассовыйОрдер"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["РеализацияТоваровУслуг"].Имя,                Метаданные.Документы["РеализацияТоваровУслуг"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПередачаОС"].Имя,                            Метаданные.Документы["ПередачаОС"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Имя,           Метаданные.Документы["ПлатежноеПоручениеИсходящее"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["АккредитивПереданный"].Имя,                  Метаданные.Документы["АккредитивПереданный"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Имя,Метаданные.Документы["ПлатежноеТребованиеПоручениеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежноеТребованиеПолученное"].Имя,         Метаданные.Документы["ПлатежноеТребованиеПолученное"].Представление());
				СписокТипов.Добавить(Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Имя, Метаданные.Документы["ПлатежныйОрдерСписаниеДенежныхСредств"].Представление());

			КонецЕсли;
		КонецЕсли;
		СписокТипов.Добавить(Метаданные.Документы["ДокументРасчетовСКонтрагентом"].Имя,                 Метаданные.Документы["ДокументРасчетовСКонтрагентом"].Представление());
		
		// Пользователь выбирает тип расчетного документа
		
		СписокТипов.СортироватьПоПредставлению();
		
		Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		
			ИмяНачальногоТипа = ЭлементФормы.Значение.Метаданные().Имя;
			НачальноеЗначение = СписокТипов.НайтиПоЗначению(ИмяНачальногоТипа);
			
		Иначе
			
			НачальноеЗначение = Неопределено;
			
		КонецЕсли;
		
		ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов, ЭлементФормы, НачальноеЗначение);

		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат; // пользователь отказался от выбора
		КонецЕсли;

		ТипДокументаРасчетов = ВыбранныйЭлемент.Значение;

	Иначе
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 

	// В качестве владельца формы выбора устанавливаем данный элемент,
	// чтобы выбранное значение было присвоено стандартно.
	ФормаВыбора = Документы[ТипДокументаРасчетов].ПолучитьФормуВыбора(,ЭлементФормы,);
	
	Если ТипДокументаРасчетов = "ДокументРасчетовСКонтрагентом" Тогда
		
		СтруктураОтбора = Новый Структура;
		
		СтруктураОтбора.Вставить("Дата",               ДокументОбъект.Дата);
		СтруктураОтбора.Вставить("Контрагент",         ДоговорКонтрагента.Владелец);
		СтруктураОтбора.Вставить("ДоговорКонтрагента", ДоговорКонтрагента);
		СтруктураОтбора.Вставить("Организация",        ДоговорКонтрагента.Организация);
		ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ДокументРасчетовСКонтрагентом");
			
		БухгалтерскийУчет.ОбработатьВыборСубконто(ЭлементФормы, Ложь, ДоговорКонтрагента.Организация, СтруктураОтбора, ОграничениеТипа);
		Возврат;
		
	Иначе
		// Отфильтруем список документов по договору.
		ФормаВыбора.Отбор.ДокументыПоДоговоруКонтрагента.Установить(ДоговорКонтрагента);
	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияДокументаРасчетовСКонтрагентом()

// Процедура выполняет стандартные действия при начале выбора документа составного типа в формах документов.
//
// Параметры:
//  ДокументОбъект       - объект редактируемого документа;
//  ФормаДокумента       - форма редактируемого документа;
//  ЭлементФормы         - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка - булево, признак выполнения стандартной (системной) обработки события 
//                         начала выбора для данного элемента формы документа.
//  СтруктураОтбора      - структура, содержащая имена и значения отборов в форме выбора.
//  ИмяТабличнойЧасти    - имя табличной части
//
Процедура НачалоВыбораЗначенияДокументаСоставногоТипа(ДокументОбъект, ФормаДокумента, ЭлементФормы, 
	                   СтандартнаяОбработка, СтруктураОтбора, ИмяТабличнойЧасти,ОграничениеТипов = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;

	// Заполним возможный список типов документов, которые могут быть в этом реквизите.
	СписокТипов = Новый СписокЗначений;

	Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда // Шапка документа
		МассивТипов = ДокументОбъект.Метаданные().Реквизиты[ЭлементФормы.Данные].Тип.Типы();
	Иначе // Табличная часть
		Если ОграничениеТипов = Неопределено Тогда
			ИмяКолонки  = ФормаДокумента.ЭлементыФормы[ИмяТабличнойЧасти].ТекущаяКолонка.Имя;
			МассивТипов = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты[ИмяКолонки].Тип.Типы();
		Иначе
			МассивТипов = ОграничениеТипов;
		КонецЕсли;
	КонецЕсли;

	Если МассивТипов.Количество() = 1 Тогда
		ОбъектОписанияМетаданных = Метаданные.НайтиПоТипу(МассивТипов[0]);
		ВыбранныйТип = ОбъектОписанияМетаданных.Имя;
	Иначе

		Для каждого ЭлементМассива Из МассивТипов Цикл
			
			Если не ОграничениеТипов = Неопределено Тогда
				Если ОграничениеТипов.Найти(ЭлементМассива) = Неопределено Тогда
				 	// Тип не вписывается в полученные ограничения
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 

			ПустоеЗначение = Новый(ЭлементМассива);
			ОбъектОписанияМетаданных = ПустоеЗначение.Метаданные();
			СписокТипов.Добавить(ОбъектОписанияМетаданных.Имя, ОбъектОписанияМетаданных.Представление());

		КонецЦикла; 

		СписокТипов.СортироватьПоПредставлению();
		
		ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов, ЭлементФормы);

		Если ВыбранныйЭлемент = Неопределено Тогда // Отказ от выбора
			Возврат;
		КонецЕсли;
		ВыбранныйТип = ВыбранныйЭлемент.Значение;
	КонецЕсли;

	Если ТипЗнч(ЭлементФормы.Значение) <> Тип("ДокументСсылка." + ВыбранныйТип) Тогда
		ЭлементФормы.Значение = Документы[ВыбранныйТип].ПустаяСсылка();
	КонецЕсли; 

	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	Иначе // Форма выбора этого документа специфична. Отсутствует отбор.
		Если ВыбранныйТип = "ДокументРасчетовСКонтрагентом" Тогда
			//СтруктураОтбора = Новый Структура;
			////
			//СписокПараметров = Новый Структура;
			//СписокПараметров.Вставить("Дата",               ДокументОбъект.Дата);
			//
			//Если ТипЗнч(СтруктураОтбора) = Тип("Структура") и СтруктураОтбора.Свойство("Контрагент") Тогда
			//	СписокПараметров.Вставить("Контрагент",         СтруктураОтбора.Контрагент);
			//КонецЕсли; 
			//
			//Если ТипЗнч(СтруктураОтбора) = Тип("Структура") и СтруктураОтбора.Свойство("ДоговорКонтрагента") Тогда
			//	СписокПараметров.Вставить("ДоговорКонтрагента",         СтруктураОтбора.ДоговорКонтрагента);
			//КонецЕсли; 
			//
			//Если ТипЗнч(СтруктураОтбора) = Тип("Структура") и СтруктураОтбора.Свойство("Организация") Тогда
			//	СписокПараметров.Вставить("Организация",         СтруктураОтбора.Организация);
			//КонецЕсли; 
			//
			Если ТипЗнч(СтруктураОтбора) = Тип("Структура") и не СтруктураОтбора.Свойство("Дата") Тогда
				СтруктураОтбора.Вставить("Дата", ДокументОбъект.Дата);
			КонецЕсли; 
			
			БухгалтерскийУчет.ОбработатьВыборСубконто(ЭлементФормы, Ложь, ДокументОбъект.Организация, СтруктураОтбора);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// В качестве владельца формы выбора устанавливаем данный элемент,
	// чтобы выбранное значение было присвоено стандартно.
	ФормаВыбора = Документы[ВыбранныйТип].ПолучитьФормуВыбора(,ЭлементФормы,);

	// Проверка возможности отбора по сделке
	Если СтруктураОтбора.Свойство("Сделка") Тогда
		Если ФормаВыбора.Отбор.Найти("Сделка")= Неопределено Тогда
			СтруктураОтбора.Удалить("Сделка");
		КонецЕсли;
	КонецЕсли;

	// Отфильруем список документов.
	Для каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
		Если ФормаВыбора.Отбор.Найти(ЭлементСтруктуры.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("СписокЗначений") Тогда
			ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравнения.ВСписке;
		Иначе
			Если НЕ ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].ТипЗначения.СодержитТип(ТипЗнч(ЭлементСтруктуры.Значение)) Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Значение      = ЭлементСтруктуры.Значение;
		ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Использование = Истина;
	КонецЦикла; 
	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияДокументаСоставногоТипа()

// Процедура выполняет стандартные действия при начале выбора структурной единицы контрагента в формах документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа;
//  ФормаДокумента                 - форма редактируемого документа;
//  ЭлементФормы                   - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,          - булево, признак выполнения стандартной (системной) обработки события 
//                                   начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораЗначенияСтруктурнойЕдиницы(ДокументОбъект, ФормаДокумента, ЭлементФормы, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
    Если ЭлементФормы.Значение=неопределено Тогда
		//выбор типа
		СписокТипов = Новый СписокЗначений;
		СписокТипов.Добавить(Метаданные.Справочники.БанковскиеСчета.Имя, Метаданные.Справочники.БанковскиеСчета.Синоним);
		СписокТипов.Добавить(Метаданные.Справочники.Кассы.Имя, Метаданные.Справочники.Кассы.Синоним);
		
		ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов,ЭлементФормы);
		
		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ВыбранныйЭлемент.Значение = Метаданные.Справочники.БанковскиеСчета.Имя Тогда
			ЭлементФормы.Значение = Справочники.БанковскиеСчета.ПустаяСсылка();
		Иначе
			ЭлементФормы.Значение = Справочники.Кассы.ПустаяСсылка();
		КонецЕсли;

	КонецЕсли;

	Если ТипЗнч(ЭлементФормы.Значение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		НачалоВыбораЗначенияБанковскогоСчета(ДокументОбъект.Организация, ЭлементФормы, СтандартнаяОбработка, ДокументОбъект.ВалютаДокумента); 

	ИначеЕсли ТипЗнч(ЭлементФормы.Значение) = Тип("СправочникСсылка.Кассы") Тогда
		// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
		// значение было присвоено стандартно.
		ФормаВыбора = Справочники.Кассы.ПолучитьФормуВыбора(,ЭлементФормы,);
		ФормаВыбора.ПараметрОтборПоВладельцу = ДокументОбъект.Организация;
		Если ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ФормаВыбора.Отбор.ВалютаДенежныхСредств.Значение=ДокументОбъект.ВалютаДокумента;
			ФормаВыбора.Отбор.ВалютаДенежныхСредств.Использование=Истина;
		КонецЕсли;
		ФормаВыбора.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
		ФормаВыбора.Открыть();
	КонецЕсли;

КонецПроцедуры // НачалоВыбораЗначенияСтруктурнойЕдиницы()

// Процедура выполняет стандартные действия при начале выбора структурной единицы контрагента в формах документов.
//
// Параметры:
//  ВладелецБанковскогоСчета - ссылка на справочник, определяет владельца банковского счета;
//  ЭлементФормы             - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,    - булево, признак выполнения стандартной (системной) обработки события 
//                             начала выбора для данного элемента формы документа.
//  ВалютаБанковскогоСчета   - ссылка на справочник, определяет валюту банковского счета,
//                             если неп заполнено, то список банковских счетов не фильтруется по валюте;
//
Процедура НачалоВыбораЗначенияБанковскогоСчета(ВладелецБанковскогоСчета,ЭлементФормы, СтандартнаяОбработка, 
	                                   ВалютаБанковскогоСчета = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;

	ФормаВыбораБанковскогоСчета = Справочники.БанковскиеСчета.ПолучитьФормуСписка(, ЭлементФормы);
	ФормаВыбораБанковскогоСчета.ПараметрОтборПоВладельцу = ВладелецБанковскогоСчета;

	Если ЗначениеЗаполнено(ВалютаБанковскогоСчета) Тогда

		ФормаВыбораБанковскогоСчета.Отбор.ВалютаДенежныхСредств.Значение      = ВалютаБанковскогоСчета;
		ФормаВыбораБанковскогоСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;

	КонецЕсли;

	ФормаВыбораБанковскогоСчета.РежимВыбора = Истина;
	ФормаВыбораБанковскогоСчета.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
	ФормаВыбораБанковскогоСчета.Открыть();


КонецПроцедуры // НачалоВыбораЗначенияБанковскогоСчета()

// Процедура выполняет стандартные действия при начале выбора размещения в формах документов.
//
// Параметры:
//  ФормаДокумента           - форма редактируемого документа;
//  ЭлементФормы             - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,    - булево, признак выполнения стандартной (системной) обработки события 
//                             начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораЗначенияРазмещения(ФормаДокумента, ЭлементФормы, СтандартнаяОбработка, СтруктураОтбора = Неопределено, ДопПараметры = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	МассивДоступныеПоляОтбора = Новый Массив;
	ИспользоватьВнутренниеЗаказы = Неопределено;
	ИспользоватьЗаказыНаПроизводство = Неопределено;

	Если ДопПараметры <> Неопределено Тогда
		Если ДопПараметры.Свойство("ДоступныеПоляОтбора") Тогда
			МассивДоступныеПоляОтбора = ДопПараметры.ДоступныеПоляОтбора;
		КонецЕсли;
		Если ДопПараметры.Свойство("ИспользоватьВнутренниеЗаказы") Тогда
			ИспользоватьВнутренниеЗаказы = ДопПараметры.ИспользоватьВнутренниеЗаказы;
		КонецЕсли;
		Если ДопПараметры.Свойство("ИспользоватьЗаказыНаПроизводство") Тогда
			ИспользоватьЗаказыНаПроизводство = ДопПараметры.ИспользоватьЗаказыНаПроизводство;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьВнутренниеЗаказы = Неопределено Тогда
		ИспользоватьВнутренниеЗаказы = УправлениеЗаказами.ИспользоватьВнутренниеЗаказы();	
	КонецЕсли; 
	
	Если ИспользоватьЗаказыНаПроизводство = Неопределено Тогда
		ИспользоватьЗаказыНаПроизводство = УправлениеЗаказами.ИспользоватьЗаказыНаПроизводство();	
	КонецЕсли; 
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Метаданные.Документы.ЗаказПоставщику.Имя, Метаданные.Документы.ЗаказПоставщику.Синоним);
	
	//заказ на производство в размещении может быть указан не всегда
	Если ЭлементФормы.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ЗаказНаПроизводство")) 
		И ИспользоватьЗаказыНаПроизводство Тогда
		СписокТипов.Добавить(Метаданные.Документы.ЗаказНаПроизводство.Имя, Метаданные.Документы.ЗаказНаПроизводство.Синоним);
	КонецЕсли;
	
	Если ИспользоватьВнутренниеЗаказы Тогда
		СписокТипов.Добавить(Метаданные.Документы.ВнутреннийЗаказ.Имя, Метаданные.Документы.ВнутреннийЗаказ.Синоним);
	КонецЕсли;
	
	СписокТипов.Добавить(Метаданные.Справочники.Склады.Имя, Метаданные.Справочники.Склады. Синоним);

	ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов,ЭлементФормы);

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныйЭлемент.Значение = Метаданные.Документы.ЗаказПоставщику.Имя 
		ИЛИ ВыбранныйЭлемент.Значение = Метаданные.Документы.ЗаказНаПроизводство.Имя
		ИЛИ ВыбранныйЭлемент.Значение = Метаданные.Документы.ВнутреннийЗаказ.Имя
		Тогда

		// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
		// значение было присвоено стандартно.
		ФормаВыбора = Документы[ВыбранныйЭлемент.Значение].ПолучитьФормуВыбора(,ЭлементФормы,);
		
		Если ЗначениеЗаполнено(ЭлементФормы.Значение) 
			И ТипЗнч(ЭлементФормы.Значение) = Тип("ДокументСсылка." + ВыбранныйЭлемент.Значение) Тогда
			
			ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
		КонецЕсли;	
		
	Иначе

		// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
		// значение было присвоено стандартно.
		ФормаВыбора = Справочники[ВыбранныйЭлемент.Значение].ПолучитьФормуВыбора(,ЭлементФормы,);
		ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;

		// уберем из выбора НТТ
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Значение                            = Перечисления.ВидыСкладов.НТТ;
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Использование                       = Истина;
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.ВидСравнения                        = ВидСравнения.НеРавно;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидСклада.Доступность = Ложь;

		Если ЗначениеЗаполнено(ЭлементФормы.Значение) 
			И ТипЗнч(ЭлементФормы.Значение) = Тип("СправочникСсылка." + ВыбранныйЭлемент.Значение) Тогда
			
			ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
		КонецЕсли;	
	КонецЕсли;

	// Отфильтруем список выбора
	Если СтруктураОтбора <> Неопределено Тогда
		Для каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
			Если ФормаВыбора.Отбор.Найти(ЭлементСтруктуры.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("СписокЗначений") Тогда
				ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравнения.ВСписке;
			КонецЕсли;
			ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Значение      = ЭлементСтруктуры.Значение;
			ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Использование = Истина;
			
			Если МассивДоступныеПоляОтбора.Найти(ЭлементСтруктуры.Ключ) = Неопределено Тогда
				ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора[ЭлементСтруктуры.Ключ].Доступность = Ложь;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияРазмещения()

// Процедура выполняет стандартные действия при начале выбора размещения в формах документов.
//
// Параметры:
//  ФормаДокумента           - форма редактируемого документа;
//  ЭлементФормы             - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,    - булево, признак выполнения стандартной (системной) обработки события 
//                             начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораЗначенияСкладаГруппы(ФормаДокумента, ЭлементФормы, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;

	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Метаданные.Справочники.ГруппыДоступностиСкладов.Имя, Метаданные.Справочники.ГруппыДоступностиСкладов.Синоним);
	СписокТипов.Добавить(Метаданные.Справочники.Склады.Имя, Метаданные.Справочники.Склады. Синоним);

	ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов,ЭлементФормы);

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныйЭлемент.Значение = Метаданные.Справочники.ГруппыДоступностиСкладов.Имя Тогда

		// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
		// значение было присвоено стандартно.
		ФормаВыбора = Справочники[ВыбранныйЭлемент.Значение].ПолучитьФормуВыбора(,ЭлементФормы,);
        Если ТипЗнч(ЭлементФормы.Значение) = Тип("СправочникСсылка.ГруппыДоступностиСкладов") Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
		КонецЕсли;

	Иначе

		// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
		// значение было присвоено стандартно.
		ФормаВыбора = Справочники[ВыбранныйЭлемент.Значение].ПолучитьФормуВыбора(,ЭлементФормы,);
		ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;

		// уберем из выбора НТТ
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Значение                            = Перечисления.ВидыСкладов.НТТ;
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Использование                       = Истина;
		ФормаВыбора.СправочникСписок.Отбор.ВидСклада.ВидСравнения                        = ВидСравнения.НеРавно;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидСклада.Доступность = Ложь;
        Если ТипЗнч(ЭлементФормы.Значение) = Тип("СправочникСсылка."+ВыбранныйЭлемент.Значение) Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
		КонецЕсли;

	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияСкладаГруппы()

// Процедура выполняет стандартные действия при начале выбора договора контрагента в формах документов.
//
// Параметры:
//  ДокументОбъект                   - объект редактируемого документа;
//  ФормаДокумента                    - форма редактируемого документа;
//  ЭлементФормы                      - элемент формы документа, который надо заполнить; 
//  Контрагент                        - ссылка на справочник, определяет контрагента по договору;
//  ДоговорКонтрагента                - ссылка на справочник, определяет договор контрагента;
//  ВидДоговораВзаиморасчетов         - вид договора взаиморасчетов для отбора, значение перечисления ВидыДоговоровКонтрагентов;
//  СтандартнаяОбработка              - булево, признак выполнения стандартной (системной) обработки события,
//  СтруктураДополнительныхПараметров - структура, содержит дополнительные значения отбора, необязаетльный,
//                                      ключ - имя отбора, значение - структура, определяющая отбор с ключами:
//                                      ЗначениеОтбора (если не задан, то отбор не устанавливается), 
//                                      ВидСравненияОтбора (если не задан, то ВидСравнения.Равно), 
//                                      ДоступностьОтбора (если не задан, то Ложь).
//
Процедура НачалоВыбораЗначенияДоговораКонтрагента(ДокументОбъект, ФормаДокумента, ЭлементФормы, Контрагент, ДоговорКонтрагента,
                                                  ВидыДоговораВзаиморасчетов, СтандартнаяОбработка,
                                                  СтруктураДополнительныхПараметров = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	//// Тип выбираемого значения зависит от договора.
	//Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
	//	Предупреждение("Не выбран контрагент!");
	//	ФормаДокумента.ТекущийЭлемент = ФормаДокумента.ЭлементыФормы.Контрагент;
	//	Возврат;
	//КонецЕсли;

	// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
	// значение было присвоено стандартно.
	ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,ЭлементФормы,);

	// Владельца менять по умолчанию не даем.
	ФормаВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;

	Если ВидыДоговораВзаиморасчетов<>Неопределено Тогда

		// Оставим в выборе только "правильные" договоры
		Если ТипЗнч(ВидыДоговораВзаиморасчетов) = Тип("СписокЗначений") Тогда
			ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                    = ВидСравнения.ВСписке;
		Иначе
			ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.ВидСравнения                    = ВидСравнения.Равно;
		КонецЕсли;
		ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.Значение                            = ВидыДоговораВзаиморасчетов;
		ФормаВыбора.СправочникСписок.Отбор.ВидДоговора.Использование                       = Истина;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидДоговора.Доступность = Ложь;
	КонецЕсли;

	// Еще надо фильтровать по организации, если она заполнена
	Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено
	   И ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ФормаВыбора.СправочникСписок.Отбор.Организация.Значение                            = ДокументОбъект.Организация;
		ФормаВыбора.СправочникСписок.Отбор.Организация.Использование                       = Истина;
		ФормаВыбора.СправочникСписок.Отбор.Организация.ВидСравнения                        = ВидСравнения.Равно;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Организация.Доступность = Ложь;
	КонецЕсли;

	// Добавим фильтры по дополнительным параметрам отбора
	Если ТипЗнч(СтруктураДополнительныхПараметров) = Тип("Структура") Тогда
		Для Каждого ЭлементСтруктуры Из СтруктураДополнительныхПараметров Цикл

			СтруктураОтбора = ЭлементСтруктуры.Значение;
			
			ЗначениеОтбора     = Неопределено;
			ВидСравненияОтбора = Неопределено;
			ДоступностьОтбора  = Неопределено;

			Если СтруктураОтбора.Свойство("ЗначениеОтбора", ЗначениеОтбора) Тогда

				Если СтруктураОтбора.Свойство("ВидСравненияОтбора", ВидСравненияОтбора) Тогда
					ФормаВыбора.СправочникСписок.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравненияОтбора;
				Иначе
					ФормаВыбора.СправочникСписок.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравнения.Равно;
				КонецЕсли;

				ФормаВыбора.СправочникСписок.Отбор[ЭлементСтруктуры.Ключ].Значение      = ЗначениеОтбора;
				ФормаВыбора.СправочникСписок.Отбор[ЭлементСтруктуры.Ключ].Использование = Истина;

				Если СтруктураОтбора.Свойство("ДоступностьОтбора", ДоступностьОтбора) Тогда
					ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора[ЭлементСтруктуры.Ключ].Доступность = ДоступностьОтбора;
				Иначе
					ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора[ЭлементСтруктуры.Ключ].Доступность = Ложь;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ФормаВыбора.НачальноеЗначениеВыбора = ДоговорКонтрагента;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияДоговораКонтрагента()

// Процедура выполняет стандартные действия при начале выбора склада в формах документов.
//
// Параметры:
//  ДокументОбъект        - объект редактируемого документа;
//  ФормаДокумента        - форма редактируемого документа;
//  ЭлементФормы          - элемент формы документа, который надо заполнить; 
//  Склад                 - текущий склад в форме;
//  ВидСравненияНТТ       - Вид сравнения - равно или не равно НТТ;
//  СтандартнаяОбработка, - булево, признак выполнения стандартной (системной) обработки события 
//                          начала выбора для данного элемента формы документа;
//  ЗначВидСклада		  - вид склада, по которому следует установить отбор. Если не указан - то "НТТ"
Процедура НачалоВыбораСкладаНТТ(ДокументОбъект, ФормаДокумента, ЭлементФормы, Склад, ВидСравненияНТТ,
	                          СтандартнаяОбработка, Знач ЗначВидСклада = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;

	// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
	// значение было присвоено стандартно.
	ФормаВыбора = Справочники.Склады.ПолучитьФормуВыбора(,ЭлементФормы,);

	Если ЗначВидСклада = Неопределено Тогда
		ЗначВидСклада = Перечисления.ВидыСкладов.НТТ;
	КонецЕсли;
	
	// уберем из выбора НТТ
	ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Значение                            = ЗначВидСклада;
	ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Использование                       = Истина;
	ФормаВыбора.СправочникСписок.Отбор.ВидСклада.ВидСравнения                        = ВидСравненияНТТ;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидСклада.Доступность = Ложь;
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ЭлементФормы.ВыборГруппИЭлементов;

	Если ТипЗнч(Склад) = Тип("СправочникСсылка.Склады") Тогда
		ФормаВыбора.НачальноеЗначениеВыбора = Склад;
	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораСкладаНТТ()

// Процедура выполняет стандартные действия при начале выбора приходного ордера в формах документов.
//
// Параметры:
//  ЭлементФормы          - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка, - булево, признак выполнения стандартной (системной) обработки события 
//                          начала выбора для данного элемента формы документа;
//  Организация			- организация, по которой необходимо установить отбор
//	ВидОперации 		- вид операции, по которой необходимо установить отбор
Процедура НачалоВыбораПриходногоОрдера(ЭлементФормы, СтандартнаяОбработка, Организация, ВидОперации) Экспорт
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Документы.ПриходныйОрдерНаТовары.ПолучитьФормуВыбора(,ЭлементФормы,);
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ФормаВыбора.ДокументСписок.Отбор.ВидОперации.Значение      = ВидОперации;
		ФормаВыбора.ДокументСписок.Отбор.ВидОперации.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора.ВидОперации.Доступность = Ложь;
	КонецЕсли;
	
	// Надо отфильтровать список по организации
	Если ЗначениеЗаполнено(Организация) Тогда
		ФормаВыбора.Отбор.Организация.Значение      = Организация;
		ФормаВыбора.Отбор.Организация.Использование = Истина;
	КонецЕсли;

	Если ТипЗнч(ЭлементФормы.Значение) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		ФормаВыбора.НачальноеЗначениеВыбора = ЭлементФормы.Значение;
	КонецЕсли;

	ФормаВыбора.Открыть();
	
КонецПроцедуры //НачалоВыбораПриходногоОрдера

// Вызывается в обработчике события "Начало выбора" при выборе номенклатуры поставщика.
//
Процедура НачалоВыбораНоменклатурыКонтрагента(Элемент, СтандартнаяОбработка, Контрагент, Номенклатура) Экспорт

	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Справочники.Номенклатура.ПолучитьФормуВыбора(, Элемент);
	ФормаВыбора.КонтрагентОтбораНоменклатуры = Контрагент;

	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = Номенклатура;
    ФормаВыбора.НачальноеЗначениеВыбора = Номенклатура;
	ФормаВыбора.ПараметрВыборГруппИЭлементов = Элемент.ВыборГруппИЭлементов;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Номенклатура",Номенклатура);
	СтруктураОтбора.Вставить("Контрагент",Контрагент);
	ФормаВыбора.ЭлементыФормы.СписокНоменклатурыКонтрагента.ТекущаяСтрока = РегистрыСведений.НоменклатураКонтрагентов.СоздатьКлючЗаписи(СтруктураОтбора);

	ФормаВыбора.Открыть();

КонецПроцедуры

// Процедура выполняет стандартные действия при начале выбора спецификации в формах документов.
//
// Параметры:
//  Номенклатура - ссылка на справочник, определяет продукцию, которая указана в спецификации;
//  ЭлементФормы             - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,    - булево, признак выполнения стандартной (системной) обработки события 
//                             начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораЗначенияСпецификации(Номенклатура, ЭлементФормы, СтандартнаяОбработка, ТолькоАктивные = Истина) Экспорт

	СтандартнаяОбработка    = Ложь;
	ФормаВыбораСпецификации = Справочники.СпецификацииНоменклатуры.ПолучитьФормуВыбора(, ЭлементФормы);

	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.ВидСравнения  = ВидСравнения.Равно;
	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.Значение      = Номенклатура;
	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.Использование = Истина;
	
	Если ТолькоАктивные Тогда
		ФормаВыбораСпецификации.Отбор.Активная.Установить(Истина);
	КонецЕсли;

	ФормаВыбораСпецификации.РежимВыбора                  = Истина;
	ФормаВыбораСпецификации.ПараметрВыборГруппИЭлементов = ЭлементФормы.ВыборГруппИЭлементов;

	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбораСпецификации.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;

	ФормаВыбораСпецификации.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияСпецификации()

// Функция формирует таблицу значений со структурой колононк, используемых при установке отборов
//
Функция СоздатьТаблицуДляОтбора() Экспорт
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить( "Имя",          Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	Таб.Колонки.Добавить( "ВидСравнения", Новый ОписаниеТипов("ВидСравнения"));
	Таб.Колонки.Добавить( "НеИзменять",   Новый ОписаниеТипов("Булево"));
	Таб.Колонки.Добавить( "Значение");
	
	Возврат Таб;
	
КонецФункции // СоздатьТаблицуДляОтбора()

// Функция формирует таблицу значений для установки отбора нематериальных 
// производственных статей затрат.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица значений с заполненными значениями для отбора 
//
Функция СформироватьТаблицуОтбораНематериальныхПроизводственныхСтатейЗатрат() Экспорт
	
	ТаблицаОтбора = СоздатьТаблицуДляОтбора();
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.Имя = "ВидЗатрат";
	НоваяСтрока.ВидСравнения = ВидСравнения.НеРавно;
	НоваяСтрока.Значение = Перечисления.ВидыЗатрат.Материальные;
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.Имя = "ХарактерЗатрат";
	НоваяСтрока.ВидСравнения = ВидСравнения.Равно;
	НоваяСтрока.Значение = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы;
	
	Возврат ТаблицаОтбора;
	
КонецФункции // СформироватьТаблицуОтбораНематериальныхПроизводственныхСтатейЗатрат()

// Функция формирует таблицу значений для установки отбора нематериальных статей затрат.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица значений с заполненными значениями для отбора 
//
Функция СформироватьТаблицуОтбораНематериальныхСтатейЗатрат() Экспорт
	
	ТаблицаОтбора = СоздатьТаблицуДляОтбора();
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.Имя = "ВидЗатрат";
	НоваяСтрока.ВидСравнения = ВидСравнения.НеРавно;
	НоваяСтрока.Значение = Перечисления.ВидыЗатрат.Материальные;
	
	Возврат ТаблицаОтбора;
	
КонецФункции // СформироватьТаблицуОтбораНематериальныхПроизводственныхСтатейЗатрат()

// Процедура выполняет стандартные действия при начале выбора статьи затрат в формах.
//
// Параметры:
//	ЗначениеОтбора       - 1) Характер затрат, по которому следует установить отбор.
//						 - 2) Объект типа отбор. Используют поля Имя, Вид сравнения и Значение.
//  ЭлементФормы         - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка - булево, признак выполнения стандартной (системной) обработки события 
//                         начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораСтатьиЗатрат(ЗначениеОтбора, ЭлементФормы, СтандартнаяОбработка, ВидЗатрат = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.СтатьиЗатрат.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбора.РежимВыбора = Истина;
	Если ТипЗнч(ЗначениеОтбора) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекОтбор Из ЗначениеОтбора Цикл
			ФормаВыбора.Отбор[ТекОтбор.Имя].ВидСравнения  = ТекОтбор.ВидСравнения;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Значение      = ТекОтбор.Значение;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Использование = Истина;
			Если ТекОтбор.НеИзменять Тогда
				ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора[ТекОтбор.Имя].Доступность = НЕ ТекОтбор.НеИзменять;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеОтбора = Неопределено Тогда
		// Ничего не делаем
	Иначе // ЗначениеОтбора = Характер затрат
		ФормаВыбора.Отбор.ХарактерЗатрат.Установить(ЗначениеОтбора, Истина);
	КонецЕсли;
	
	Если ВидЗатрат <> Неопределено Тогда
		ФормаВыбора.Отбор.ВидЗатрат.Установить(ВидЗатрат, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораСтатьиЗатрат()

// Процедура выполняет стандартные действия при начале выбора Подразделения в формах.
//
// Параметры:
//	ЗначениеОтбора       - 1) ВидПодразделения, по которому следует установить отбор.
//						 - 2) Объект типа отбор. Используют поля Имя, Вид сравнения и Значение.
//  ЭлементФормы         - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка - булево, признак выполнения стандартной (системной) обработки события 
//                         начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораПодразделения(ЗначениеОтбора, ЭлементФормы, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.Подразделения.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбора.РежимВыбора = Истина;
	Если ТипЗнч(ЗначениеОтбора) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекОтбор Из ЗначениеОтбора Цикл
			ФормаВыбора.Отбор[ТекОтбор.Имя].ВидСравнения  = ТекОтбор.ВидСравнения;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Значение      = ТекОтбор.Значение;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Использование = Истина;
			Если ТекОтбор.НеИзменять Тогда
				ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора[ТекОтбор.Имя].Доступность = НЕ ТекОтбор.НеИзменять;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеОтбора = Неопределено Тогда
		// Ничего не делаем
	Иначе // ЗначениеОтбора = Вид подразделения
		ФормаВыбора.Отбор.ВидПодразделения.Установить(ЗначениеОтбора, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораПодразделения()

// Процедура выполняет стандартные действия при начале выбора Подразделения в формах.
//
// Параметры:
//	ЗначениеОтбора       - 1) ВидПодразделения, по которому следует установить отбор.
//						 - 2) Объект типа отбор. Используют поля Имя, Вид сравнения и Значение.
//  ЭлементФормы         - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка - булево, признак выполнения стандартной (системной) обработки события 
//                         начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораПодразделенияОрганизации(ЗначениеОтбора, ЭлементФормы, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.ПодразделенияОрганизаций.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбора.РежимВыбора = Истина;
	Если ТипЗнч(ЗначениеОтбора) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекОтбор Из ЗначениеОтбора Цикл
			ФормаВыбора.Отбор[ТекОтбор.Имя].ВидСравнения  = ТекОтбор.ВидСравнения;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Значение      = ТекОтбор.Значение;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Использование = Истина;
			Если ТекОтбор.НеИзменять Тогда
				ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора[ТекОтбор.Имя].Доступность = НЕ ТекОтбор.НеИзменять;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеОтбора = Неопределено Тогда
		// Ничего не делаем
	Иначе // ЗначениеОтбора = Вид подразделения
		ФормаВыбора.Отбор.ВидПодразделения.Установить(ЗначениеОтбора, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементФормы.ВыборПоВладельцу) Тогда
		ФормаВыбора.ПараметрВыборПоВладельцу = ЭлементФормы.ВыборПоВладельцу;
		ФормаВыбора.ПараметрОтборПоВладельцу = ЭлементФормы.ВыборПоВладельцу;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораПодразделенияОрганизации()

// Вызывается в обработчике события "Начало выбора из списка" при выборе номенклатуры.
//
Процедура НачалоВыбораИзСпискаЗначенияНоменклатуры(Элемент, СтандартнаяОбработка, Номенклатура) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = РегистрыСведений.АналогиНоменклатуры.ПолучитьФорму("ФормаВыбора", Элемент);
	ФормаВыбора.НоменклатураОтбораАналогов = Номенклатура;
	ФормаВыбора.Открыть();
	
КонецПроцедуры // НачалоВыбораИзСпискаЗначенияНоменклатуры()

// Процедура выполняет стандартные действия при начале выбора спецификации в формах документов.
//
// Параметры:
//  Номенклатура - ссылка на справочник, определяет продукцию, которая указана в спецификации;
//  ЭлементФормы             - элемент формы документа, который надо заполнить; 
//  СтандартнаяОбработка,    - булево, признак выполнения стандартной (системной) обработки события 
//                             начала выбора для данного элемента формы документа.
//
Процедура НачалоВыбораИнвентаризации(Организация, Подразделение = Неопределено, ПодразделениеОрганизации = Неопределено, ЭлементФормы, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Документы.ИнвентаризацияНЗП.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбора.Отбор.Организация.Установить(Организация, Истина);
	
	
	ФормаВыбора.РежимВыбора = Истина;
	
	Если Подразделение <> Неопределено Тогда
		ФормаВыбора.Отбор.Подразделение.Установить(Подразделение, Истина);
	КонецЕсли;
	Если ПодразделениеОрганизации <> Неопределено Тогда
		ФормаВыбора.Отбор.ПодразделениеОрганизации.Установить(ПодразделениеОрганизации, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементФормы.Значение) Тогда
		ФормаВыбора.ПараметрТекущаяСтрока = ЭлементФормы.Значение;
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораИнвентаризации()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОФОРМЛЕНИЯ ФОРМЫ

// Активизирует первый не заполненный реквизит в форме
// Вызывается при открытии формы
//
// Параметры:
//  Объект				- Объект 
//  ФормаДокумента		- Форма объекта
//  СтруктураРеквизитов	- Реквизиты которые необходимо актив
//  ТабличнаяЧасть		- Имя ТЧ на каторую будет установлен фокус, если все обязательные реквизиты заполнены
//  СтраницыСТабЧастями	- структура типа ("имя страницы",	"имя таблицы размещенной на этой странице"),
//						т.е. в параметр "ТабличнаяЧасть" можно передать имя страницы на каторой размещена ТЧ,
//						а структура "СтраницыСТабЧастями" необходима для поиска ТЧ по имени страницы.
//
Функция АктивизироватьРеквизитВФорме(Объект, ФормаОбъекта, СтруктураРеквизитов = Неопределено, ТабличнаяЧасть = неопределено, СтраницыСТабЧастями = неопределено) Экспорт

	Если СтруктураРеквизитов = Неопределено 
		ИЛИ ТипЗнч(СтруктураРеквизитов) <> Тип("Структура") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("Дата");
		СтруктураРеквизитов.Вставить("Организация");
		СтруктураРеквизитов.Вставить("Касса");
		СтруктураРеквизитов.Вставить("СчетОрганизации");
		СтруктураРеквизитов.Вставить("БанковскийСчет");
		СтруктураРеквизитов.Вставить("Склад");
		СтруктураРеквизитов.Вставить("СкладОрдер");
		СтруктураРеквизитов.Вставить("Контрагент");
		СтруктураРеквизитов.Вставить("Получатель");
		СтруктураРеквизитов.Вставить("Плательщик");
		СтруктураРеквизитов.Вставить("ФизЛицо");
		СтруктураРеквизитов.Вставить("ПериодРегистрации");
		СтруктураРеквизитов.Вставить("Сотрудник");
		СтруктураРеквизитов.Вставить("Исполнитель");
		СтруктураРеквизитов.Вставить("КурсОбучения");
		СтруктураРеквизитов.Вставить("ДатаЗавершенияКурса");
		СтруктураРеквизитов.Вставить("Мероприятие");
	КонецЕсли;
	
	Для каждого Элемент Из СтруктураРеквизитов Цикл
		// Определим, есть ли ЭУ с таким именем.
		ЭлементУправления = ФормаОбъекта.ЭлементыФормы.Найти(Элемент.Ключ);
		Если ЭлементУправления <> Неопределено
			И ЭлементУправления.Видимость
			И ЭлементУправления.Доступность 
			И НЕ ЗначениеЗаполнено(ЭлементУправления.Значение) Тогда 
			
			// Нашли не заполненный ЭУ. Делаем его текущим и прекращаем цикл
			ФормаОбъекта.ТекущийЭлемент = ЭлементУправления;
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Если есть ТЧ то необходимо фокус передать ей
	Если ТабличнаяЧасть <> Неопределено Тогда
		ЭлементУправления = ФормаОбъекта.ЭлементыФормы.Найти(ТабличнаяЧасть.Имя);
		Если ТипЗнч(ЭлементУправления) = Тип("ТабличноеПоле") Тогда
			ФормаОбъекта.ТекущийЭлемент = ЭлементУправления;
			Возврат Истина;
		ИначеЕсли СтраницыСТабЧастями <> неопределено Тогда
			ЭлементУправления = ФормаОбъекта.ЭлементыФормы.Найти(СтраницыСТабЧастями.НайтиПоЗначению(ТабличнаяЧасть.Имя));
			Если ТипЗнч(ЭлементУправления) = Тип("ТабличноеПоле") Тогда
				ФормаОбъекта.ТекущийЭлемент = ЭлементУправления;
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Если все поля заполнены но нет ТЧ то передадим фокус панели, в результате
	// визуально будет казаться что фокус не установлен ни на одном ЭФ.
	// Хотелось бы фокус установить на кнопке "Закрыть", но технически не предоставляется такой возможности.
	ЭлементУправления = ФормаОбъекта.ЭлементыФормы.Найти("ОсновныеДействияФормы");
	Если ЭлементУправления <> Неопределено Тогда
		ФормаОбъекта.ТекущийЭлемент = ЭлементУправления;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции// АктивизироватьРеквизитВФорме()

// Формирует и устанавливает текст заголовка формы документа с учетом вида склада
//
// Параметры:
//  СтрокаВидаОперации - строка вида операции документа,
//  ДокументОбъект     - объект документа,
//  ФормаДокумента     - форма документа,
//  СкладДляЗаголовка  - склад, вид которого нужно вынести в заголовок
//
Процедура УстановитьЗаголовокФормыДокументаСУчетомСклада(СтрокаВидаОперации = "", ДокументОбъект, ФормаДокумента, СкладДляЗаголовка = Неопределено) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	ДобавитьКЗаголовкуФормы = "";
	Если СкладДляЗаголовка <> Неопределено Тогда
		Если СкладДляЗаголовка.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ДобавитьКЗаголовкуФормы = "НТТ";
		ИначеЕсли СкладДляЗаголовка.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			ДобавитьКЗаголовкуФормы = "розница";
		КонецЕсли;
	ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("Склад") <> Неопределено Тогда
		Если ДокументОбъект.Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			ДобавитьКЗаголовкуФормы = "НТТ";
		ИначеЕсли ДокументОбъект.Склад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			ДобавитьКЗаголовкуФормы = "розница";
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаВидаОперации) И ЗначениеЗаполнено(ДобавитьКЗаголовкуФормы) Тогда
		ДобавитьКЗаголовкуФормы = ", "+ДобавитьКЗаголовкуФормы;
	КонецЕсли;
	УстановитьЗаголовокФормыДокумента(СтрокаВидаОперации + ДобавитьКЗаголовкуФормы, ДокументОбъект, ФормаДокумента)

КонецПроцедуры // УстановитьЗаголовокФормыДокументаСУчетомСклада()

// Устанавливает текст надписи сделки на форме документа
//
// Параметры:
//  ДокументОбъект - объект документа, 
//  ФормаДокумента - форма документа.
// ЗаказПокупателя - признак заказа покупателю/поставщику
//
Процедура УстановитьНадписьСделки(ДокументОбъект, ФормаДокумента, ЗаказПокупателя = Истина) Экспорт

	НадписьСделка = "Сделка:";

	ДоговорКонтрагента = ДокументОбъект.ДоговорКонтрагента;

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		      Или ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда

			НадписьСделка = "Заказ "+?(ЗаказПокупателя,"покупателя:", "поставщику:");

		ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам тогда

			НадписьСделка = "Счет "+?(ЗаказПокупателя,"покупателю:", "поставщика:");

		КонецЕсли;
	КонецЕсли;

	ФормаДокумента.ЭлементыФормы.НадписьСделка.Заголовок = НадписьСделка;

КонецПроцедуры // УстановитьНадписьСделки()

// Устанавливает текст надписи заголовка суммы взаиморасчетов на форме документа
//
// Параметры:
//  ДокументОбъект     - объект документа, 
//  ФормаДокумента     - форма документа.
//
Процедура УстановитьНадписьСуммыВзаиморасчетов(ДокументОбъект, ФормаДокумента) Экспорт

	ВалютаВзаиморасчетовПоДоговору = ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетовПоДоговору) Тогда
		ФормаДокумента.ЭлементыФормы.НадписьСуммаВзаиморасчетов.Заголовок = "Сумма <нет валюты>:";
	Иначе	
		ФормаДокумента.ЭлементыФормы.НадписьСуммаВзаиморасчетов.Заголовок = "Сумма " + СокрЛП(ВалютаВзаиморасчетовПоДоговору) + ":";
	КонецЕсли;	

КонецПроцедуры // УстановитьНадписьСуммыВзаиморасчетов()

// Устанавливает видимость колоки "ХарактеристикаНоменклатуры" в табличной части документа
//
// Параметры:
//  КолонкиТабПоля   - коллекция колонок табличного поля
//  СтруктураКолонок - структура, содержащая имена колонок
//                     по умолчанию "ХарактеристикаНоменклатуры"
//
Процедура УстановитьВидимостьХарактеристикиНоменклатуры(КолонкиТабПоля, СтруктураКолонок = Неопределено) Экспорт

	Если СтруктураКолонок = Неопределено Тогда
		СтруктураКолонок = Новый Структура("ХарактеристикаНоменклатуры");
	КонецЕсли;

	ИспользоватьХарактеристики = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();

	УстановитьВидимостьКолонок(КолонкиТабПоля, СтруктураКолонок, ИспользоватьХарактеристики);

КонецПроцедуры // УстановитьВидимостьХарактеристикиНоменклатуры()

// Устанавливает видимость колонки "СерияНоменклатуры" в табличной части документа
//
// Параметры:
//  КолонкиТабПоля   - коллекция колонок табличного поля
//  СтруктураКолонок - структура, содержащая имена колонок
//                     по умолчанию "СерияНоменклатуры"
//
Процедура УстановитьВидимостьСерииНоменклатуры(КолонкиТабПоля, СтруктураКолонок = Неопределено) Экспорт

	Если СтруктураКолонок = Неопределено Тогда
		СтруктураКолонок = Новый Структура("СерияНоменклатуры");
	КонецЕсли;

	ИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();

	УстановитьВидимостьКолонок(КолонкиТабПоля, СтруктураКолонок, ИспользоватьСерии);

КонецПроцедуры // УстановитьВидимостьСерииНоменклатуры()

// Устанавливает видимость колонки "Принадлежность номенклатуры" в табличной части документа
//
// Параметры:
//  КолонкиТабПоля   - коллекция колонок табличного поля
//  ДатаДокумента    - дата документа
//  СтруктураКолонок - структура, содержащая имена колонок
//                     по умолчанию "СерияНоменклатуры"
//
Процедура УстановитьВидимостьПринадлежностиНоменклатуры(КолонкиТабПоля, ДатаДокумента, СтруктураКолонок = Неопределено) Экспорт

	Если СтруктураКолонок = Неопределено Тогда
		СтруктураКолонок = Новый Структура("ПринадлежностьНоменклатуры");
	КонецЕсли;

	ИспользуетсяРасширеннаяАналитикаУчета = УправлениеЗапасами.ИспользуетсяРасширеннаяАналитикаУчета(ДатаДокумента);
	ИспользоватьРегистрТоварыОрганизацийРегл = ОбщегоНазначения.ИспользоватьРегистрТоварыОрганизацийРегл(ДатаДокумента);
	ИспользоватьПринадлежностьНоменклатуры = ИспользуетсяРасширеннаяАналитикаУчета ИЛИ ИспользоватьРегистрТоварыОрганизацийРегл;
	
	УстановитьВидимостьКолонок(КолонкиТабПоля, СтруктураКолонок, ИспользоватьПринадлежностьНоменклатуры);

КонецПроцедуры // УстановитьВидимостьПринадлежностиНоменклатуры()

// Устанавливает видимость колонки "Проект" в табличной части производственных документов.
//
// Параметры:
//  КолонкиТабПоля   - коллекция колонок табличного поля
//  СтруктураКолонок - структура, содержащая имена колонок
//                     по умолчанию "ЗаказНаПроизводство"
//
Процедура УстановитьВидимостьКолонкиПроект(КолонкиТабПоля, СтруктураКолонок = Неопределено, УказаниеПроектовВТабличнойЧастиДокументов = Неопределено) Экспорт

	Если СтруктураКолонок = Неопределено Тогда
		СтруктураКолонок = Новый Структура("Проект");
	КонецЕсли;

	Если УказаниеПроектовВТабличнойЧастиДокументов = Неопределено Тогда
		УказаниеПроектовВТабличнойЧастиДокументов = УправлениеПроектами.УказаниеПроектовВТабличнойЧастиДокументов();
	КонецЕсли;

	УстановитьВидимостьКолонок(КолонкиТабПоля, СтруктураКолонок, УказаниеПроектовВТабличнойЧастиДокументов);

КонецПроцедуры // УстановитьВидимостьКолонкиПроект()

// Устанавлеивает видимость колонки "Склад" в табличной части формы документа 
// в зависимости от настройки использования складов в табличных частях документов.
//
// Параметры:
//  КолонкиТовары            – коллекция колонок табличного поля "Товары",
//  КолонкиВозвратнаяТара    – коллекция колонок табличного поля "ВозвратнаяТара", 
//                             необязательный, если не передан, то видимость колонки не устанавливается,
//  ЭУСклад                  - ЭУ формы, в который вводится склад в шапке,
//  ИмяКолонкиСклад          - Строка, имя колонки склада, в которые вводится склад в ТЧ (имена должны быть одинаковыми в обоих ТЧ),
//  ИспользоватьКолонкуСклад - булево, определяет указываеются ли склады в табличной части документа или они указываются только в шапке.
//
Процедура УстановитьВидимостьОбязательностьСклада(КолонкиТовары, КолонкиВозвратнаяТара = Неопределено, ЭУСклад, 
                                                  ИмяКолонкиСклад = "Склад", ИспользоватьКолонкуСклад, 
                                                  КолонкиОборудование = Неопределено) Экспорт

	ИспользоватьВозвратнуюТару = Константы.ИспользоватьВозвратнуюТару.Получить();

	// Установим видимость колонки
	СтруктураКолонок = Новый Структура("Склад");

	УстановитьВидимостьКолонок(КолонкиТовары, СтруктураКолонок, ИспользоватьКолонкуСклад);
	Если КолонкиОборудование <> Неопределено Тогда
		УстановитьВидимостьКолонок(КолонкиОборудование, СтруктураКолонок, ИспользоватьКолонкуСклад);
	КонецЕсли;	

	Если ИспользоватьВозвратнуюТару И КолонкиВозвратнаяТара <> Неопределено Тогда
		УстановитьВидимостьКолонок(КолонкиВозвратнаяТара, СтруктураКолонок, ИспользоватьКолонкуСклад);
	КонецЕсли;

	//Установим автоотметки незаполненного.
	Если ИспользоватьКолонкуСклад Тогда
		КолонкиТовары[ИмяКолонкиСклад].АвтоотметкаНеЗаполненного = Истина;
		Если ИспользоватьВозвратнуюТару И КолонкиВозвратнаяТара <> Неопределено Тогда
			КолонкиВозвратнаяТара[ИмяКолонкиСклад].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;
		Если КолонкиОборудование <> Неопределено Тогда
			КолонкиОборудование[ИмяКолонкиСклад].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;		
		ЭУСклад.АвтоотметкаНеЗаполненного   = Ложь;
		ЭУСклад.ОтметкаНеЗаполненного       = Ложь;
	Иначе
		ЭУСклад.АвтоотметкаНеЗаполненного = Истина;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьКолонкиСклад()

// Устанавливает видимость колонки "ЗаказПоставщику" или "ЗаказПокупателя" в табличной части формы документа
// в зависимости от настройки использования заказов в табличных частях документов.
//
// Параметры:
//  ДокументВидОперации   – вид операции документа,
//  ДоговорКонтрагента    – договор с контрагентом,
//  КолонкиТовары         – коллекция колонок табличного поля "Товары",
//  КолонкиВозвратнаяТара – коллекция колонок табличного поля "ВозвратнаяТара",
//                          необязательный, если не передан, то видимость колонки не устанавливается,
//  КолонкиУслуги         – коллекция колонок табличного поля "Услуги",
//                          необязательный, если не передан, то видимость колонки не устанавливается,
//  ЭУЗаказ               - ЭУ формы, в который вводится заказ в шапке,
//  ИмяКолонкиЗаказ       - строка, имя колонки заказа, в которые вводится заказ в ТЧ (имена должны быть одинаковыми во всех ТЧ),
//  ВидОперации           - строка, определяет вид операции, возможнве значения "Поступление", "Реализация","ПоступлениеНТТ", "РеализацияСчет", "ВозвратОтПокупателя"
//                          по умолчанию "Реализация".
//
Процедура УстановитьВидимостьКолонкиЗаказ(ЭлементыФормы, ДокументВидОперации, ДоговорКонтрагента, КолонкиТовары, КолонкиВозвратнаяТара = Неопределено, КолонкиУслуги = Неопределено, КолонкиОборудование = Неопределено, КолонкиВзаиморасчеты = Неопределено, КолонкиБланки = Неопределено, ЭУЗаказ, ИмяКолонкиЗаказ = "ЗаказПокупателя", ВидОперации = "Реализация", ИмяКолонкиСделка = "Сделка") Экспорт
	

	ИспользоватьКолонкуЗаказ = УправлениеЗаказами.ИспользоватьЗаказВТабличнойЧасти(ДокументВидОперации, ДоговорКонтрагента, ВидОперации);
	ОтмечатьНезаполненные = (ИспользоватьКолонкуЗаказ.ОбязательноеЗаполнениеЗаказаВТабЧасти) И (ВидОперации <> "РеализацияСчет");
	
	Если ИспользоватьКолонкуЗаказ.ОбязательноеЗаполнениеЗаказаВТабЧасти ИЛИ ИспользоватьКолонкуЗаказ.ИспользоватьЗаказВТабЧасти Тогда
		ИспользоватьКолонкуЗаказ = Истина;
	Иначе 
		ИспользоватьКолонкуЗаказ = Ложь;
	КонецЕсли;
	Если ДокументВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительства
		//Смартис Лиманчук начало 18.01.2013
		ИЛИ ДокументВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОбъектыСтроительстваНал
		//Смартис Лиманчук окончание 18.01.2013
		ИЛИ ДокументВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслугВНТТ.ВнутреннееПеремещение Тогда
		ИспользоватьКолонкуЗаказ = Ложь;
	КонецЕсли;
	
	
	ИспользоватьВозвратнуюТару = Константы.ИспользоватьВозвратнуюТару.Получить();

	// Установим видимость колонки
	КолонкиТовары[ИмяКолонкиЗаказ].ИзменятьВидимость = Ложь;
	КолонкиТовары[ИмяКолонкиЗаказ].Видимость         = ИспользоватьКолонкуЗаказ;
	Если ВидОперации<>"ВозвратОтПокупателя" Тогда
		ЭлементыФормы.КоманднаяПанельТовары.Кнопки.ПодменюЗаполнить.Кнопки.ДействиеОтобратьИЗаполнитьПоЗаказам.Доступность = ИспользоватьКолонкуЗаказ;
	КонецЕсли;
	
	Если ИспользоватьВозвратнуюТару И КолонкиВозвратнаяТара <> Неопределено Тогда
		КолонкиВозвратнаяТара[ИмяКолонкиЗаказ].ИзменятьВидимость = Ложь;
		КолонкиВозвратнаяТара[ИмяКолонкиЗаказ].Видимость         = ИспользоватьКолонкуЗаказ;
		Если ВидОперации<>"ВозвратОтПокупателя" Тогда
			ЭлементыФормы.КоманднаяПанельВозвратнаяТара.Кнопки.ПодменюЗаполнить.Кнопки.ДействиеОтобратьИЗаполнитьПоЗаказам.Доступность = ИспользоватьКолонкуЗаказ;
		КонецЕсли;
	КонецЕсли;

	Если КолонкиУслуги <> Неопределено Тогда
		КолонкиУслуги[ИмяКолонкиЗаказ].ИзменятьВидимость = Ложь;
		КолонкиУслуги[ИмяКолонкиЗаказ].Видимость         = ИспользоватьКолонкуЗаказ;
		ЭлементыФормы.КоманднаяПанельУслуги.Кнопки.ПодменюЗаполнить.Кнопки.ДействиеОтобратьИЗаполнитьПоЗаказам.Доступность = ИспользоватьКолонкуЗаказ;
	КонецЕсли;

	Если КолонкиОборудование <> Неопределено Тогда
		КолонкиОборудование[ИмяКолонкиЗаказ].ИзменятьВидимость = Ложь;
		КолонкиОборудование[ИмяКолонкиЗаказ].Видимость         = ИспользоватьКолонкуЗаказ;
		ЭлементыФормы.КоманднаяПанельОборудование.Кнопки.ПодменюЗаполнить.Кнопки.ДействиеОтобратьИЗаполнитьПоЗаказам.Доступность = ИспользоватьКолонкуЗаказ;
	КонецЕсли;
	
	Если КолонкиБланки <> Неопределено Тогда
		КолонкиБланки[ИмяКолонкиЗаказ].ИзменятьВидимость = Ложь;
		КолонкиБланки[ИмяКолонкиЗаказ].Видимость         = ИспользоватьКолонкуЗаказ;
		//ЭлементыФормы.КоманднаяПанельБланки.Кнопки.ПодменюЗаполнить.Кнопки.ДействиеОтобратьИЗаполнитьПоЗаказам.Доступность = ИспользоватьКолонкуЗаказ;
	КонецЕсли;
	
	//Установим автоотметки незаполненного.
	Если ОтмечатьНезаполненные Тогда
		КолонкиТовары[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Истина;
		
		Если ИспользоватьВозвратнуюТару И КолонкиВозвратнаяТара <> Неопределено Тогда
			КолонкиВозвратнаяТара[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;

		Если КолонкиУслуги <> Неопределено Тогда
			КолонкиУслуги[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;

		Если КолонкиОборудование <> Неопределено Тогда
			КолонкиОборудование[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;
		
		Если КолонкиБланки <> Неопределено Тогда
			КолонкиБланки[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;

		Если КолонкиВзаиморасчеты <> Неопределено Тогда
			КолонкиВзаиморасчеты[ИмяКолонкиСделка].Видимость = Истина;
			КолонкиВзаиморасчеты[ИмяКолонкиСделка].АвтоотметкаНеЗаполненного = Истина;
		КонецЕсли;

		ЭУЗаказ.АвтоотметкаНеЗаполненного = Ложь;
		ЭУЗаказ.ОтметкаНеЗаполненного     = Ложь;
	Иначе
		КолонкиТовары[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Ложь;

		Если ИспользоватьВозвратнуюТару И КолонкиВозвратнаяТара <> Неопределено Тогда
			КолонкиВозвратнаяТара[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Ложь;
		КонецЕсли;

		Если КолонкиУслуги <> Неопределено Тогда
			КолонкиУслуги[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Ложь;
		КонецЕсли;
		
		Если КолонкиОборудование <> Неопределено Тогда
			КолонкиОборудование[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Ложь;
		КонецЕсли;
		
		Если КолонкиВзаиморасчеты <> Неопределено Тогда
			КолонкиВзаиморасчеты[ИмяКолонкиСделка].Видимость = Ложь;
			КолонкиВзаиморасчеты[ИмяКолонкиСделка].АвтоотметкаНеЗаполненного = Ложь;
		КонецЕсли;
		
		Если КолонкиБланки <> Неопределено Тогда
			КолонкиБланки[ИмяКолонкиЗаказ].АвтоотметкаНеЗаполненного = Ложь;
		КонецЕсли;

		АвтоОтметка = Истина;
	    Если ДокументВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
			Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
				Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
					АвтоОтметка = Ложь;
				ИначеЕсли ВидОперации = "РеализацияСчет"
					И ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					АвтоОтметка = Ложь;
				КонецЕсли;
			Иначе
				АвтоОтметка = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если ЭУЗаказ.АвтоотметкаНеЗаполненного <> АвтоОтметка Тогда
			ЭУЗаказ.АвтоотметкаНеЗаполненного = АвтоОтметка;
		КонецЕсли;

		Если ЭУЗаказ.ОтметкаНеЗаполненного <> АвтоОтметка И НЕ ЗначениеЗаполнено(ЭУЗаказ.Значение) Тогда
			ЭУЗаказ.ОтметкаНеЗаполненного = АвтоОтметка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьКолонкиЗаказ()

// Процедура устанавливает видимость реквизита проект в зависимости от учетной политики
//
//		Параметры:
//
//
Процедура УстановитьВидимостьПроекта(ДокументОбъект = Неопределено, ЭлементыФормы, Знач Реквизиты, ДокументУчетаЗатрат = Ложь) Экспорт
	
	Если ПустаяСтрока(Реквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВедениеУчетаПоПроектам = УправлениеПроектами.ВедениеУчетаПоПроектам();
	
	Если ДокументУчетаЗатрат И ВедениеУчетаПоПроектам И УправлениеПроектами.ВедениеУчетаЗатратПоПроектам() Тогда
		
		Возврат;
	
	ИначеЕсли Не ДокументУчетаЗатрат И ВедениеУчетаПоПроектам Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Реквизиты = СтрЗаменить(Реквизиты, ",", Символы.ПС);
	
	Для Индекс = 1 По СтрЧислоСтрок(Реквизиты) Цикл
		
		ИмяРеквизита = СтрПолучитьСтроку(Реквизиты, Индекс);
		
		Если Найти(ИмяРеквизита, ".") > 0 Тогда
			
			ИмяРеквизита = СтрЗаменить(ИмяРеквизита, ".", Символы.ПС);
			ИмяТабличногоПоля = СтрПолучитьСтроку(ИмяРеквизита, 1);
			ИмяКолонки = СтрПолучитьСтроку(ИмяРеквизита, 2);
			
			ЭлементыФормы[ИмяТабличногоПоля].Колонки[ИмяКолонки].Видимость = Ложь;
			ЭлементыФормы[ИмяТабличногоПоля].Колонки[ИмяКолонки].ИзменятьВидимость = Ложь;
			
		Иначе
			
			ЭлементыФормы[ИмяРеквизита].Видимость = Ложь;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // УстановитьВидимостьПроекта()

// Устанавливает видимость закладки "Возвратная тара" в форме документа
//
// Параметры:
//  ФормаДокумента - форма документа.
//
Процедура УстановитьВидимостьЗакладкиВозвратнаяТара(ФормаДокумента) Экспорт

	ИспользоватьВозвратнуюТару = ?(ФормаДокумента.ВозвратнаяТара.Количество() = 0, Константы.ИспользоватьВозвратнуюТару.Получить(), Истина);

	СтраницыПанели                  = ФормаДокумента.ЭлементыФормы.ОсновнаяПанель.Страницы;
	СтраницыПанели.Тара.Видимость   = ИспользоватьВозвратнуюТару;
	СтраницыПанели.Тара.Доступность = ИспользоватьВозвратнуюТару;

КонецПроцедуры // УстановитьВидимостьЗакладкиВозвратнаяТара()

// Процедура в зависимости от вида поступления устанавливает тип для реквизита "СкладОрдер"
//
// Параметры:
//  ДокументОбъект - объект документа,
//  ЭлементыФормы  - элементы формы,
//  ВидОперации    - строка, определяет вид операции,возможнве значения "Поступление", "Возврат",
//                   по умолчанию "Поступление".
//
Процедура УстановитьТипСкладаОрдера(ДокументОбъект, ЭлементыФормы, ВидОперации = "Поступление") Экспорт

	Если ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад Тогда
		Если ТипЗнч(ДокументОбъект.СкладОрдер)<>Тип("СправочникСсылка.Склады") Тогда
			ДокументОбъект.СкладОрдер = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;

		ТекстПодсказки = "В этом поле необходимо указать склад";

		Если      ВидОперации = "Поступление" Тогда
			ТекстПодсказки = ТекстПодсказки + ", на который необходимо оформить поступление товаров"
		ИначеЕсли ВидОперации = "Возврат"     Тогда
			ТекстПодсказки = ТекстПодсказки + ", на который оформляется возврат товаров"
		КонецЕсли;

		ЭлементыФормы.СкладОрдер.Подсказка = ТекстПодсказки + ".";
	Иначе
		Если ТипЗнч(ДокументОбъект.СкладОрдер)<>Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			ДокументОбъект.СкладОрдер = Документы.ПриходныйОрдерНаТовары.ПустаяСсылка();
		КонецЕсли;

		ЭлементыФормы.СкладОрдер.Подсказка = "В этом поле необходимо указать приходный ордер, по которому ранее было оформлено поступление товаров.";
	КонецЕсли;

КонецПроцедуры // УстановитьТипСкладаОрдера()

Процедура ВакансияПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки.Закрыта Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Серый;
	КонецЕсли;
	
	Если Не ДанныеСтроки.Закрыта И ЗначениеЗаполнено(ДанныеСтроки.ПлановаяДатаЗакрытия) И ДанныеСтроки.ПлановаяДатаЗакрытия < ОбщегоНазначения.ПолучитьРабочуюДату() Тогда
		ОформлениеСтроки.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ГПУ ПРЕДСТАВЛЕНИЯ ДАННЫХ

// Процедура формирует и выводит текст в информационной надписи о величине долга контрагента.
//
// Параметры:
//  ДоговорКонтрагента    - ссылка на справочник, определяет договор контрагента; 
//  Сделка                   - ссылка на документ или Неопределено, определяет сделку; 
//  ЭлементФормыНадписьДолга - элемент формы, содержащий надпись долга;
//  СсылкаДокумент           - ссылка на документ, из которого вызывается процедура.
//  МожноНеРассчитывать      - если можно не рассчитывать долг, а в дополнительных правах "Рассчитывать долг при открытии форм" = ложь,
//                             то величина долга рассчитываться не будет
//
Процедура СформироватьНадписьДолга(ДоговорКонтрагента, Сделка, ЭлементФормыНадписьДолга, 
	                                 СсылкаДокумент = Неопределено, МожноНеРассчитывать = Ложь) Экспорт

	Если МожноНеРассчитывать Тогда
		Если НЕ УправлениеДопПравамиПользователей.РассчитыватьДолгПриОткрытииФорм() Тогда
			ЭлементФормыНадписьДолга.Заголовок = ПолучитьТекстДолга(ДоговорКонтрагента, Неопределено);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Попытка
			СуммаДолга = УправлениеВзаиморасчетами.ТекущийДолг(ДоговорКонтрагента, Сделка, СсылкаДокумент);

			ТекстДолга = ПолучитьТекстДолга(ДоговорКонтрагента, СуммаДолга);

			Если СуммаДолга > 0 Тогда // Долг контрагента, покрасим текст в особый цвет
				ЭлементФормыНадписьДолга.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
			Иначе
				ЭлементФормыНадписьДолга.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
			КонецЕсли; 
		Исключение
			ТекстДолга = "Нет доступа к информации по взаиморасчетам";
			ЭлементФормыНадписьДолга.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
		КонецПопытки;	

		ЭлементФормыНадписьДолга.Заголовок = ТекстДолга;
	Иначе
		ЭлементФормыНадписьДолга.Заголовок = "";
	КонецЕсли; 

КонецПроцедуры // СформироватьНадписьДолга()

// Процедура проверяет принадлежность реквизита типа ПодразделениеОрганизации
// выбранной организации.
//
// Параметры:
//  ДокументОбъект - объект документ, в форме которого произошло событие
//  ТекПользователь - текущий пользователь, настройки которого используются
//                 по умолчанию
//  НазваниеРеквизитаСубконто - название проверяемого реквизита
//  Субконто     - значение проверяемого реквизита
//
Процедура ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, НазваниеРеквизитаСубконто, Субконто)
	
	Если ТипЗнч(Субконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		ПодразделениеПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделениеОрганизации");
		
		// Если субконто не заполнено.
		Если НЕ ЗначениеЗаполнено(Субконто) Тогда
			
			// Если субконто сооответствует выбранной организации, подставляем его.
			Если ПодразделениеПоУмолчанию.Владелец = Организация Тогда
				ДокументОбъект[НазваниеРеквизитаСубконто] = ПодразделениеПоУмолчанию;
			КонецЕсли;
			
		Иначе // Если ПодразделениеОрганизации заполнено.
			
			// Если ПодразделениеОрганизации не соответствует выбранной организации.
			Если НЕ Субконто.Владелец = Организация Тогда
				
				// Если ПодразделениеПоУмолчанию сооответствует выбранной организации, подставляем его.
				Если ПодразделениеПоУмолчанию.Владелец = Организация Тогда
					ДокументОбъект[НазваниеРеквизитаСубконто] = ПодразделениеПоУмолчанию;
				Иначе // Выбрана не основная организация. ПодразделениеОрганизации нужно очистить.
					ДокументОбъект[НазваниеРеквизитаСубконто] = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
					ОбщегоНазначения.СообщитьОбОшибке("Значение в поле ""Подразделение"" не соответствует выбранной организации и было очищено.");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   // ПроверитьСубконтоПодразделение()

// Процедура - обработчик события ПриИзменении поля ввода Организация
//
// Параметры:
//	ДокументОбъект - объект документ в форме которого произошло событие
//  ТекПользователь - текущий пользователь, настройки которого используются
//                 по умолчанию
//  СтруктураРеквизитов - структура с названиеями и значениями реквизитов, 
//                 кот.необходимо проверить
//
Процедура ПроверитьВладельцаСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов) Экспорт

	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ1") И СтруктураРеквизитов.Свойство("СубконтоБУ1") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ1, СтруктураРеквизитов.СубконтоБУ1);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ2") И СтруктураРеквизитов.Свойство("СубконтоБУ2") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ2, СтруктураРеквизитов.СубконтоБУ2);
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("НазваниеСубконтоБУ3") И СтруктураРеквизитов.Свойство("СубконтоБУ3") Тогда
		ПроверитьСубконтоПодразделение(ДокументОбъект, ТекПользователь, Организация, СтруктураРеквизитов.НазваниеСубконтоБУ3, СтруктураРеквизитов.СубконтоБУ3);
	КонецЕсли;
	
	 
КонецПроцедуры  // ПроверитьВладельцаПодразделения()

Процедура ОбработатьЗакрытиеФормы(Отказ, СтандартнаяОбработка, ФормаОбъекта) Экспорт

	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	
	Если ФормаОбъекта.Модифицированность Тогда
		Ответ = ЗадатьВопрос("Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да Или Ответ = КодВозвратаДиалога.Таймаут Тогда
			//Запишем документ
			Попытка
				Отказ = Не ФормаОбъекта.ЗаписатьВФорме();
			Исключение
				ВывестиПредупреждение("Операция не выполнена!");
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	ФормаОбъекта.ЭлементыФормы.ПанельОткрытьИсходный.Свертка = РежимСверткиЭлементаУправления.Нет;
	ФормаОбъекта.ЭлементыФормы.ПанельОткрытьИсправление.Свертка = РежимСверткиЭлементаУправления.Нет;

КонецПроцедуры

// Формирует текст о долге контрагента для вывода его в форме документа
//
// Параметры: 
//  ДоговорКонтрагента - ссылка на элемент справочника, определяет договор контрагента
//  Долг                  - число, сумма долга.
//
// Возвращаемое значение:
//  Строка, сформированный текст про долг контрагента.
//
Функция ПолучитьТекстДолга(ДоговорКонтрагента, Знач Долг)

	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат "Введена не вся информация для расчета долга.";
	КонецЕсли;

	ТекстПодписи = ?(ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом,
	               "По договору","По сделке");

	Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		ТекстПодписи = ТекстПодписи + " """ + Нрег(ДоговорКонтрагента.ВидДоговора) + """";
	Иначе
		ТекстПодписи = ТекстПодписи + " " + Нрег(ДоговорКонтрагента.ВидДоговора);
	КонецЕсли;

	Если Долг = Неопределено Тогда
		ТекстПодписи = ТекстПодписи + " долг не рассчитан";

	ИначеЕсли Долг = 0 Тогда
		ТекстПодписи = ТекстПодписи + " нет долга";

	Иначе
		Если Долг > 0 Тогда
			ТекстПодписи = ТекстПодписи + " долг контрагента";
		Иначе
			ТекстПодписи = ТекстПодписи + " долг компании";
			Долг = (-1) * Долг;
		КонецЕсли;

		ТекстПодписи = ТекстПодписи + " " +
		               ОбщегоНазначения.ФорматСумм(Долг, ДоговорКонтрагента.ВалютаВзаиморасчетов);

	КонецЕсли;

	Возврат ТекстПодписи;

КонецФункции // ПолучитьТекстДолга()

// Процедура удаляет кнопку "Права" из командной панели формы
//
// Параметры
//  Кнопки  – <КнопкиКоманднойПанели> – <описание параметра>
//
Процедура УдалитьКнопкуПрава(Кнопки) Экспорт

	Если Кнопки.Найти("Права") <> Неопределено Тогда
		Если НЕ ПараметрыСеанса.ИспользоватьОграниченияПравДоступаНаУровнеЗаписей 
			ИЛИ НЕ УправлениеДопПравамиПользователей.ЕстьПравоАдминистрированияПользователей() Тогда
			
			Кнопки.Удалить(Кнопки.Права);
			Кнопки.Удалить(Кнопки.РазделительПрава);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры // УдалитьКнопкуПрава()

//настройка подменю Клиент-Банк
Процедура УстановкаПодменюКлиентБанк(Кнопка, Объект) Экспорт

	Если Объект.РеквизитыКонтрагента.Количество() = 0 Тогда
		Кнопка.Доступность =Ложь;
	Иначе
		Кнопка.Доступность =Истина;
	КонецЕсли; 

КонецПроцедуры // УстановкаПодменюКлиентБанк()

// Возвращает массив документов из оформления строк табличного поля,
// если видна хотя бы одна из колонок
Функция ПолучитьМассивДокументов(ОформленияСтрок, КоллекцияКолонокТабличногоПоля, СтруктураКолонок, ИмяРеквизита) Экспорт

	МассивДокументов = Новый Массив;
	
	ЗаполнитьМассив = Ложь;
	Для каждого Свойство Из СтруктураКолонок Цикл
		Если КоллекцияКолонокТабличногоПоля[Свойство.Ключ].Видимость Тогда
			ЗаполнитьМассив = Истина;
			Прервать
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ЗаполнитьМассив Тогда
		Возврат МассивДокументов;
	КонецЕсли; 
	
	Для каждого Строка Из ОформленияСтрок Цикл
		ДанныеСтроки = Строка.ДанныеСтроки;
		Если НЕ ДанныеСтроки[ИмяРеквизита].Пустая() Тогда
			МассивДокументов.Добавить(ДанныеСтроки[ИмяРеквизита]);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивДокументов;
	
КонецФункции // ПолучитьМассивДокументов()

// Процедура выполняет запись и проведение документа
//
// Параметры
//  <форма>         – <форма>  – <форма документа которую необходимо записать>
//  <НеПроведен>    - <Булево> - ссылочный параметр, признак успешного проведения текущей процедурой документа
//  <Предупреждать> - <Булево> - выводить предупреждение в случае неудачного проведения документа
//
Процедура ПровестиДокументВФормеОперативно(форма, НеПроведен = Ложь, Предупреждать = Истина) Экспорт

	РежимДокумента = форма.ИспользоватьРежимПроведения;
	форма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Оперативный;
	Попытка
		форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
	Исключение
		НеПроведен = Истина;
		Если Предупреждать Тогда
			Предупреждение("Операция не выполнена!");
		КонецЕсли;
	КонецПопытки;
	форма.ИспользоватьРежимПроведения = РежимДокумента;

КонецПроцедуры // ПровестиДокументВФормеОперативно()

// Проверяет модифицированность документа перед заполнением на основании
// 
// Параметры
//  Документ - проверяемый документ основания
//
Функция ПроверитьМодифицированностьДокументаОснования(Документ) Экспорт

	Результат = Ложь;

	Если ЗначениеЗаполнено(Документ) Тогда

		ФормаДокумента = Документ.ПолучитьФорму();

		Если ФормаДокумента.Модифицированность() Тогда
			ОчиститьСообщения();
			ОбщегоНазначения.СообщитьОбОшибке("Документ " + СокрЛП(Документ) + " был изменен! Сначала следует записать документ!");
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПроверитьМодифицированностьДокументаОснования()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ПЛАНОВОЙ СЕБЕСТОИМОСТЬЮ

// Процедура выполняет стандартные действия при изменении режима использования плановой себестоимости
//
// Параметры:
//  ДокументОбъект                   - объект редактируемого документа
//  ФормаДокумента                   - форма редактируемого документа
//  ВалютаРегламентированногоУчета   - валюта регламентированного учета
//  СтароеЗначениеРежимаИспользовать - предыдущее значение режима использования плановой себестоимости
//
Процедура ИзмененитьРежимИспользованияПлановойСебестоимости(ДокументОбъект, ФормаДокумента, ВалютаРегламентированногоУчета, СтароеЗначениеРежимаИспользовать = Неопределено) Экспорт

	Колонки = ФормаДокумента.ЭлементыФормы.Товары.Колонки;
	Надпись = ФормаДокумента.ЭлементыФормы.ИнфНадписьИтоговоеОтклонениеОтПлановойСебестоимости;

	Если ДокументОбъект.ИспользоватьПлановуюСебестоимость Тогда

		Если СтароеЗначениеРежимаИспользовать = Ложь Тогда

			// Пользователь изменил режим с "не использовать" на "использовать".
			// Заполним плановую себестоимость во всех строках документа.
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокахТабЧасти(ДокументОбъект, ВалютаРегламентированногоУчета);
		КонецЕсли;

		// Устанавливаем режим видимости колонок и надписи.
		Колонки.ПлановаяСебестоимость.Видимость                         = Истина;
		Колонки.СуммаПлановойСебестоимости.Видимость                    = Истина;
		Колонки.СуммаОтклоненияОтСуммыПлановойСебестоимости.Видимость   = Истина;
		Колонки.ПроцентОтклоненияОтСуммыПлановойСебестоимости.Видимость = Истина;

		Надпись.Видимость	= Истина;
	Иначе

		// Устанавливаем режим видимости колонок и надписи.
		Колонки.ПлановаяСебестоимость.Видимость                         = Ложь;
		Колонки.СуммаПлановойСебестоимости.Видимость                    = Ложь;
		Колонки.СуммаОтклоненияОтСуммыПлановойСебестоимости.Видимость   = Ложь;
		Колонки.ПроцентОтклоненияОтСуммыПлановойСебестоимости.Видимость = Ложь;

		Надпись.Видимость	= Ложь;
	КонецЕсли;

КонецПроцедуры // ИзмененитьРежимИспользованияПлановойСебестоимости()

// Процедура формирует и выводит текст в информационной надписи об итоговом отклонение 
// от плановой себестоимости.
//
// Параметры:
//  ЭлементФормыНадписьОтклонение - элемент формы, содержащий надпись итогового отклонения;
//  ДокументОбъект                - ссылка на документ, из которого вызывается процедура.
//
Процедура СформироватьНадписьИтоговоеОтклонениеОтПлановойСебестоимости(ЭлементФормыНадписьОтклонение, ДокументОбъект) Экспорт

	Перем ПроцентОтклоненияОтПлановойСебестоимости;

	Если Не ДокументОбъект.ИспользоватьПлановуюСебестоимость Тогда

		// Не выполняем никаких действий, если плановая себестоимость в документе не учитывается.
		Возврат;
	КонецЕсли;

	ИтоговоеОтклонение = Ценообразование.ПолучитьИтоговоеОтклонениеОтПлановойСебестоимости(ДокументОбъект, ПроцентОтклоненияОтПлановойСебестоимости);

	Если ИтоговоеОтклонение = Неопределено Тогда

		// Если итоговая отклонение неопределено, 
		// информация об отклонении не показываем.
		ЭлементФормыНадписьОтклонение.Заголовок = "";
	Иначе
		
		// Если итоговое отклонение определено, показываем.
		ЭлементФормыНадписьОтклонение.Заголовок = "Отклонение от плановой себестоимости: "
		                                          + ОбщегоНазначения.ФорматСумм(ИтоговоеОтклонение,
		                                                         ДокументОбъект.ВалютаДокумента, "0,00");

		Если ПроцентОтклоненияОтПлановойСебестоимости <> Неопределено Тогда
			ЭлементФормыНадписьОтклонение.Заголовок = ЭлементФормыНадписьОтклонение.Заголовок
			                                          + " (" 
			                                          + ОбщегоНазначения.ФорматСумм(ПроцентОтклоненияОтПлановойСебестоимости, , 
			                                                         "0,00") + "%).";
		КонецЕсли;

		// Отрицательное отклонение выделяем красным цветом.
		Если ИтоговоеОтклонение < 0 Тогда
			ЭлементФормыНадписьОтклонение.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
		Иначе
			ЭлементФормыНадписьОтклонение.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // СформироватьНадписьИтоговоеОтклонениеОтПлановойСебестоимости()

// Процедура добавляет информацию о коде и/или артикуле в ячейки табличного поля
// при выводе очередной строки
//
// Параметры:
//  КолонкиТабПоля - коллекция колонок табличного поля
//  ЯчейкиСтрокиТабПоля - коллекция ячеек строки табличного поля
//  Номенклатура - СправочникСсылка.Номенклатура, товар, по которому надо вывести код и/или артикул
//
Процедура ПоказатьКодАртикул(КолонкиТабПоля, ЯчейкиСтрокиТабПоля, Номенклатура) Экспорт

	Если КолонкиТабПоля.Код.Видимость Тогда
		Если Номенклатура <> Неопределено Тогда
			ЯчейкиСтрокиТабПоля.Код.УстановитьТекст(Номенклатура.Код);
		Иначе
			ЯчейкиСтрокиТабПоля.Код.УстановитьТекст("");
		КонецЕсли;
	КонецЕсли;

	Если КолонкиТабПоля.Артикул.Видимость Тогда
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЯчейкиСтрокиТабПоля.Артикул.УстановитьТекст(Номенклатура.Артикул);
		Иначе
			ЯчейкиСтрокиТабПоля.Артикул.УстановитьТекст("");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПоказатьКодАртикул()

// Процедура добавляет информацию о сумме без скидок в ячейки табличного поля
// при выводе очередной строки
//
// Параметры:
//  КолонкиТабПоля      - коллекция колонок табличного поля,
//  ЯчейкиСтрокиТабПоля - коллекция ячеек строки табличного поля,
//  Цена                - число, цена номенклатуры в строке,
//  Количество          - число, количество номенклатуры в строке.
//
Процедура ПоказатьСуммуБезСкидок(КолонкиТабПоля, ЯчейкиСтрокиТабПоля, Цена, Количество) Экспорт

	Если КолонкиТабПоля.СуммаБезСкидок.Видимость Тогда

		Сумма = ОбщегоНазначения.ФорматСумм(Цена * Количество);
		ЯчейкиСтрокиТабПоля.СуммаБезСкидок.Выравнивание = ГоризонтальноеПоложение.Право;
		ЯчейкиСтрокиТабПоля.СуммаБезСкидок.УстановитьТекст(Сумма);

	КонецЕсли;

КонецПроцедуры // ПоказатьСуммуБезСкидок()

// Процедура добавляет информацию о коэффициенте мест в ячеки табличного поля
// при выводе очередной строки
//
// Параметры:
//  КолонкиТабПоля - коллекция колонок табличного поля
//  ЯчейкиСтрокиТабПоля - коллекция ячеек строки табличного поля
//  ЕдиницаИзмерения - СправочникСсылка.ЕдиницаИзмерения, единица измерения по которой надо коэффициент мест
//
Процедура ПоказатьКоэффициентМест(КолонкиТабПоля, ЯчейкиСтрокиТабПоля, ЕдиницаИзмерения) Экспорт

	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЯчейкиСтрокиТабПоля.КоличествоМест.ТолькоПросмотр = Истина;
	Иначе
		ЯчейкиСтрокиТабПоля.КоличествоМест.ТолькоПросмотр = Ложь;

		Если КолонкиТабПоля.КоэффициентМест.Видимость Тогда
			Коэффициент = ЕдиницаИзмерения.Коэффициент;

			Если Коэффициент > 0 Тогда
				ЯчейкиСтрокиТабПоля.КоэффициентМест.УстановитьТекст(Формат(Коэффициент, "ЧЦ=10; ЧДЦ=3"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПоказатьКоэффициентМест()

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Печатает составы по указанной номенклатуре.
//
// Параметры:
//  МассивНоменклатуры - массив, содержащий номенклатуру, для которой печатается состав
//
// Возвращаемое значение:
//  Сформированный табличный документ.
//
Функция НапечататьКомплектующие(МассивНоменклатуры) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура                  КАК Номенклатура,
	|	ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|	Комплектующая                 КАК Комплектующая,
	|	ХарактеристикаКомплектующей   КАК ХарактеристикаКомплектующей,
	|	Количество                    КАК Количество,
	|	ЕдиницаИзмерения              КАК ЕдиницаИзмерения,
	|	ДоляСтоимости                 КАК ДоляСтоимости
	|ИЗ
	|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|
	|ГДЕ
	|	Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = ПолучитьОбщийМакет("СписокКомплектующих");

	ТабДокумент = Новый ТабличныйДокумент;
	
	Пока Выборка.СледующийПоЗначениюПоля("Номенклатура") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("ХарактеристикаНоменклатуры") Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+?(Выборка.Номенклатура.Набор, "|Набор", ""));
			ОбластьМакета.Параметры.Заполнить(Выборка);
			НомерСтроки = 1;
			Если Выборка.Номенклатура.Набор Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "Состав набора """+СокрЛП(Выборка.Номенклатура)+"""";
			Иначе
				ОбластьМакета.Параметры.ТекстЗаголовка = "Состав комплекта """+СокрЛП(Выборка.Номенклатура)+"""";
				Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
					ОбластьМакета.Параметры.ТекстЗаголовка = ОбластьМакета.Параметры.ТекстЗаголовка + " ("+СокрЛП(Выборка.ХарактеристикаНоменклатуры)+")";
				КонецЕсли;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+?(Выборка.Номенклатура.Набор, "|Набор", ""));
			ТабДокумент.Вывести(ОбластьМакета);
			Пока Выборка.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+?(Выборка.Номенклатура.Набор, "|Набор", ""));
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабДокумент.Вывести(ОбластьМакета);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал"+?(Выборка.Номенклатура.Набор, "|Набор", ""));
			ТабДокумент.Вывести(ОбластьМакета);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции // НапечататьКомплектующие()

// Процедура устанавливает видимость реквизитов в зависимости от типа учета
//
//		Параметры:
//
//
Процедура ВидимостьРеквизитовПоТипуУчета(ДокументОбъект, ФормаДокумента, Знач РеквизитыУпрУчета, Знач РеквизитыБухУчета, Знач РеквизитыМеждУчета = "") Экспорт

	СтрРеквУпр = СтрЗаменить(РеквизитыУпрУчета, " ", "");
	СтрРеквУпр = СтрЗаменить(СтрРеквУпр, Символы.ПС,  "");
	СтрРеквУпр = СтрЗаменить(СтрРеквУпр, Символы.Таб, "");
	
	Пока Не ПустаяСтрока(СтрРеквУпр) Цикл
		
		Поз = Найти(СтрРеквУпр, ",");
		Если Поз = 0 Тогда
			ИмяРекв    = СтрРеквУпр;
			СтрРеквУпр = "";
		Иначе
			ИмяРекв    = Лев (СтрРеквУпр, Поз - 1);
			СтрРеквУпр = Сред(СтрРеквУпр, Поз + 1);
		КонецЕсли;
		Если ПустаяСтрока(ИмяРекв) Тогда
			Продолжить;
		КонецЕсли;
		
		Поз = Найти(ИмяРекв, ".");
		Если Поз = 0 Тогда
			ФормаДокумента.ЭлементыФормы[ИмяРекв].Видимость = ДокументОбъект.ОтражатьВУправленческомУчете;
		Иначе
			ФормаДокумента.ЭлементыФормы[Лев(ИмяРекв, Поз - 1)].Колонки[Сред(ИмяРекв, Поз + 1)].Видимость = ДокументОбъект.ОтражатьВУправленческомУчете;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрРеквБух = СтрЗаменить(РеквизитыБухУчета, " ", "");
	СтрРеквБух = СтрЗаменить(СтрРеквБух, Символы.ПС,  "");
	СтрРеквБух = СтрЗаменить(СтрРеквБух, Символы.Таб, "");
	Пока Не ПустаяСтрока(СтрРеквБух) Цикл
		
		Поз = Найти(СтрРеквБух, ",");
		Если Поз = 0 Тогда
			ИмяРекв    = СтрРеквБух;
			СтрРеквБух = "";
		Иначе
			ИмяРекв    = Лев (СтрРеквБух, Поз - 1);
			СтрРеквБух = Сред(СтрРеквБух, Поз + 1);
		КонецЕсли;
		Если ПустаяСтрока(ИмяРекв) Тогда
			Продолжить;
		КонецЕсли;
		
		Поз = Найти(ИмяРекв, ".");
		Если Поз = 0 Тогда
			ФормаДокумента.ЭлементыФормы[ИмяРекв].Видимость = ДокументОбъект.ОтражатьВБухгалтерскомУчете;
		Иначе
			ФормаДокумента.ЭлементыФормы[Лев(ИмяРекв, Поз - 1)].Колонки[Сред(ИмяРекв, Поз + 1)].Видимость = ДокументОбъект.ОтражатьВБухгалтерскомУчете;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрРеквМежд = СтрЗаменить(РеквизитыМеждУчета, " ", "");
	СтрРеквМежд = СтрЗаменить(СтрРеквМежд, Символы.ПС,  "");
	СтрРеквМежд = СтрЗаменить(СтрРеквМежд, Символы.Таб, "");
	
	Пока Не ПустаяСтрока(СтрРеквМежд) Цикл
		
		Поз = Найти(СтрРеквМежд, ",");
		Если Поз = 0 Тогда
			ИмяРекв    = СтрРеквМежд;
			СтрРеквМежд = "";
		Иначе
			ИмяРекв    = Лев (СтрРеквМежд, Поз - 1);
			СтрРеквМежд = Сред(СтрРеквМежд, Поз + 1);
		КонецЕсли;
		Если ПустаяСтрока(ИмяРекв) Тогда
			Продолжить;
		КонецЕсли;
		
		Поз = Найти(ИмяРекв, ".");
		Если Поз = 0 Тогда
			ФормаДокумента.ЭлементыФормы[ИмяРекв].Видимость = ДокументОбъект.ОтражатьВМеждународномУчете;
		Иначе
			ФормаДокумента.ЭлементыФормы[Лев(ИмяРекв, Поз - 1)].Колонки[Сред(ИмяРекв, Поз + 1)].Видимость = ДокументОбъект.ОтражатьВМеждународномУчете;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВидимостьРеквизитовПоТипуУчета()

// в кадровых документах кнопка вызова Анализа неявок показывается не всем
Процедура УстановитьВидимостьКнопкиОткрытьНачисления(КоллекцияКнопок, ИмяКнопки) Экспорт

	Если Не ПравоДоступа("Использование",Метаданные.Обработки.АнализНеявок) Тогда
		УдаляемаяКнопка = КоллекцияКнопок.Найти(ИмяКнопки);
		Если УдаляемаяКнопка <> Неопределено Тогда
			КоллекцияКнопок.Удалить(УдаляемаяКнопка)
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура открывает форму выбора документа и устанавливает отбор
//	Параметры:
//		ФормаДокумента  - форма редактируемого документа;
//		ЭлементФормы    - элемент формы документа, который надо заполнить;
//		СписокТипов     - список типов документов (необязательный);
//		СтруктураОтбора - структура отбора, который надо установить при открытии формы.
//		                  либо таблица значений с параметрами отбора. Структура таблицы значений формируется функцией СоздатьТаблицуДляОтбора()
//
Процедура ОткрытьФормуДокументаСОтбором(ФормаДокумента, ЭлементФормы, СписокТипов = Неопределено, СтруктураОтбора) Экспорт

	Если СписокТипов = Неопределено Тогда
		
		ИмяДокумента = ЭлементФормы.Значение.Метаданные().Имя; // считаем, что в этом случае составного типа не будет.
	Иначе

		// Пользователь выбирает тип документа
		Если СписокТипов.Количество() = 1 Тогда
			ВыбранныйЭлемент = СписокТипов[0];
		Иначе
			ВыбранныйЭлемент = ФормаДокумента.ВыбратьИзСписка(СписокТипов, ЭлементФормы);
		КонецЕсли;

		Если ВыбранныйЭлемент = Неопределено Тогда
			Возврат; // пользователь отказался от выбора
		КонецЕсли;

		ИмяДокумента = ВыбранныйЭлемент.Значение;

	КонецЕсли;

	ФормаВыбора = Документы[ИмяДокумента].ПолучитьФормуВыбора(,ЭлементФормы,);

	// Отфильруем список документов.
	Если ТипЗнч(СтруктураОтбора) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекОтбор Из СтруктураОтбора Цикл
			ФормаВыбора.Отбор[ТекОтбор.Имя].ВидСравнения  = ТекОтбор.ВидСравнения;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Значение      = ТекОтбор.Значение;
			ФормаВыбора.Отбор[ТекОтбор.Имя].Использование = Истина;
			Если ТекОтбор.НеИзменять Тогда
				ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора[ТекОтбор.Имя].Доступность = НЕ ТекОтбор.НеИзменять;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("СписокЗначений") Тогда
				ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].ВидСравнения = ВидСравнения.ВСписке;
			КонецЕсли;
			ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Значение      = ЭлементСтруктуры.Значение;
			ФормаВыбора.Отбор[ЭлементСтруктуры.Ключ].Использование = Истина;
			ФормаВыбора.ЭлементыФормы.ДокументСписок.НастройкаОтбора[ЭлементСтруктуры.Ключ].Доступность = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	Сделка            = ЭлементФормы.Значение;
	ЕстьДоговор       = (ФормаДокумента.ДокументОбъект.Метаданные().Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено);
	ЕстьДоговорСделки = ?(НЕ ЗначениеЗаполнено(Сделка),          Ложь, Сделка.Метаданные().Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено);
	Если ЕстьДоговор И ЕстьДоговорСделки Тогда
		Если Сделка.ДоговорКонтрагента = ФормаДокумента.ДокументОбъект.ДоговорКонтрагента Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = Сделка;
		КонецЕсли;
	КонецЕсли;

	ФормаВыбора.Открыть();

КонецПроцедуры // ОткрытьФормуДокументаСОтбором()

// Процедура - установка вида поступления/передачи
//
// Параметры:
//  ДокументОбъект - объект документа, для которого надо проверить вид поступления / вид передачи.
//  ФормаДокумента - форма документа, для которого надо проверить вид поступления / вид передачи.
//
Процедура ПроверитьВидПоступленияПередачи(ДокументОбъект, ФормаДокумента) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если НЕ ДокументОбъект.ОтражатьВУправленческомУчете Тогда
		Если МетаданныеДокумента.Реквизиты.Найти("ВидПоступления") <> Неопределено Тогда
			Если ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру Тогда
				ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
				Если МетаданныеДокумента.Реквизиты.Найти("СкладОрдер") <> Неопределено Тогда
					ДокументОбъект.СкладОрдер = Справочники.Склады.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			ФормаДокумента.ЭлементыФормы.ВидПоступления.ТолькоПросмотр = Истина;
			ФормаДокумента.ЭлементыФормы.ВидПоступления.КнопкаВыбора = Ложь;
			ФормаДокумента.ЭлементыФормы.ВидПоступления.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВидПередачи") <> Неопределено Тогда
			Если ДокументОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.ПоОрдеру Тогда
				ДокументОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
			КонецЕсли;
			ФормаДокумента.ЭлементыФормы.ВидПередачи.ТолькоПросмотр = Истина;
			ФормаДокумента.ЭлементыФормы.ВидПередачи.КнопкаВыбора = Ложь;
			ФормаДокумента.ЭлементыФормы.ВидПередачи.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
		КонецЕсли;
	Иначе
		Если МетаданныеДокумента.Реквизиты.Найти("ВидПоступления") <> Неопределено Тогда
			ФормаДокумента.ЭлементыФормы.ВидПоступления.ТолькоПросмотр = Ложь;
			ФормаДокумента.ЭлементыФормы.ВидПоступления.КнопкаВыбора = Истина;
			ФормаДокумента.ЭлементыФормы.ВидПоступления.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
		ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("ВидПередачи") <> Неопределено Тогда
			ФормаДокумента.ЭлементыФормы.ВидПередачи.ТолькоПросмотр = Ложь;
			ФормаДокумента.ЭлементыФормы.ВидПередачи.КнопкаВыбора = Истина;
			ФормаДокумента.ЭлементыФормы.ВидПередачи.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 1);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверитьВидПоступленияПередачи()

// Процедура устанавливает видимость колонок суммы таб. части
//
Процедура УстановитьПараметрыКолонокСуммы( ФормаТабЧасть, УпрУчет, БухУчет) Экспорт
	
	ФормаТабЧасть.Колонки.Сумма    .Видимость = УпрУчет;
	ФормаТабЧасть.Колонки.СуммаРегл.Видимость = БухУчет;
	ФормаТабЧасть.Колонки.Сумма    .ИзменятьВидимость = Ложь;
	ФормаТабЧасть.Колонки.СуммаРегл.ИзменятьВидимость = Ложь;
	
	Если УпрУчет Тогда
		ФормаТабЧасть.Колонки.Цена.ТекстШапки = "Цена";
	ИначеЕсли БухУчет Тогда
		ФормаТабЧасть.Колонки.Цена.ТекстШапки = "Цена (регл.)";
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрыКолонокСуммы()

// Функция устанавливает цены в колонке Цена в зависимости от типа учета
//
Процедура УстановитьЦеныПоТипуУчета(ТабЧасть, УпрУчет, Спрашивать = Истина) Экспорт
	
	ВалютаБух = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	Если ВалютаУпр = ВалютаБух ИЛИ ТабЧасть.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Спрашивать Тогда
		Если УпрУчет Тогда
			ТекстВопроса = "Пересчитать цены в валюту управленческого учета?"
		Иначе
			ТекстВопроса = "Пересчитать цены в валюту регламентированного учета?"
		КонецЕсли;
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		Если СтрокаТЧ.Количество = 0 Тогда
			СтрокаТЧ.Цена = 0;
		Иначе
			Если УпрУчет Тогда
				СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
			Иначе
				СтрокаТЧ.Цена = СтрокаТЧ.СуммаРегл / СтрокаТЧ.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат;
	
КонецПроцедуры // УстановитьЦеныПоТипуУчета()

// Процедура заполняет список счетами с субконто "Контрагент" и "Договор"
//
Процедура ЗаполнитьСписокСчетамиССубконтоКонтрагентДоговор(СписокСчетов, ИмяПланаСчетов)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПланСчетовЗапроса.Ссылка
	               |ИЗ
	               |	ПланСчетов." + ИмяПланаСчетов + " КАК ПланСчетовЗапроса
	               |ГДЕ
	               |	&СубконтоКонтрагент В
	               |			(ВЫБРАТЬ
	               |				ПланСчетовВидыСубконто.ВидСубконто
	               |			ИЗ
	               |				ПланСчетов." + ИмяПланаСчетов + ".ВидыСубконто КАК ПланСчетовВидыСубконто
	               |			ГДЕ
	               |				ПланСчетовВидыСубконто.Ссылка = ПланСчетовЗапроса.Ссылка)
				   |И
	               |	&СубконтоДоговор В
	               |			(ВЫБРАТЬ
	               |				ПланСчетовВидыСубконто.ВидСубконто
	               |			ИЗ
	               |				ПланСчетов." + ИмяПланаСчетов + ".ВидыСубконто КАК ПланСчетовВидыСубконто
	               |			ГДЕ
	               |				ПланСчетовВидыСубконто.Ссылка = ПланСчетовЗапроса.Ссылка)";
	 
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СубконтоКонтрагент", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Запрос.УстановитьПараметр("СубконтоДоговор", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСчетов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьСписокСчетамиССубконтоКонтрагентДоговор
 
Функция ПолучитьСписокСчетовПоНазначениюСчета(НазначениеСчета, Элемент, ИмяПланаСчетов)
	
	ПланСчетовМенеджер = ПланыСчетов[ИмяПланаСчетов];
	
	СписокСчетов = Новый СписокЗначений;
	
	// СчетаУчетаНоменклатуры
	Если НазначениеСчета = "СчетУчета" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ПроизводственныеЗапасы);
		СписокСчетов.Добавить(ПланСчетовМенеджер.Товары);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ГотоваяПродукция);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ПродукцияСельскохозяйственногоПроизводства);
		СписокСчетов.Добавить(ПланСчетовМенеджер.Полуфабрикаты);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ПриобретениеИзготовлениеОсновныхСредств);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ПриобретениеИзготовлениеДругихНеоборотныхМатериальныхАктивов);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ПриобретениеИзготовлениеНематериальныхАктивов);
		
	ИначеЕсли НазначениеСчета = "СчетУчетаЗабалансовый" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ТоварыПринятыеНаКомиссию);
		Если ИмяПланаСчетов = "Хозрасчетный" Тогда
			СписокСчетов.Добавить(ПланСчетовМенеджер.МатериальныеЦенностиНаОтветственномХранении);
			СписокСчетов.Добавить(ПланСчетовМенеджер.МатериалыПринятыеВПереработку);
		КонецЕсли; 
		
	ИначеЕсли НазначениеСчета = "СчетУчетаПередачи" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ТоварыНаКомиссии);
		СписокСчетов.Добавить(ПланСчетовМенеджер.МатериалыПереданныеВПереработку);
		
	ИначеЕсли НазначениеСчета = "СчетУчетаПередачиЗабалансовый" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ТоварыПринятыеНаКомиссиюНаСубкомиссии);
		Если ИмяПланаСчетов = "Хозрасчетный" Тогда
			СписокСчетов.Добавить(ПланСчетовМенеджер.МатериалыПринятыеВПереработкуВПроизводстве);
		КонецЕсли; 
		
		
	ИначеЕсли НазначениеСчета = "СчетДоходов" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДоходыОтРеализации);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругойОперационныйДоход);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругиеДоходы);
		
	ИначеЕсли НазначениеСчета = "СчетВычетовИзДоходов" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ВычетыИзДохода);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ВычетыИзДоходаОтРозницы);
		
		
	ИначеЕсли НазначениеСчета = "СчетСебестоимость" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.СебестоимостьРеализации);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругиеЗатратыОперационнойДеятельностиГруппа);
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругиеЗатратыДеятельности);
		
		
	ИначеЕсли НазначениеСчета = "СчетУчетаВРознице" Тогда
		
		СписокСчетов.Добавить(ПланСчетовМенеджер.ТоварыВТорговле);
		
		
	ИначеЕсли НазначениеСчета = "СчетУчетаНДСПриобретений" Тогда
		
		Если ИмяПланаСчетов = "Хозрасчетный" Тогда
			СписокСчетов.Добавить(ПланСчетовМенеджер.НалоговыйКредитВсего);
		КонецЕсли; 
		
	ИначеЕсли НазначениеСчета = "СчетУчетаНДСПродаж" Тогда
		
		Если ИмяПланаСчетов = "Хозрасчетный" Тогда
			СписокСчетов.Добавить(ПланСчетовМенеджер.НалоговыеОбязательстваВсего);
		КонецЕсли; 
		
		
	// КонтрагентыОрганизаций
	ИначеЕсли НазначениеСчета = "СчетУчетаРасчетовСПоставщиком"
		ИЛИ НазначениеСчета = "СчетУчетаРасчетовСПокупателем"
		ИЛИ НазначениеСчета = "СчетУчетаРасчетовПоТареСПокупателем"
		ИЛИ НазначениеСчета = "СчетУчетаРасчетовПоТареСПоставщиком"
		ИЛИ НазначениеСчета = "СчетУчетаАвансовВыданных"
		ИЛИ НазначениеСчета = "СчетУчетаАвансовПолученных"
		ИЛИ НазначениеСчета = "СчетУчетаАвансовПоТареВыданных"
		ИЛИ НазначениеСчета = "СчетУчетаАвансовПоТареПолученных"
		ИЛИ НазначениеСчета = "СчетУчетаРасчетовСПоставщикомПриБартере"
		ИЛИ НазначениеСчета = "СчетУчетаРасчетовСПокупателемПриБартере"
		Тогда
		
		ЗаполнитьСписокСчетамиССубконтоКонтрагентДоговор(СписокСчетов, ИмяПланаСчетов);
		
	ИначеЕсли НазначениеСчета = "СчетУчетаДоходовПоТаре" Тогда
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругиеДоходы);
	ИначеЕсли НазначениеСчета = "СчетУчетаЗатратПоТаре" Тогда
		СписокСчетов.Добавить(ПланСчетовМенеджер.ДругиеЗатратыОперационнойДеятельностиГруппа);
	КонецЕсли;
		
	Возврат СписокСчетов;
	
КонецФункции //ПолучитьСписокСчетовПоНазначениюСчета 
 
// Процедура открывает диалог выбора счета с установленным отбором
// Отбор задается согласно назначению счета
//
Процедура ВыборСчетаСОтборомПоНазначениюСчета(НазначениеСчета, Элемент, ИмяПланаСчетов, СписокСчетов = Неопределено) Экспорт
	

	ФормаВыбора = ПланыСчетов[ИмяПланаСчетов].ПолучитьФормуВыбора(, Элемент, "ВыборСчетаСОтборомПоНазначениюСчета");

	//Если СписокСчетов не передан - получим его по Назначению
	Если СписокСчетов = Неопределено Тогда
		СписокСчетов = ПолучитьСписокСчетовПоНазначениюСчета(НазначениеСчета, Элемент, ИмяПланаСчетов);
	КонецЕсли;
	
	Если СписокСчетов.Количество() > 0 Тогда
		ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.ВидСравнения  = ВидСравнения.ВСпискеПоИерархии;
		ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.Использование = Истина;
		ФормаВыбора.ПланСчетовСписок.Отбор.Ссылка.Значение      = СписокСчетов;
		
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;
	КонецЕсли; 
	
	// Если в поле ввода выбрано значение, то установим выбор на него, если это значение есть в списке 
	НачальноеЗначениеВыбора = Элемент.Значение;
	Если ЗначениеЗаполнено(НачальноеЗначениеВыбора) Тогда
		УстановитьНачальноеЗначениеВыбора = Истина;
		
		Если СписокСчетов.НайтиПоЗначению(НачальноеЗначениеВыбора) = Неопределено Тогда
			УстановитьНачальноеЗначениеВыбора = Ложь;
			Для каждого ЭлСчет Из СписокСчетов Цикл
				Если НачальноеЗначениеВыбора = ЭлСчет.Значение 
					ИЛИ НачальноеЗначениеВыбора.ПринадлежитЭлементу(ЭлСчет.Значение) Тогда
					
					УстановитьНачальноеЗначениеВыбора = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		Если УстановитьНачальноеЗначениеВыбора Тогда
			ФормаВыбора.ПараметрТекущаяСтрока = НачальноеЗначениеВыбора;
		КонецЕсли; 
	КонецЕсли; 
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры //ВыборСчетаСОтборомПоНазначениюСчета
 
// Функция возвращает форму объекта с учетом доступа на просмотр к объекту
//
// Параметры
//	МетаданныеОбъекта	- <ОбъектМетаданных>
//	ВидФормы			- <строка>.
//	ИмяФормы			- <строка>. Имя формы, как оно задано в конфигураторе
//
Функция ВернутьФормуЕслиДоступна(МетаданныеОбъекта, МенеджерОбъекта, ВидФормы = "", ИмяФормы = Неопределено) Экспорт
	
	Если НЕ ПравоДоступа("Просмотр", МетаданныеОбъекта) Тогда
		Возврат Неопределено; 
	КонецЕсли;
	
	Результат = Неопределено; 
	
	ВидФормы = НРег(ВидФормы);
	
	Если ВидФормы = "" Тогда
		Результат = МенеджерОбъекта.ПолучитьФорму(ИмяФормы);
	ИначеЕсли ВидФормы = "формавыбора" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуВыбора(ИмяФормы);
	ИначеЕсли ВидФормы = "формавыборагруппы" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуВыбораГруппы(ИмяФормы);
	ИначеЕсли ВидФормы = "формановоговидарасчета" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовогоВидаРасчета(ИмяФормы);
	ИначеЕсли ВидФормы = "формановогодокумента" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовогоДокумента(ИмяФормы);
	ИначеЕсли ВидФормы = "формановогосчета" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовогоСчета(ИмяФормы);
	ИначеЕсли ВидФормы = "формановогоузла" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовогоУзла(ИмяФормы);
	ИначеЕсли ВидФормы = "Формановогоэлемента" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовогоЭлемента(ИмяФормы);
	ИначеЕсли ВидФормы = "формановойгруппы" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовойГруппы(ИмяФормы);
	ИначеЕсли ВидФормы = "формановойзадачи" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуНовойЗадачи(ИмяФормы);
	ИначеЕсли ВидФормы = "формаредактированиязаписи" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуРедактированияЗаписи(ИмяФормы);
	ИначеЕсли ВидФормы = "формасписка" Тогда
		Результат = МенеджерОбъекта.ПолучитьФормуСписка(ИмяФормы);
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции // ВернутьФормуЕслиДоступна

// Процедура устанавливает доступность кнопки "ОплатитьКартой".
//
// Параметры:
//  КнопкиКоманднойПанели - Кнопки, среди которых содержится кнопка "ОплатитьКартой".
//
Процедура УстановитьДоступностьКнопкиОплатитьКартой(КнопкиКоманднойПанели) Экспорт

	Если ПолучитьСерверТО().ПолучитьСписокУстройств(
	   Перечисления.ВидыТорговогоОборудования.ЭквайринговаяСистема).Количество() = 0 Тогда
		КнопкиКоманднойПанели.Удалить(КнопкиКоманднойПанели.ОплатитьКартой);
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьМенюПроверить()

// Процедура управляет видимостью показателей в табличном поле
// Парметры:
//		ТабличноеПоле - Табличное поле, в котором необходимо установить видимость показателей
//		ОформленияСтрокТабличногоПоля - оформления строк табличного поля
//		СведенияОВидахРасчета - соответствие, в котором хранятся сведения о виде расчета
Процедура ОбработатьОтображениеПоказателейДляРасчета(ТабличноеПоле, ОформленияСтрокТабличногоПоля, СведенияОВидахРасчета) Экспорт

	// показатели будут видны, если в табличном поле включена видимость колонки Показатели
	Колонки = ТабличноеПоле.Колонки;
	ПоказыватьПоказатели = Колонки.Показатели.Видимость;
	
	Для каждого ОформлениеСтроки Из ОформленияСтрокТабличногоПоля Цикл
		
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		
		ДанныеСтрокиВидРасчета = ДанныеСтроки.ВидРасчета;
		Если ДанныеСтрокиВидРасчета = Неопределено Тогда
			ДанныеСтрокиВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
		КонецЕсли;	
		СведенияОВидеРасчета = ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтрокиВидРасчета, "ПриРасчете");
		
		Для СчПоказателей = 1 По 6 Цикл
			
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				
				ВидимостьПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"] и ПоказыватьПоказатели;
				ВидимостьНаименованияПоказателя = СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] и ПоказыватьПоказатели;
				
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = ВидимостьПоказателя;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = ВидимостьНаименованияПоказателя;
				
				// размеры показателя будут доступны только для видимых и изменяемых показателей
				Если ВидимостьПоказателя и ПоказыватьПоказатели Тогда
					
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется
					Или СведенияОВидеРасчета["Показатель" +СчПоказателей+ "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете
					Или СведенияОВидеРасчета["Показатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.Периодически;
					
					ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].УстановитьТекст(Формат(ДанныеСтроки["Показатель" + СчПоказателей],"ЧДЦ=" + СведенияОВидеРасчета["Показатель" + СчПоказателей + "Точность"]));
					
				КонецЕсли;
				
				// если отображается наименование - пропишем текст
				Если ВидимостьНаименованияПоказателя и ПоказыватьПоказатели Тогда		
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] и ПоказыватьПоказатели Тогда
					ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
				КонецЕсли;	
				
			Иначе
				
				// настроим видимость ячеек
				ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
		
	КонецЦикла;	

КонецПроцедуры //ОбработатьОтображениеПоказателейДляРасчета()

// Функция подбирает из справочника организаций первую разрешенную
//
// Параметры
//  ТолькоГоловныеОрганизации  – Булево – подбор только среди головных организаций
//
// Возвращаемое значение:
//   <Справочники.Организации>   – Ссылка на организацию, или пустая ссылка
//
Функция ПодобратьОрганизацию (ТолькоГоловныеОрганизации = Ложь) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация,
	|	Организации.ПометкаУдаления
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Если ТолькоГоловныеОрганизации Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Код";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Организация;
	Иначе
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

КонецФункции // ПодобратьОрганизацию ()

// Функция возвращает организацию, указанную для пользователя по умолчанию
// а если она пустая, то первую разрешенную
//
// Параметры
//  ТолькоГоловныеОрганизации  – Булево – вернуть головную организацию
//
// Возвращаемое значение:
//   <Справочники.Организации>   – Ссылка на организацию, или пустая ссылка
//
Функция ПолучитьОрганизацию(ТолькоГоловныеОрганизации = Ложь) Экспорт
	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если ТолькоГоловныеОрганизации и Не Организация.Пустая() Тогда
		// получим головную организацию
		Организация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	КонецЕсли;
	Если Организация.Пустая() Или Не ОбщегоНазначения.ЭтоДоступнаяОрганизация(Организация) Тогда
		//для пользователя не задана организация по умолчанию, подберем первую разрешенную
		Организация = ПодобратьОрганизацию(ТолькоГоловныеОрганизации);
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции // ПолучитьОрганизацию()

Процедура ПеренестиБлокКолонокЦеликом(КоллекцияКолонок, КолонкаЗаголовок, БлокКолонок) Экспорт
	
	ВидимостьКолонок = КолонкаЗаголовок.Видимость;
	ИндексЗаголовка = КоллекцияКолонок.Индекс(КолонкаЗаголовок);
	Для каждого КолонкаБлока Из БлокКолонок Цикл
		КолонкаБлока.Видимость = ВидимостьКолонок
	КонецЦикла;
	Смещение = КоллекцияКолонок.Индекс(КолонкаЗаголовок) - КоллекцияКолонок.Индекс(БлокКолонок[0]) + 1;
	Если Смещение <> 0 Тогда
		Для Индекс = 0 по БлокКолонок.ВГраница() Цикл
			КолонкаБлока = БлокКолонок[Индекс];
			КоллекцияКолонок.Сдвинуть(КолонкаБлока,Смещение);
			КолонкаБлока.Положение = ?(Индекс = 0, ПоложениеКолонки.НаСледующейСтроке, ПоложениеКолонки.ВТойЖеКолонке)
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ РЕКВИЗИТОВ В ФОРМЕ


// Процедура устанавливает видимость переданных страниц формы на основании прав доступа текущего пользователя
// вызывается из обработчика формы ПередОткрытием 
//
// Параметры
//		ОбъектыМетаданных - соответствие, ключ - ЭУ страница формы, значение - объекты метаданных 
//		РеквизитыФормы	  - соответствие, ключ - ЭУ страница формы, значение - реквизиты формы для изменения доступности
//
Процедура СформироватьСтраницыФормы(ОбъектыМетаданных, РеквизитыФормы) Экспорт
	
	// цикл по страницам формы
	Для каждого ЭлементСоответствия Из ОбъектыМетаданных Цикл
		
		// это элемент управления - страницы формы
		СтраницаФормы = ЭлементСоответствия.Ключ; 
		
		// Массив содержащий объекты метаданных, редактируемые на странице формы
		МассивОбъектовМетаданных = ЭлементСоответствия.Значение;
		
		ДоступенПросмотр = МассивОбъектовМетаданных <> Неопределено;
		Если ДоступенПросмотр Тогда
			
			РазрешеноРедактирование = Истина;
			
			// цикл по объектам метаданных на странице
			Для каждого ОбъектМетаданных Из МассивОбъектовМетаданных Цикл
				
				РазрешеноРедактирование = РазрешеноРедактирование и ПравоДоступа("Редактирование", ОбъектМетаданных);
				ДоступенПросмотр 		= ДоступенПросмотр 		  и ПравоДоступа("Просмотр", ОбъектМетаданных);
				
				Если Не РазрешеноРедактирование и Не ДоступенПросмотр Тогда
					//на странице есть объект, по которому у пользователя нет прав
					//не проверяем другие объекты этой страницы
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтраницаФормы.Видимость = ДоступенПросмотр;
		Если ДоступенПросмотр и Не РазрешеноРедактирование Тогда
			// если доступен только просмотр страницы, запретим редактирование реквизитов этой страницы
			МассивЭлементовУправления = РеквизитыФормы.Получить(СтраницаФормы);
			Для каждого Элемент Из МассивЭлементовУправления Цикл
				Если ТипЗнч(Элемент) = Тип("ПолеВвода") или ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
					Элемент.ТолькоПросмотр = Истина;
				ИначеЕсли ТипЗнч(Элемент) = Тип("Флажок") или ТипЗнч(Элемент) = Тип("Переключатель")
					или ТипЗнч(Элемент) = Тип("Надпись") Тогда
					Элемент.Доступность = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьСтраницыФормы()

// Процедура установки типа и доступности субконто в зависимости от  выбранного счета
//
//     Параметры:
//          Счет - выбранный счет
//          Форма - форма(или табличное поле) на которой расположены счет и субконто
//          Префикс - префекс наименования субконто. к префиксу добавляется номер субконто на счете
//                    для подписи с наименованием субконто предполагается имя
//                    вида "Надпись" + Префикс + НомерСубконто
//                    в случае если форма - это таб.поле, то надписи не устанавливаются
//
Процедура ПриВыбореСчета(Счет, Субконто1, НадписьСубконто1, Субконто2, НадписьСубконто2, Субконто3, НадписьСубконто3, ПолеСчет = НЕОПРЕДЕЛЕНО, ТолькоПросмотр = ЛОЖЬ) Экспорт
	
	ЭлементыСубконто = Новый Структура("Субконто1,НадписьСубконто1,Субконто2,НадписьСубконто2,Субконто3,НадписьСубконто3", Субконто1, НадписьСубконто1, Субконто2, НадписьСубконто2, Субконто3, НадписьСубконто3);
	
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		
		ЭлементыСубконто["Субконто" + Сч].Видимость = НЕ ТолькоПросмотр;
		ЭлементыСубконто["Субконто" + Сч].ВыбиратьТип = (ТипСубк.Типы().Количество() > 1);
		
		
		// Чтобы не устанавливался флаг модифицированности при открытии формы
		Если ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч].Значение) <> ЭлементыСубконто["Субконто" + Сч].Значение Тогда
			ЭлементыСубконто["Субконто" + Сч].Значение = ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч].Значение);
		КонецЕсли;

		ЭлементыСубконто["НадписьСубконто" + Сч].Заголовок = Счет.ВидыСубконто[Сч - 1].ВидСубконто.Наименование + ":";
		ЭлементыСубконто["НадписьСубконто" + Сч].Видимость = НЕ ТолькоПросмотр;
		
	КонецЦикла;
	
	Для Сч = (ЧислоАктивныхСубконто + 1) По 3 Цикл
		
		Если Не ЭлементыСубконто["Субконто" + Сч].Значение = Неопределено Тогда
			ЭлементыСубконто["Субконто" + Сч].Значение = Неопределено;
		КонецЕсли;
		
		ЭлементыСубконто["Субконто" + Сч].Видимость = Ложь;
		ЭлементыСубконто["НадписьСубконто" + Сч].Видимость = Ложь;
		
	КонецЦикла;
	
	Если ПолеСчет <> НЕОПРЕДЕЛЕНО Тогда
		ПолеСчет.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;
	
КонецПроцедуры // ПриВыбореСчета()

// Процедура установки типа и доступности субконто в зависимости от  выбранного счета
//
// Параметры:
//      Счет - выбранный счет
//      Форма - форма(или табличное поле) на которой расположены счет и субконто
//      Префикс - префекс наименования субконто. к префиксу добавляется номер субконто на счете
//                для подписи с наименованием субконто предпологается имя
//                вида "Надпись" + Префикс + НомерСубконто
//                в случае если форма - это таб.поле, то надписи не устанавливаются
//
Процедура ПриВыбореСчетаВТабличномПоле(Счет, Субконто1, КолонкаСубконто1, Субконто2, КолонкаСубконто2, Субконто3, КолонкаСубконто3, КолонкаСчет = НЕОПРЕДЕЛЕНО, ТолькоПросмотр = ЛОЖЬ) Экспорт
	
	ЭлементыСубконто = Новый Структура("Субконто1,КолонкаСубконто1,Субконто2,КолонкаСубконто2,Субконто3,КолонкаСубконто3", Субконто1, КолонкаСубконто1, Субконто2, КолонкаСубконто2, Субконто3, КолонкаСубконто3);
	
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		
		ЭлементыСубконто["КолонкаСубконто" + Сч].ТолькоПросмотр = ТолькоПросмотр;
		
		Если ТипЗнч(ЭлементыСубконто["КолонкаСубконто" + Сч]) = Тип("ПолеВвода") Тогда
			ЭлементыСубконто["КолонкаСубконто" + Сч].ВыбиратьТип = (ТипСубк.Типы().Количество() > 1);
			ЭлементыСубконто["КолонкаСубконто" + Сч].КнопкаОчистки = (ТипСубк.Типы().Количество() > 1);	
		Иначе
			ЭлементыСубконто["КолонкаСубконто" + Сч].ЭлементУправления.ВыбиратьТип = (ТипСубк.Типы().Количество() > 1);
		КонецЕсли; 
			
		// Чтобы не устанавливался флаг модифицированности при открытии формы
		Если ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]) <> ЭлементыСубконто["Субконто" + Сч] Тогда
			ЭлементыСубконто["Субконто" + Сч] = ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = (ЧислоАктивныхСубконто + 1) По 3 Цикл
			
		Если Не ЭлементыСубконто["Субконто" + Сч] = Неопределено Тогда
			ЭлементыСубконто["Субконто" + Сч] = Неопределено;
		КонецЕсли;
		
		ЭлементыСубконто["КолонкаСубконто" + Сч].ТолькоПросмотр = Истина;
		
	КонецЦикла;
	
	Если КолонкаСчет <> Неопределено Тогда
		КолонкаСчет.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;

	Если Не Субконто1 = ЭлементыСубконто.Субконто1 Тогда
		Субконто1 = ЭлементыСубконто.Субконто1;
	КонецЕсли;
	Если Не Субконто2 = ЭлементыСубконто.Субконто2 Тогда
		Субконто2 = ЭлементыСубконто.Субконто2;
	КонецЕсли;
	Если Не Субконто3 = ЭлементыСубконто.Субконто3 Тогда
		Субконто3 = ЭлементыСубконто.Субконто3;
	КонецЕсли;
	
КонецПроцедуры // ПриВыбореСчета()

// Процедура вызывается из обработчика события выбора из списка подразделения организации
// показывает список выбора у соответствующего элемента формы
Процедура ВыбратьПодразделениеОрганизацииИзСписка( ОтражатьВБухгалтерскомУчете,
												   ЭлементФормыПодразделениеОрганизации,
												   ПодразделениеОрганизации,
												   Подразделение,
												   Организация,
												   ЭтаФорма,
												   ВызыватьПриИзмененииПодразделенияОрганизации = Истина) Экспорт
													   
	Если НЕ ОтражатьВБухгалтерскомУчете И НЕ ЗначениеЗаполнено(Подразделение) 
		 и  НЕ ЗначениеЗаполнено(Организация) тогда
		 // тут делать нечего
		Возврат;
	КонецЕсли;
													   
	СписокВыбора = ПолучитьСписокПодразделенийОрганизаций(Подразделение,Организация);
	
	Если СписокВыбора.Количество()=0 тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПоУмолчанию = СписокВыбора.НайтиПоЗначению(ПодразделениеОрганизации);
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка( СписокВыбора,
												 ЭлементФормыПодразделениеОрганизации, 
												 ЭлементПоУмолчанию);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПодразделениеОрганизации = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	Если ВызыватьПриИзмененииПодразделенияОрганизации Тогда
		Попытка
			ЭтаФорма.ПриИзмененииПодразделенияОрганизации();
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Процедура заполняет надписи на закладке "Документы расчетов с контрагентами"
//
// Параметры:
// ДокументОбъект - документ, форма которого заполняется
// ФормаДокумента - заполняемая форма
//
Процедура ЗаполнитьНадписиРасчетовСКонтрагентом(ДокументОбъект, ФормаДокумента, ВалютаРегламентированногоУчета, СуммаВзаиморасчетовПоДокументу)Экспорт

	СтруктураВзаиморасчетовПоДокументу = УправлениеВзаиморасчетами.ПолучитьСтруктуруВзаиморасчетовПоДокументу(ДокументОбъект, СуммаВзаиморасчетовПоДокументу);

	Если НЕ ЗначениеЗаполнено(СтруктураВзаиморасчетовПоДокументу.ПоДокументуВал) Тогда
		ФормаДокумента.ЭлементыФормы.ПоДокументуВал.Значение  = "";
	Иначе
		ФормаДокумента.ЭлементыФормы.ПоДокументуВал.Значение  = ОбщегоНазначения.ФорматСумм(СтруктураВзаиморасчетовПоДокументу.ПоДокументуВал) + " " + СокрЛП(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СтруктураВзаиморасчетовПоДокументу.ПредоплатаВал) Тогда
		ФормаДокумента.ЭлементыФормы.ПредоплатаВал.Значение   = "";
	Иначе
		ФормаДокумента.ЭлементыФормы.ПредоплатаВал.Значение   = ОбщегоНазначения.ФорматСумм(СтруктураВзаиморасчетовПоДокументу.ПредоплатаВал)  + " " + СокрЛП(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СтруктураВзаиморасчетовПоДокументу.ОстатокВал) Тогда
		ФормаДокумента.ЭлементыФормы.ОстатокВал.Значение      = "";
	Иначе
		ФормаДокумента.ЭлементыФормы.ОстатокВал.Значение      = ОбщегоНазначения.ФорматСумм(СтруктураВзаиморасчетовПоДокументу.ОстатокВал)     + " " + СокрЛП(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	КонецЕсли;
    	

КонецПроцедуры

// Процедура изменяет значение склада в табличных частях документа при изменении склада в шапке.
// Изменяются только те значения в таб.частях, которые совпадают со старым значением склада.
//
//		Параметры:
//			- ДокОбъект    - Обрабатываемый документ
//			- НовыйСклад   - Новое значение склада
//			- ТекСклад     - Текущее (старое) значение склада
//			- СтрТабЧасти  - Строка, с именами таб. частей в которых делается замена. Имя таб.частей разделены ",".
//			- ИмяРеквСклад - Имя реквизита склад в таб. частях.
//
Процедура ИзменитьЗначениеСкладаВТабЧастях(ДокОбъект, НовыйСклад, ТекЗначСклад, СтрТабЧасти, ИмяРеквСклад = "Склад") Экспорт
	
	ТекСклад     = ТекЗначСклад;
	ТекЗначСклад = НовыйСклад; // Обновим значение склада, в форме документа, из которого был вызов
	ОбъектыПредупреждения = Новый Соответствие();
	ОбъектыПредупреждения.Вставить(Тип("ДокументСсылка.ПриходныйОрдерНаТовары"), Новый Структура("СовпадающиеРазличные, СовпадающиеНеРазличные, НеСовпадающиеРазличные, НеСовпадающиеПустые", "Приходные ордера", "документа", "приходного ордера", "приходного ордера"));
	ОбъектыПредупреждения.Вставить(Тип("СправочникСсылка.Склады"), Новый Структура("СовпадающиеРазличные, СовпадающиеНеРазличные, НеСовпадающиеРазличные, НеСовпадающиеПустые", "Склады", "склада", "склада", "склада"));

	Если НовыйСклад = ТекСклад Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НовыйСклад) Тогда // Старые склады в таб.частях не очищаем - оставляем без изменений.
		Возврат;
	КонецЕсли;
	
	СтруктТабЧастей       = Новый Структура(СтрТабЧасти);
	МассивУдалитьТабЧасть = Новый Массив;

	// В зависимости от значений указанных флагов будем формировать текст вопроса
	// пользователю и формировать логику замены значений
	ЕстьРазличныеЗнач     = Ложь; // В табличной части есть непустые значения несовпадающие с пред. значением склада из шапки
	ЕстьСовпадающЗнач     = Ложь; // В табличной части есть непустые значения совпадающие с пред. значением склада из шапки
	ЕстьПустыеЗнач        = Ложь; // В табличной части есть пустые значения склада

	Для Каждого ТабЧасть Из СтруктТабЧастей Цикл

		// 1. Проверка на заполненность таб.части
		Если ДокОбъект[ТабЧасть.Ключ].Количество() = 0 Тогда
			МассивУдалитьТабЧасть.Добавить(ТабЧасть.Ключ);
			Продолжить;
		КонецЕсли;

		// 2. Проверить наличие "кандидатов" на замену.
		//    Если таковых в данной таб. части нет - можно её исключить из дальнейшей обработки
		ЕстьРазличныеЗначТЧ   = Ложь; // В табличной части есть непустые значения несовпадающие с пред. значением склада из шапки
		ЕстьСовпадающЗначТЧ   = Ложь; // В табличной части есть непустые значения совпадающие с пред. значением склада из шапки
		ЕстьПустыеЗначТЧ      = Ложь; // В табличной части есть пустые значения склада
		ЕстьСовпадающиеНовСклад = Ложь; //В табличной части есть непустые значения совпадающие с настоящим значением склада из шапки
		ЕстьРазличныеНовСклад   = Ложь; //В табличной части есть непустые значения несовпадающие с настоящим значением склада из шапки
		Для Каждого СтрокаТЧ Из ДокОбъект[ТабЧасть.Ключ] Цикл

			ПустойСклад = НЕ ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквСклад]);

			ЕстьПустыеЗначТЧ      = ЕстьПустыеЗначТЧ    ИЛИ ПустойСклад;
			ЕстьРазличныеЗначТЧ   = ЕстьРазличныеЗначТЧ ИЛИ (НЕ ПустойСклад И СтрокаТЧ[ИмяРеквСклад] <> ТекСклад);
			ЕстьСовпадающЗначТЧ   = ЕстьСовпадающЗначТЧ ИЛИ (НЕ ПустойСклад И СтрокаТЧ[ИмяРеквСклад] =  ТекСклад);

			ЕстьСовпадающиеНовСклад = ЕстьСовпадающиеНовСклад ИЛИ (НЕ ПустойСклад И СтрокаТЧ[ИмяРеквСклад] =  НовыйСклад);
			ЕстьРазличныеНовСклад   = ЕстьРазличныеНовСклад   ИЛИ (НЕ ПустойСклад И СтрокаТЧ[ИмяРеквСклад] <> НовыйСклад);

		КонецЦикла;

		Если (НЕ ЕстьСовпадающЗначТЧ И НЕ ЕстьПустыеЗначТЧ И НЕ ЕстьРазличныеЗначТЧ) ИЛИ (ЕстьСовпадающиеНовСклад И НЕ ЕстьРазличныеНовСклад) Тогда
			МассивУдалитьТабЧасть.Добавить(ТабЧасть.Ключ);
		КонецЕсли;

		ЕстьПустыеЗнач    = ЕстьПустыеЗнач    ИЛИ ЕстьПустыеЗначТЧ;
		ЕстьРазличныеЗнач = ЕстьРазличныеЗнач ИЛИ ЕстьРазличныеЗначТЧ;
		ЕстьСовпадающЗнач = ЕстьСовпадающЗнач ИЛИ ЕстьСовпадающЗначТЧ;
		
	КонецЦикла;

	Для Каждого ТабЧастьИмя Из МассивУдалитьТабЧасть Цикл
		СтруктТабЧастей.Удалить(ТабЧастьИмя);
	КонецЦикла;

	Если СтруктТабЧастей.Количество() = 0 Тогда // Нет таб. частей для обработки
		Возврат;
	КонецЕсли;

	Если ЕстьСовпадающЗнач И ЕстьРазличныеЗнач Тогда
		ТекстВопроса = ОбъектыПредупреждения[ТипЗнч(ТекСклад)]["СовпадающиеРазличные"] + ", которые отличаются от """ + ТекСклад + """, в табличной части изменены не будут, поскольку они были установлены вручную." + Символы.ПС +
					   "Заменить в табличных частях значение " + ОбъектыПредупреждения[ТипЗнч(ТекСклад)]["СовпадающиеНеРазличные"] + " """ + ТекСклад + """ на """ + НовыйСклад + """?";
	ИначеЕсли ЕстьСовпадающЗнач И НЕ ЕстьРазличныеЗнач Тогда
		ТекстВопроса = "Заменить в табличных частях значение " + ОбъектыПредупреждения[ТипЗнч(ТекСклад)]["СовпадающиеНеРазличные"] + " """ + ТекСклад + """ на """ + НовыйСклад + """?";
	ИначеЕсли (НЕ ЕстьСовпадающЗнач И ЕстьРазличныеЗнач) Тогда
		ТекстВопроса = "Заменить в табличных частях" + ?(ЕстьПустыеЗнач, ", не пустые значения, ", " значение ") + ОбъектыПредупреждения[ТипЗнч(ТекСклад)]["НеСовпадающиеРазличные"] + " на " + НовыйСклад + " ?";
	ИначеЕсли НЕ ЕстьСовпадающЗнач И ЕстьПустыеЗнач Тогда
		ТекстВопроса = "Заполнить пустые значения " + ОбъектыПредупреждения[ТипЗнч(ТекСклад)]["НеСовпадающиеПустые"] + " в табличных частях?";
	Иначе // ничего не делаем
		Возврат;
	КонецЕсли;

	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Новое значение склада (ордера)");
	Если Ответ = КодВозвратаДиалога.Да Тогда

		Для Каждого ТабЧасть Из СтруктТабЧастей Цикл
			Для Каждого СтрокаТЧ Из ДокОбъект[ТабЧасть.Ключ] Цикл
				Если (ЕстьСовпадающЗнач И СтрокаТЧ[ИмяРеквСклад] = ТекСклад)
						ИЛИ (НЕ ЕстьСовпадающЗнач И ЕстьРазличныеЗнач И ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквСклад])) Тогда
					СтрокаТЧ[ИмяРеквСклад] = НовыйСклад;
				ИначеЕсли НЕ ЕстьСовпадающЗнач И ЕстьПустыеЗнач И НЕ ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквСклад]) Тогда
					Если НЕ ЕстьСовпадающЗнач И ЕстьРазличныеЗнач И НЕ ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквСклад]) Тогда
						продолжить;
					Иначе
						СтрокаТЧ[ИмяРеквСклад] = НовыйСклад;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // ИзменитьЗначениеСкладаВТабЧастях()

// Функция открывает окно выбора склада из документа основания, в случае когда
// при вводе на основании в документе-основании склад есть в таб.части, а в вводимом документе - склад в шапке
// т.е. из списка складов надо выбрать только один склад.
//
Функция ВыбратьСкладИзДокументаОснования(ДокОснование, СтруктПараметры, ВернутьВсеСклады = Ложь) Экспорт

	// Выберем список складов
	ТекстЗапроса = "";
	МетаДок = ДокОснование.Метаданные();
	Для Каждого ТабЧасть Из СтруктПараметры.ТабЧасти Цикл
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			    |
				|ОБЪЕДИНИТЬ ВСЕ
				|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	" + ТабЧасть.Значение + " КАК Склад,
			|	" + ТабЧасть.Значение + ".Представление КАК СкладПредставление
			|ИЗ
			|	Документ." + МетаДок.Имя + "." + ТабЧасть.Ключ + " КАК ДокОснование
			|ГДЕ
			|	ДокОснование.Ссылка = &ДокСсылка
			|   И ДокОснование." + ТабЧасть.Значение + " ССЫЛКА Справочник.Склады
			|   И ДокОснование." + ТабЧасть.Значение + " <> &ПустСклад";
	КонецЦикла;	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Склад КАК Склад,
		|	СкладПредставление КАК СкладПредставление
		|ИЗ
		|	(" + ТекстЗапроса + ") КАК Док
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладПредставление";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокСсылка", ДокОснование.Ссылка);
	Запрос.УстановитьПараметр("ПустСклад", Справочники.Склады.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокСкладов = Новый СписокЗначений;
	
	ВсеСклады = Ложь;
	Если СтруктПараметры.Свойство("ВсеСклады", ВсеСклады) Тогда
		Если ВсеСклады Тогда
			СписокСкладов.Добавить("ВсеСклады", "<Все склады>");
		КонецЕсли;
	КонецЕсли;
	
	Обход = РезультатЗапроса.Выбрать();
	Пока Обход.Следующий() Цикл
		СписокСкладов.Добавить(Обход.Склад, Обход.СкладПредставление);
	КонецЦикла;
	
	Если ВернутьВсеСклады Тогда
		Возврат СписокСкладов;
	КонецЕсли;
	
	// Один склад, нечего спрашивать.
	Если СписокСкладов.Количество() = 1 Тогда
		Возврат СписокСкладов[0].Значение;
	КонецЕсли;
	
	СтруктПараметрыФормы = Новый Структура;
	СтруктПараметрыФормы.Вставить("СписокСкладов", СписокСкладов);
	СтруктПараметрыФормы.Вставить("НачЗначение",   ДокОснование[СтруктПараметры.ИмяСкладаВШапке]);
	
	ФормаВыбораСклада = ПолучитьОбщуюФорму("ФормаВыбораСклада");
	ФормаВыбораСклада.НачальноеЗначениеВыбора = СтруктПараметрыФормы;
	ВыбрСклад = ФормаВыбораСклада.ОткрытьМодально();
	
	Возврат ВыбрСклад;
	
КонецФункции // ВыбратьСкладИзДокументаОснования()

// Функция открывает окно выбора контрагента/договора/заказа из документа основания, в случае когда
// при вводе на основании в документе-основании заказ (контрагент-договор) есть в таб.части,
// а в вводимом документе - заказ (контрагент-договор) в шапке
//
Функция ВыбратьКонтрагентДоговорЗаказИзДокументаОснования(ДокОснование, СтруктПараметры) Экспорт

	// Выберем список заказов
	ТекстЗапроса = "";
	МетаДок = ДокОснование.Метаданные();
	Для Каждого ТабЧасть Из СтруктПараметры.ТабЧасти Цикл
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			    |
				|ОБЪЕДИНИТЬ ВСЕ
				|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	" + ТабЧасть.Значение + " КАК Заказ,
			|	" + ТабЧасть.Значение + ".Контрагент КАК Контрагент,
			|	" + ТабЧасть.Значение + ".ДоговорКонтрагента КАК Договор
			|ИЗ
			|	Документ." + МетаДок.Имя + "." + ТабЧасть.Ключ + " КАК ДокОснование
			|ГДЕ
			|	ДокОснование.Ссылка = &ДокСсылка
			|	И НЕ ДокОснование." + ТабЧасть.Значение + ".Контрагент ЕСТЬ NULL
			|	И НЕ ДокОснование." + ТабЧасть.Значение + ".ДоговорКонтрагента ЕСТЬ NULL
			|";
	КонецЦикла;	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Заказ КАК Заказ,
		|	Представление(Заказ) КАК ЗаказПредставление,
		|	Контрагент КАК Контрагент,
		|	Представление(Контрагент) КАК КонтрагентПредставление,
		|	Договор КАК Договор,
		|	Представление(Договор) КАК ДоговорПредставление,
		|	0 КАК ВсегоКонтрагентов,
		|	0 КАК ВсегоДоговоров,
		|	0 КАК ВсегоЗаказов
		|ИЗ
		|	(" + ТекстЗапроса + ") КАК Док
		|
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заказ)      КАК ВсегоЗаказов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагент) КАК ВсегоКонтрагентов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Договор)    КАК ВсегоДоговоров
		|ПО
		|	ОБЩИЕ,
		|	Контрагент,
		|	Договор,
		|	Заказ
		|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокСсылка", ДокОснование.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктВозврат = Новый Структура;
	СтруктВозврат.Вставить("ВыборСделан", Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктВозврат;
	КонецЕсли;
	
	ФиксироватьКонтрагента = Неопределено;
	ФиксироватьДоговор     = Неопределено;
	ФиксироватьЗаказ       = Неопределено;
	
	ОбходОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходОбщиеИтоги.Следующий() Цикл
		ОбходКонтрагент = ОбходОбщиеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходКонтрагент.Следующий() Цикл
			Если ОбходОбщиеИтоги.ВсегоКонтрагентов = 1 Тогда
				ФиксироватьКонтрагента = ОбходКонтрагент.Контрагент;
			КонецЕсли;
			ОбходДоговор = ОбходКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходДоговор.Следующий() Цикл
				Если ОбходОбщиеИтоги.ВсегоДоговоров = 1 Тогда
					ФиксироватьДоговор = ОбходДоговор.Договор;
				КонецЕсли;
				ОбходЗаказ = ОбходДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОбходЗаказ.Следующий() Цикл
					Если ОбходОбщиеИтоги.ВсегоЗаказов = 1 Тогда
						ФиксироватьЗаказ = ОбходЗаказ.Заказ;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ФиксироватьКонтрагента = Неопределено ИЛИ ФиксироватьДоговор = Неопределено ИЛИ ФиксироватьЗаказ = Неопределено Тогда
	
		ДеревоЗаказов = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтруктПараметрыФормы = Новый Структура;
		СтруктПараметрыФормы.Вставить("ДеревоЗаказов",   ДеревоЗаказов);
		СтруктПараметрыФормы.Вставить("Контрагент",      ФиксироватьКонтрагента);
		СтруктПараметрыФормы.Вставить("Договор",         ФиксироватьДоговор);
		СтруктПараметрыФормы.Вставить("Заказ",           ФиксироватьЗаказ);
		СтруктПараметрыФормы.Вставить("ТолькоОдинЗаказ", НЕ СтруктПараметры.ЗаказВТабЧасти);
		
		ФормаВыбораСклада = ПолучитьОбщуюФорму("ФормаВыбораКонтрагентаДоговораЗаказа");
		ФормаВыбораСклада.НачальноеЗначениеВыбора = СтруктПараметрыФормы;
		Выбор = ФормаВыбораСклада.ОткрытьМодально();
		Если Выбор <> Неопределено Тогда
			СтруктВозврат.Вставить("Контрагент",  Выбор.Контрагент);
			СтруктВозврат.Вставить("Договор",     Выбор.Договор);
			СтруктВозврат.Вставить("Заказ",       Выбор.Заказ);
			СтруктВозврат.Вставить("ВыборСделан", Выбор.ВыборСделан);
		КонецЕсли;
		
	Иначе
	
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(ФиксироватьЗаказ);
		
		СтруктВозврат.Вставить("Контрагент",  ФиксироватьКонтрагента);
		СтруктВозврат.Вставить("Договор",     ФиксироватьДоговор);
		СтруктВозврат.Вставить("Заказ",       МассивЗаказов);
		СтруктВозврат.Вставить("ВыборСделан", Истина);
		
	КонецЕсли;
	
	Возврат СтруктВозврат;
	
КонецФункции // ВыбратьКонтрагентДоговорЗаказИзДокументаОснования()

// Функция возврашает Ложь, если "Нет" или Истина, если "Да" на вопрос об необходимости перезаполнения счетов учета в ТЧ документа
// Используется при изменени договора, организации, вида операции, склада и при изменения меток "Отражать в НУ" и "Отражать в БУ"
//
// Вниамние!!! Если функция вызывается при изменении метки "Отражать в НУ" то параметр ОтражатьВБухгалтерскомУчете должен быть пуст!
//
// Параметры
//  ОтражатьВБухгалтерскомУчете  – заполняется если проверяется необходимость заполнения счетов бух. учета 
//  ОтражатьВНалоговомУчете      – заполняется если проверяется необходимость заполнения счетов нал. учета
Функция НеобходимоПерезаполнитьСчетаУчета(ОтражатьВБухгалтерскомУчете= неопределено) Экспорт
	
	Если ОтражатьВБухгалтерскомУчете<>неопределено и ОтражатьВБухгалтерскомУчете тогда
		
		СпрашиватьОНУ = Истина;
		ТекстВопроса = "Установить реквизиты бухгалтерского"+?(СпрашиватьОНУ," и налогового","")+" учета в соответствии со значениями по умолчанию?"

	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат  Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , "Изменения реквизитов учета") = КодВозвратаДиалога.Да;

	
КонецФункции //НеобходимоПерезаполнитьСчетаУчета




// Процедура выполняет открытие общей формы "ФормаПараметрыЭлектронногоОбменаДокументами".
//
// Параметры:
//  ДокументОбъект - Объект документа, для которого открыта форма.
//
Процедура ОткрытьФормуПараметрыЭлектронногоОбменаДокументами(ДокументОбъект) Экспорт

	Форма = ПолучитьОбщуюФорму("ФормаПараметрыЭлектронногоОбменаДокументами");
	Форма.мДокументОбъект = ДокументОбъект;
	Форма.ОткрытьМодально();

КонецПроцедуры // ОткрытьФормуПараметрыЭлектронногоОбменаДокументами()

// Процедура устанавливает доступность кнопки "ПолучитьВес" в переданной командной панели.
//
// Параметры:
//  КнопкиКоманднойПанели - кнопки командная панель, в которой необходимо установить доступнойть кнопки.
//  Весы - массив доступных электронных весов.
//
Процедура УстановитьДоступностьКнопкиПолучитьВес(КнопкиКоманднойПанели, Весы) Экспорт

	Если Весы.Количество() = 0 Тогда
		КнопкиКоманднойПанели.Удалить(КнопкиКоманднойПанели.ПолучитьВес);
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьКнопкиПолучитьВес()

// Процедура открывает из документов форму обработки "Печать раскладки номенклатуры по местам хранения".
//
// Параметры:
//  ДокументОбъект - Объект документа, из которого вызвана процедура.
//
Процедура ОткрытьФормуНастройкиБланкаТоварногоНаполнения(ДокументОбъект) Экспорт

	Если ПроверитьМодифицированность(ДокументОбъект) Тогда
		Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().ОткрытьФормуНастройкиИзДокумента(ДокументОбъект.Ссылка);
	КонецЕсли;

КонецПроцедуры // ОткрытьФормуНастройкиБланкаТоварногоНаполнения()

// Процедура осуществляет открытие формы проверки штрихкодов.
//
// Параметры:
//  Форма                 - <Форма>
//                        - Форма документа, используемая в качестве владельца
//                          открываемой формы проверки.
//
//  ДокументОбъект        - <ДокументОбъект.*>
//                        - Проверяемый документ.
//
//  ПараметрыСвязиСтрокТЧ - <Соответствие>
//                        - Параметры связи строк табличных частей документа.
//
//  ИмяТЧ                 - <Строка>
//                        - Имя проверяемой табличной части.
//
Процедура ОткрытьФормуПроверкиШтрихкодов(Форма, ДокументОбъект, ПараметрыСвязиСтрокТЧ, ИмяТЧ = "Товары") Экспорт

	ФормаОбработки = Обработки.ПроверкаШтрихкодов.ПолучитьФорму(, Форма);
	Если ФормаОбработки.Открыта() Тогда
		ФормаОбработки.Активизировать();
	Иначе
		ФормаОбработки.мПараметрыСвязиСтрокТЧ = ПараметрыСвязиСтрокТЧ;
		ФормаОбработки.ЗаполнитьТаблицу(ДокументОбъект, ИмяТЧ);
		ФормаОбработки.Открыть();
	КонецЕсли;

КонецПроцедуры // ОткрытьФормуПроверкиШтрихкодов()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ИЗМЕНЕНИЯ ВИДИМОСТИ ПАНЕЛЕЙ

Процедура УстановитьВидимостьСправкиФормы(ОбновитьСправку = Истина, ОтображатьСправкуФормы, Форма, ИмяЭлементаУправленияОграничитель, СтруктураОбработчикиИзмененияДанных) Экспорт
	Перем ЭлементыФормы;

	ЭлементыФормы = Форма.ЭлементыФормы;
	
	ЭлементыФормы.ДействияФормы.Кнопки.ПереключениеСправкиФормы.Пометка = ОтображатьСправкуФормы;
	Если (ОтображатьСправкуФормы И ЭлементыФормы.ПанельСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Нет) ИЛИ
		(НЕ ОтображатьСправкуФормы И ЭлементыФормы.ПанельСправкиФормы.Свертка <> РежимСверткиЭлементаУправления.Нет) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЭлементыФормы.ПанельСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
		
		ЭлементыФормы[ИмяЭлементаУправленияОграничитель].Ширина = ЭлементыФормы[ИмяЭлементаУправленияОграничитель].Ширина + ЭлементыФормы.РазделительСправкиФормы.Ширина;
		ЭлементыФормы.ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы.ПанельСправкиФормы, ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.ПанельСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Право;
		ЭлементыФормы.РазделительСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Право;
		
	Иначе
		
		ЭлементыФормы.РазделительСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.ПанельСправкиФормы.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Право, Форма.Панель, ГраницаЭлементаУправления.Право);
		ЭлементыФормы.ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.РазделительСправкиФормы, ГраницаЭлементаУправления.Право);
		ЭлементыФормы[ИмяЭлементаУправленияОграничитель].Ширина = ЭлементыФормы[ИмяЭлементаУправленияОграничитель].Ширина - ЭлементыФормы.РазделительСправкиФормы.Ширина;
		
	КонецЕсли;
	
	Для каждого ОбработчикИзмененияДанных из СтруктураОбработчикиИзмененияДанных цикл
		Если ОтображатьСправкуФормы Тогда
			Форма.ПодключитьОбработчикИзмененияДанных(ОбработчикИзмененияДанных.Ключ, ОбработчикИзмененияДанных.Значение);
		Иначе
			Форма.ОтключитьОбработчикИзмененияДанных(ОбработчикИзмененияДанных.Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура управляет отображением панелей формы путем свертки в низ
// Пареметры
//	 Панель - Панель, к низу которой производим привязку Разделителя
//	 ОтображатьПанель - булево
//	 Надпись - надпись с ИО сотрудника
//	 ПанельРасчетногоЛистка - панель расчетного листка
//	 Разделитель - разделитель верхней и нижней панели
//
Процедура ИзменитьВидимостьПанелиРасчетногоЛистка(Панель, ОтображатьПанель, Надпись, ПанельРасчетногоЛистка, Разделитель) Экспорт
	
	Если ОтображатьПанель Тогда
		Если ПанельРасчетногоЛистка.Свертка = РежимСверткиЭлементаУправления.Низ Тогда

			// развернем панель, привязки на форме остались правильные
			ПанельРасчетногоЛистка.Свертка = РежимСверткиЭлементаУправления.Нет;
			
			// перепривяжем ЭУ для работы с развернутой панелью
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Верх, Панель, ГраницаЭлементаУправления.Низ);
			Надпись.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Разделитель, ГраницаЭлементаУправления.Низ);
			ПанельРасчетногоЛистка.УстановитьПривязку(ГраницаЭлементаУправления.Верх, Надпись, ГраницаЭлементаУправления.Низ);
			
		КонецЕсли;
	Иначе
		Если ПанельРасчетногоЛистка.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
			
			// перепривяжем ЭУ перед сверткой панели в низ
			ПанельРасчетногоЛистка.УстановитьПривязку(ГраницаЭлементаУправления.Верх);
			Надпись.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ПанельРасчетногоЛистка, ГраницаЭлементаУправления.Верх);
			Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Надпись, ГраницаЭлементаУправления.Верх);
			ПанельРасчетногоЛистка.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ПанельРасчетногоЛистка, ГраницаЭлементаУправления.Низ);
			ПанельРасчетногоЛистка.Свертка = РежимСверткиЭлементаУправления.Низ;
			
		КонецЕсли;
	КонецЕсли;
	
    Разделитель.Доступность = ОтображатьПанель;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА ОСТАТКОВ ОТПУСКОВ


Функция ГрафикОтпусков_ЦветПлана() Экспорт
	
	Возврат WebЦвета.ТусклоОливковый;
	
КонецФункции

Функция ГрафикОтпусков_ЦветПланаНеУтвержденного() Экспорт
	
	Возврат WebЦвета.НейтральноСерый;
	
КонецФункции

Функция ГрафикОтпусков_ЦветФакта() Экспорт
	
	Возврат WebЦвета.ГолубойСоСтальнымОттенком;
	
КонецФункции

Функция ГрафикОтпусков_ЦветМероприятий() Экспорт
	
	Возврат WebЦвета.БледноМиндальный;
	
КонецФункции


Процедура ДобавитьПанельСправкиФормы(Форма, ИмяЭлементаУправленияОграничитель) Экспорт
	ШиринаПанелиСправкаФормы = 224;
	ШиринаРазделителяСправкаФормы = 6;
	ВысотаНадписиЗакрытьСправкуФормы = 35;
	
	ЭлементУправленияОграничитель = Форма.ЭлементыФормы[ИмяЭлементаУправленияОграничитель];

	// ПанельСправкиФормы
	ПанельСправкиФормыВерх = ЭлементУправленияОграничитель.Верх;
	ПанельСправкиФормыЛево = ЭлементУправленияОграничитель.Лево + ЭлементУправленияОграничитель.Ширина - ШиринаПанелиСправкаФормы;
	ПанельСправкиФормыШирина = ШиринаПанелиСправкаФормы;
	ПанельСправкиФормыВысота = ЭлементУправленияОграничитель.Высота;
		
	ПанельСправкиФормы = Форма.ЭлементыФормы.Добавить(Тип("Панель"), "ПанельСправкиФормы");
	ПанельСправкиФормы.ОтображениеЗакладок = ОтображениеЗакладок.НеИспользовать;
	ПанельСправкиФормы.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
	ПанельСправкиФормы.Верх = ПанельСправкиФормыВерх;
	ПанельСправкиФормы.Лево = ПанельСправкиФормыЛево;
	ПанельСправкиФормы.Ширина = ПанельСправкиФормыШирина;
	ПанельСправкиФормы.Высота = ПанельСправкиФормыВысота;
	
	// ВстроеннаяСправка
	ВстроеннаяСправка = Форма.ЭлементыФормы.Добавить(Тип("ПолеHTMLДокумента"), "ВстроеннаяСправка",, ПанельСправкиФормы);
	ВстроеннаяСправка.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	ВстроеннаяСправка.Верх = 0;
	ВстроеннаяСправка.Лево = 0;
	ВстроеннаяСправка.Ширина = ПанельСправкиФормыШирина;
	ВстроеннаяСправка.Высота = ПанельСправкиФормыВысота - ВысотаНадписиЗакрытьСправкуФормы;
	ВстроеннаяСправка.УстановитьДействие("onclick", Новый Действие("ВстроеннаяСправкаonclick"));
	ВстроеннаяСправка.УстановитьДействие("onmouseout", Новый Действие("ВстроеннаяСправкаonmouseout"));
	ВстроеннаяСправка.УстановитьДействие("onmouseover", Новый Действие("ВстроеннаяСправкаonmouseover"));
	
	// НадписиЗакрытьСправкуФормы
	НадписиЗакрытьСправкуФормы = Форма.ЭлементыФормы.Добавить(Тип("Надпись"), "НадписиЗакрытьСправкуФормы",, ПанельСправкиФормы);
	НадписиЗакрытьСправкуФормы.Заголовок = "Скрыть эту информацию";
	НадписиЗакрытьСправкуФормы.ГиперСсылка = Истина;
	НадписиЗакрытьСправкуФормы.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	НадписиЗакрытьСправкуФормы.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	НадписиЗакрытьСправкуФормы.Верх = ПанельСправкиФормыВысота - ВысотаНадписиЗакрытьСправкуФормы;
	НадписиЗакрытьСправкуФормы.Лево = 0;
	НадписиЗакрытьСправкуФормы.Ширина = ПанельСправкиФормыШирина;
	НадписиЗакрытьСправкуФормы.Высота = ВысотаНадписиЗакрытьСправкуФормы;
	НадписиЗакрытьСправкуФормы.УстановитьДействие("Нажатие", Новый Действие("ПереключитьВидимостьСправкиФормы"));
	
	// РазделительСправкиФормы
	РазделительСправкиФормыВерх = ЭлементУправленияОграничитель.Верх;
	РазделительСправкиФормыЛево = ЭлементУправленияОграничитель.Лево + ЭлементУправленияОграничитель.Ширина - ШиринаПанелиСправкаФормы - ШиринаРазделителяСправкаФормы;
	РазделительСправкиФормыШирина = ШиринаРазделителяСправкаФормы;
	РазделительСправкиФормыВысота = ЭлементУправленияОграничитель.Высота;
		
	РазделительСправкиФормы = Форма.ЭлементыФормы.Добавить(Тип("Разделитель"), "РазделительСправкиФормы");
	РазделительСправкиФормы.Верх = РазделительСправкиФормыВерх;
	РазделительСправкиФормы.Лево = РазделительСправкиФормыЛево;
	РазделительСправкиФормы.Ширина = РазделительСправкиФормыШирина;
	РазделительСправкиФормы.Высота = РазделительСправкиФормыВысота;
	
	//Установка привязок
	ПервыйЭлемент = Неопределено;
	ГраницаПервогоЭлемента = Неопределено;
	ВторойЭлемент = Неопределено;
	ГраницаВторогоЭлемента = Неопределено;
	
	ЭлементУправленияОграничитель.ПолучитьПривязку(ГраницаЭлементаУправления.Верх, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	
	ЭлементУправленияОграничитель.ПолучитьПривязку(ГраницаЭлементаУправления.Низ, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ПервыйЭлемент, ГраницаПервогоЭлемента, ВторойЭлемент, ГраницаВторогоЭлемента);
	
	ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Лево, РазделительСправкиФормы, ГраницаЭлементаУправления.Право);
	ПанельСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Право, Форма.Панель, ГраницаЭлементаУправления.Право);
	
	ВстроеннаяСправка.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ПанельСправкиФормы, ГраницаЭлементаУправления.Лево);
	ВстроеннаяСправка.УстановитьПривязку(ГраницаЭлементаУправления.Право, ПанельСправкиФормы, ГраницаЭлементаУправления.Право);
	ВстроеннаяСправка.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ПанельСправкиФормы, ГраницаЭлементаУправления.Верх);
	ВстроеннаяСправка.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ПанельСправкиФормы, ГраницаЭлементаУправления.Низ);
	
	НадписиЗакрытьСправкуФормы.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ПанельСправкиФормы, ГраницаЭлементаУправления.Лево);
	НадписиЗакрытьСправкуФормы.УстановитьПривязку(ГраницаЭлементаУправления.Право, ПанельСправкиФормы, ГраницаЭлементаУправления.Право);
	НадписиЗакрытьСправкуФормы.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ПанельСправкиФормы, ГраницаЭлементаУправления.Низ);
	НадписиЗакрытьСправкуФормы.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ПанельСправкиФормы, ГраницаЭлементаУправления.Низ);
	
	РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Лево, РазделительСправкиФормы, ГраницаЭлементаУправления.Право);
	РазделительСправкиФормы.УстановитьПривязку(ГраницаЭлементаУправления.Право, Форма.Панель, ГраницаЭлементаУправления.Право);
	
	ЭлементУправленияОграничитель.Ширина = ЭлементУправленияОграничитель.Ширина - ШиринаПанелиСправкаФормы - ШиринаРазделителяСправкаФормы;
	ЭлементУправленияОграничитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, РазделительСправкиФормы, ГраницаЭлементаУправления.Право);

КонецПроцедуры

 // Процедура вычисления даты окончания действия учетной политики
// параметры
// ТекПериод - дата начала дейстия учетной политики
// ТекОрганизация - организация, учетная политика которой рассматривается
Функция НайтиДатуОкончанияДействия(ТекПериод, ТекОрганизация) Экспорт
	
	УчетнаяПолитика = глЗначениеПеременной("УчетнаяПолитикаРегл");	
	
	УчетнаяПолитикаКопия = УчетнаяПолитика.Скопировать();	
	УчетнаяПолитикаКопия.Сортировать("Период Возр");
	
	ДатаОкончания = ТекПериод;
	
	Для Каждого Строка Из УчетнаяПолитикаКопия Цикл
		Если Строка.Организация = ТекОрганизация 
			И Строка.Период > ДатаОкончания Тогда
			
			ДатаОкончания = Строка.Период - 1;
			
			Возврат ДатаОкончания;
			
		КонецЕсли;
	КонецЦикла;
	
	ДатаОкончания = ?(ТекПериод > РабочаяДата, КонецГода(ТекПериод), КонецГода(ДатаОкончания));
	Возврат ДатаОкончания;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// МЕХАНИЗМ ДОПОЛНИТЕЛЬНЫХ КОЛОНОК В ТАБЛИЧНЫХ ПОЛЯХ ДОКУМЕНТОВ

Функция ВидимостьДополнительныхКолонок(ИмяДокумента, ТабличныеПоля) Экспорт
	
	СтруктураДанныхОВидимостиДополнительныхКолонок = ВосстановитьЗначение(ИмяДокумента + "СтруктураДанныхОВидимостиДополнительныхКолонок");

	Если СтруктураДанныхОВидимостиДополнительныхКолонок = Неопределено Тогда
		СтруктураДанныхОВидимостиДополнительныхКолонок = Новый Структура;
	КонецЕсли;
	
	Для Каждого ЭлементСоответствия Из ТабличныеПоля Цикл
		ТабличноеПоле = ЭлементСоответствия.Ключ;
		// по умолчанию дополнительные колонки "выключены"
		Если НЕ СтруктураДанныхОВидимостиДополнительныхКолонок.Свойство(ТабличноеПоле) Тогда
			СтруктураДанныхОВидимостиДополнительныхКолонок.Вставить(ТабличноеПоле, Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхОВидимостиДополнительныхКолонок;
	
КонецФункции

Функция ДополнительныеКолонкиТабличныхПолейДокумента(ЭлементыФормы, ТабличныеПоля) Экспорт
	
	ДополнительныеКолонки = Новый Структура;
	
	Для Каждого ЭлементСоответствия Из ТабличныеПоля Цикл
		
		ТабличноеПоле = ЭлементСоответствия.Ключ;
		
		ДополнительныеКолонкиТабличногоПоля = Новый Массив;
		
		КолонкиТабличногоПоля = ЭлементыФормы[ТабличноеПоле].Колонки;
		Для Каждого КолонкаТабличногоПоля Из КолонкиТабличногоПоля Цикл
			Если НЕ КолонкаТабличногоПоля.Видимость И КолонкаТабличногоПоля.ИзменятьВидимость Тогда
				ДополнительныеКолонкиТабличногоПоля.Добавить(КолонкаТабличногоПоля);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеКолонки.Вставить(ТабличноеПоле, ДополнительныеКолонкиТабличногоПоля);
		
	КонецЦикла;
	
	Возврат ДополнительныеКолонки;
	
КонецФункции

Процедура ПоказатьСкрытьДополнительныеКолонки(ДополнительныеКолонки, СтруктураДанныхОВидимостиДополнительныхКолонок, ТабличныеПоляИКомандныеПанели, ТабличноеПоле = Неопределено) Экспорт
	
	Если ТабличноеПоле = Неопределено Тогда
		// управляем видимостью колонок для всех табличных полей перечисленных в структуре
		Для Каждого ТабличноеПолеДокумента Из ДополнительныеКолонки Цикл
			КоманднаяПанельТабличногоПоля 		= ТабличныеПоляИКомандныеПанели[ТабличноеПолеДокумента.Ключ];
			
			ПоказатьСкрытьДополнительныеКолонкиТабличногоПоля(ТабличноеПолеДокумента.Значение, СтруктураДанныхОВидимостиДополнительныхКолонок[ТабличноеПолеДокумента.Ключ], КоманднаяПанельТабличногоПоля);
			
			// меняем пометку на кнопке "Дополнительно"
			КнопкаДополнительно = КоманднаяПанельТабличногоПоля.Кнопки["Дополнительно"];
			КнопкаДополнительно.Пометка = СтруктураДанныхОВидимостиДополнительныхКолонок[ТабличноеПолеДокумента.Ключ];
			
		КонецЦикла;
	Иначе	
		// изменяем видимость для конкретного табличного поля
		ДополнительныеКолонкиТабличногоПоля = ДополнительныеКолонки[ТабличноеПоле];
		ВидимостьДополнительныхКолонок 		= СтруктураДанныхОВидимостиДополнительныхКолонок[ТабличноеПоле];
		КоманднаяПанельТабличногоПоля 		= ТабличныеПоляИКомандныеПанели[ТабличноеПоле];
		
		ПоказатьСкрытьДополнительныеКолонкиТабличногоПоля(ДополнительныеКолонкиТабличногоПоля, ВидимостьДополнительныхКолонок, КоманднаяПанельТабличногоПоля);
		
		// меняем пометку на кнопке "Дополнительно"
		КнопкаДополнительно = КоманднаяПанельТабличногоПоля.Кнопки["Дополнительно"];
		КнопкаДополнительно.Пометка = СтруктураДанныхОВидимостиДополнительныхКолонок[ТабличноеПоле];
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьСкрытьДополнительныеКолонкиТабличногоПоля(ДополнительныеКолонкиТабличногоПоля, ВидимостьДополнительныхКолонок, КоманднаяПанельТабличногоПоля)
	
	Для Каждого КолонкаТабличногоПоля Из ДополнительныеКолонкиТабличногоПоля Цикл
		КолонкаТабличногоПоля.Видимость = ВидимостьДополнительныхКолонок;
	КонецЦикла;
	
КонецПроцедуры

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБСЛУЖИВАНИЯ ОСТАТКОВ НОМЕНКЛАТУРЫ

// Процедура вызывается при выводе строки дерева остатков номенклатуры на складах.
//
Процедура ПриВыводеСтрокиБезЦены(Элемент, ОформлениеСтроки, ДанныеСтроки, ОтображатьСклады, НоменклатураТекущиеДанные) Экспорт

	Если ДанныеСтроки.Родитель = Неопределено Тогда
		Если ОтображатьСклады Тогда
			ОформлениеСтроки.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ХарактеристикаСклад) Тогда
			Если НоменклатураТекущиеДанные <> Неопределено
			   И НЕ НоменклатураТекущиеДанные.ЭтоГруппа
			   И НЕ НоменклатураТекущиеДанные.ВестиУчетПоХарактеристикам Тогда
				ОформлениеСтроки.Ячейки.ХарактеристикаСклад.Текст = "Учет по характеристикам не ведется";
			Иначе
				ОформлениеСтроки.Ячейки.ХарактеристикаСклад.Текст = "<без характеристики>";
			КонецЕсли;
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ХарактеристикаСклад) Тогда
			ОформлениеСтроки.Ячейки.ХарактеристикаСклад.Текст = "Склад не указан";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает событие Выбор табличного поля остатков товаров на складах.
//
Процедура ОбработатьВыборТаблицаОстатков(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка, ТекущаяНоменклатура) Экспорт

	Если Колонка.Имя = "СвободныйОжидаемый"
	   И ЗначениеЗаполнено(ВыбраннаяСтрока.СвободныйОжидаемый)
	   И ВыбраннаяСтрока.Родитель = Неопределено Тогда
	
		Отчет = Отчеты.ОтчетСписокКроссТаблица.Создать();
		
		СтруктураНостроек = Новый Структура;
		СтруктураНостроек.Вставить("ИмяРегистра", "ЗаказыПоставщикам");
		СтруктураНостроек.Вставить("ДатаКон", ТекущаяДата());
		
		СоответствиеОтбора = Новый Соответствие;
		СоответствиеОтбора.Вставить("Номенклатура", ТекущаяНоменклатура);
		СоответствиеОтбора.Вставить("ХарактеристикаНоменклатуры", ВыбраннаяСтрока.ХарактеристикаСклад);
		СтруктураНостроек.Вставить("Отбор",СоответствиеОтбора);
		
		СоответствиеГруппировок = Новый Соответствие;
		СоответствиеГруппировок.Вставить("ЗаказПоставщику.ДатаПоступления");
		СоответствиеГруппировок.Вставить("ЗаказПоставщику");
		СтруктураНостроек.Вставить("ГруппировкиСтрок", СоответствиеГруппировок);
		
		СтруктураНостроек.Вставить("ВыбранныеПоля",  Новый Структура("Цена", "Цена"));
		СтруктураНостроек.Вставить("РаскрашиватьИзмерения", Истина);
		
		Отчет.Настроить(СтруктураНостроек);
		
		ФормаОтчета = Отчет.ПолучитьФорму();
		ФормаОтчета.ОбновитьОтчет();
		ФормаОтчета.Открыть();
	
	ИначеЕсли Колонка.Имя = "ВРезерве"
	   И ЗначениеЗаполнено(ВыбраннаяСтрока.ВРезерве) Тогда
	
		Отчет = Отчеты.ОтчетСписокКроссТаблица.Создать();
		
		СтруктураНостроек = Новый Структура;
		СтруктураНостроек.Вставить("ИмяРегистра", "ТоварыВРезервеНаСкладах");
		СтруктураНостроек.Вставить("ДатаКон", ТекущаяДата());
		
		СоответствиеОтбора = Новый Соответствие;
		СоответствиеОтбора.Вставить("Номенклатура", ТекущаяНоменклатура);
		Если ВыбраннаяСтрока.Родитель = Неопределено Тогда
			СоответствиеОтбора.Вставить("ХарактеристикаНоменклатуры", ВыбраннаяСтрока.ХарактеристикаСклад);
		Иначе
			СоответствиеОтбора.Вставить("ХарактеристикаНоменклатуры", ВыбраннаяСтрока.Родитель.ХарактеристикаСклад);
			СоответствиеОтбора.Вставить("Склад", ВыбраннаяСтрока.ХарактеристикаСклад);
		КонецЕсли; 
		СтруктураНостроек.Вставить("Отбор",СоответствиеОтбора);
		
		СоответствиеГруппировок = Новый Соответствие;
		СоответствиеГруппировок.Вставить("ДокументРезерва");
		СтруктураНостроек.Вставить("ГруппировкиСтрок", СоответствиеГруппировок);
		
		СоответствиеПолей= Новый Соответствие;
		СоответствиеПолей.Вставить("ДокументРезерва.ДатаОтгрузки");
		СтруктураНостроек.Вставить("ВыбранныеПоля",  СоответствиеПолей);
		
		СтруктураНостроек.Вставить("РаскрашиватьИзмерения", Истина);
		СтруктураНостроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", Истина);
		
		Отчет.Настроить(СтруктураНостроек);
		
		ФормаОтчета = Отчет.ПолучитьФорму();
		ФормаОтчета.ОбновитьОтчет();
		ФормаОтчета.Открыть();
	
	ИначеЕсли Колонка.Имя = "МестоХранения"
		    И ЗначениеЗаполнено(ВыбраннаяСтрока.ХарактеристикаСклад)
			И ТипЗнч(ВыбраннаяСтрока.ХарактеристикаСклад) = Тип("СправочникСсылка.Склады") Тогда
		СписокРегистра = РегистрыСведений.МестаХраненияНоменклатуры.ПолучитьФормуСписка();
		СписокРегистра.Отбор.Номенклатура.Значение      = ТекущаяНоменклатура;
		СписокРегистра.Отбор.Номенклатура.Использование = Истина;
		СписокРегистра.Отбор.Склад.Значение             = ВыбраннаяСтрока.ХарактеристикаСклад;
		СписокРегистра.Отбор.Склад.Использование        = Истина;
		СписокРегистра.Открыть();
	КонецЕсли; 

КонецПроцедуры

// Процедура устанавливает порядок столбцов сумм такой же как порядок следования строк типов цен	
Процедура УстановитьПорядокКолонокСуммТабПоле(ТабПоле, СписокЦенОстатков, КоличествоБазовыхКолонок) Экспорт
	
	НомерКолонкиВСписке = КоличествоБазовыхКолонок;
	Для Каждого Элемент Из СписокЦенОстатков Цикл
		
		Если НЕ Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = ТабПоле.Колонки.Найти(Элемент.Префикс + "Цена");
		Если Колонка = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// только позицию у колонки установим и все
		РеальнаяПозицияКолонки = ТабПоле.Колонки.Индекс(Колонка);
		Если РеальнаяПозицияКолонки <> НомерКолонкиВСписке Тогда
			ТабПоле.Колонки.Сдвинуть(Колонка, НомерКолонкиВСписке - РеальнаяПозицияКолонки);	
		КонецЕсли;
		
		// очередной номер колонки в списке
		НомерКолонкиВСписке = НомерКолонкиВСписке + 1;
	КонецЦикла;
		
КонецПроцедуры	

// Процедура перемещает строку типа цен либо вверх либо вниз
Процедура ПереместитьТипЦен(ТабПолеСписокЦен, ТабПолеОстаткиИЦены, СписокЦенОстатков, КоличествоБазовыхКолонок, ПереместитьВверх) Экспорт
	
	СтрокаТиповЦен = ТабПолеСписокЦен.ТекущиеДанные;
	Если СтрокаТиповЦен = Неопределено Тогда
		Возврат
	КонецЕсли;
	КоличествоТиповЦен = СписокЦенОстатков.Количество();
	ИндексСтроки = СписокЦенОстатков.Индекс(СтрокаТиповЦен);
	
	Если ПереместитьВверх Тогда
		
		Если ИндексСтроки <> 0 Тогда 
			// перемещаем строку на 1 позицию вверх
			СписокЦенОстатков.Сдвинуть(СтрокаТиповЦен, -1);
		Иначе
			// перемещаем в самый низ
			СписокЦенОстатков.Сдвинуть(СтрокаТиповЦен, КоличествоТиповЦен - 1);
		КонецЕсли;
	
	Иначе
		
		Если ИндексСтроки <> КоличествоТиповЦен - 1 Тогда 
			// перемещаем строку на 1 позицию вниз
			СписокЦенОстатков.Сдвинуть(СтрокаТиповЦен, 1);
		Иначе
			// перемещаем в самый верх
			СписокЦенОстатков.Сдвинуть(СтрокаТиповЦен, - КоличествоТиповЦен + 1);
		КонецЕсли;
	
	КонецЕсли;
	
	// если тип цен выводится - то надо колонки поменять в соответвии с порядком следования типов цен
	Если СтрокаТиповЦен.Пометка Тогда
		// Осталось только позиции колонок в гриде установить нужные
		УстановитьПорядокКолонокСуммТабПоле(ТабПолеОстаткиИЦены, СписокЦенОстатков, КоличествоБазовыхКолонок);	
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавляет или удаляет колонки сумм по типам сумм для номенклатуры у табличного поля
Процедура ОбновитьКолонкиСуммТабПоле(ТабПоле, СписокЦенОстатков, ВВалютеЦены, ВалютаЦены, ОбновлятьШапкиКолонок = Истина, КоличествоБазовыхКолонок) Экспорт
	
	ВыводитьВУстановленнойВалюте = НЕ ВВалютеЦены И ЗначениеЗаполнено(ВалютаЦены);
	ПостфиксЦены = ?(ВыводитьВУстановленнойВалюте, " Цена, " + СокрЛП(ВалютаЦены), " Цена");
	
	НомерКолонкиВСписке = КоличествоБазовыхКолонок;
	Для Каждого Элемент Из СписокЦенОстатков Цикл
		
		Если Элемент.Пометка Тогда
			// а колонка уже есть - ничего делать не надо
			Колонка = ТабПоле.Колонки.Найти(Элемент.Префикс + "Цена");
							
			Если Колонка <> Неопределено Тогда
				
				// только позицию ее установим и все
				РеальнаяПозицияКолонки = ТабПоле.Колонки.Индекс(Колонка);
				Если РеальнаяПозицияКолонки <> НомерКолонкиВСписке Тогда
					ТабПоле.Колонки.Сдвинуть(Колонка, НомерКолонкиВСписке - РеальнаяПозицияКолонки);	
				КонецЕсли;
				
				Если ОбновлятьШапкиКолонок Тогда
					Колонка.ТекстШапки = Элемент.Наименование + ПостфиксЦены;
				КонецЕсли;
				
			Иначе	
				
				НоваяКолонка = ТабПоле.Колонки.Вставить(Мин(НомерКолонкиВСписке, ТабПоле.Колонки.Количество()));
				НоваяКолонка.ИзменятьНастройку = Ложь;
				НоваяКолонка.ИзменятьВидимость = Ложь;
				НоваяКолонка.Имя = Элемент.Префикс + "Цена";
				НоваяКолонка.Данные = Элемент.Префикс + "Цена";
				НоваяКолонка.ТекстШапки = Элемент.Наименование + ПостфиксЦены;
			
			КонецЕсли;
			
			// очередной номер колонки в списке
			НомерКолонкиВСписке = НомерКолонкиВСписке + 1;
		Иначе
			Колонка = ТабПоле.Колонки.Найти(Элемент.Префикс + "Цена");
			Если Колонка <> Неопределено Тогда
				ТабПоле.Колонки.Удалить(Колонка);
			КонецЕсли;
     					
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновляет тексты шапок колонок остатков (добавляет к ним единицы измерения)
Процедура ОбновитьШапкиКолонокОстатков(ТабПоле, ЕдиницаХранения) Экспорт
	
	СтрокаПредставленияЕдиницы = ?(НЕ ЗначениеЗаполнено(ЕдиницаХранения), "", (", " + СокрЛП(ЕдиницаХранения)));
			
	ТабПоле.Колонки.Общий.ТекстШапки              = "Общий"      + СтрокаПредставленияЕдиницы;
	ТабПоле.Колонки.Свободный.ТекстШапки          = "Свободный"  + СтрокаПредставленияЕдиницы;
	ТабПоле.Колонки.СвободныйОжидаемый.ТекстШапки = "Своб.ожид." + СтрокаПредставленияЕдиницы;
	ТабПоле.Колонки.ВРезерве.ТекстШапки           = "В резерве"  + СтрокаПредставленияЕдиницы;

КонецПроцедуры
	
// Процедура в нужном формате формирует суммы к выводу
Процедура ПриВыводеСуммОстатковНоменклатуры(ОформлениеСтроки, ДанныеСтроки, СписокПрефиксовИмен, ВВалютеЦены) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СписокПрефиксовИмен) ИЛИ (СписокПрефиксовИмен.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из СписокПрефиксовИмен Цикл
		СтрокаПрефикса = Элемент.Значение;
		
		ТекстЦены = СокрЛП(Формат(ДанныеСтроки[СтрокаПрефикса + "Цена"], "ЧЦ=15; ЧДЦ=2"));
		
		Если ЗначениеЗаполнено(ТекстЦены) Тогда
			
			ЕдиницаЦены = СокрЛП(ДанныеСтроки[СтрокаПрефикса + "ЕдиницаЦены"]);
			Если ЗначениеЗаполнено(ЕдиницаЦены) Тогда
				ТекстЦены = ТекстЦены + ", " + ЕдиницаЦены;
			КонецЕсли; 
			
			ВалютаЦены = СокрЛП(ДанныеСтроки[СтрокаПрефикса + "ВалютаЦены"]);
			Если ВВалютеЦены И ЗначениеЗаполнено(ВалютаЦены) Тогда
				ТекстЦены = ТекстЦены + " (" + ВалютаЦены + ")";
			КонецЕсли; 
			
			ОформлениеСтроки.Ячейки[СтрокаПрефикса + "Цена"].Текст = ТекстЦены;
		
		КонецЕсли;
		
		Если НЕ ДанныеСтроки[СтрокаПрефикса + "ФлагЦены"] Тогда
			ОформлениеСтроки.Ячейки[СтрокаПрефикса + "Цена"].ЦветТекста = WebЦвета.Синий;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Процедура отмечает все элементы из списка
Процедура ОтметитьЭлементыСписка(Список, ФлагОтметки) Экспорт
	
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из Список Цикл
		ЭлементСписка.Пометка = ФлагОтметки;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура открывает форму выбора справочника "Склады" с переданным отбором по виду склада.
//
// Параметры:
//  ЭлементФормы - элемент формы, в котором инициирован выбор.
//  ВидСклада - нужный вид склада.
//  СтандартнаяОбработка - Флаг стандартной обработки выбора. Здесь сбрасывается.
//
Процедура НачалоВыбораСклада(ЭлементФормы, ВидСклада, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;

	ФормаВыбора = Справочники.Склады.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ЭлементФормы.ВыборГруппИЭлементов;
	ФормаВыбора.СправочникСписок.Отбор.ВидСклада.Установить(ВидСклада);
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидСклада.Доступность = Ложь;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;

	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораСклада()

// процедура позволяет настрить период (ограничения по датам для отчета)
Процедура ОбработчикНастройкаПериодаНажатие(ДатаНач, ДатаКон) Экспорт

	НП = Новый НастройкаПериода;
	НП.ВариантНастройки = ВариантНастройкиПериода.Период;
	
	НП.УстановитьПериод(НачалоДня(ДатаНач), ?(ДатаКон = '00010101', ДатаКон, КонецДня(ДатаКон)));

	Если НП.Редактировать() Тогда

		ДатаНач = НП.ПолучитьДатуНачала();
		ДатаКон = НП.ПолучитьДатуОкончания();

	КонецЕсли;

КонецПроцедуры


// Универсальная процедура, которая инициирует механизм подбора
// номенклатуры в документы (открывает основную форму обработки подбор).
//
// Параметры:
//  ФормаДокумента - форма документа, в который осуществляется подбор,
//  СтруктураПараметров - параметры, которые передаются в форму подбора.
//
Процедура ОткрытьПодборНоменклатуры(ФормаДокумента, СтруктураПараметров, Метаданные, ФормаПодбора = Неопределено) Экспорт
	
	МетаданныеДокумента = Метаданные;
	
	Для Каждого ЭлементСтруктурыПараметров Из СтруктураПараметров Цикл

		ИмяРеквизита = ЭлементСтруктурыПараметров.Ключ;

		Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ФормаДокумента.ПодключитьОбработчикИзмененияДанных(ИмяРеквизита, "ОбновитьФормуПодбора", Ложь);
		Иначе
			Если ИмяРеквизита = "Склад" Тогда

				ИмяРеквизита = "СкладОрдер";
				Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					ФормаДокумента.ПодключитьОбработчикИзмененияДанных(ИмяРеквизита, "ОбновитьФормуПодбора", Ложь);
					Продолжить;
				КонецЕсли;

				ИмяРеквизита = "СкладОтправитель";
				Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					ФормаДокумента.ПодключитьОбработчикИзмененияДанных(ИмяРеквизита, "ОбновитьФормуПодбора", Ложь);
					Продолжить;
				КонецЕсли;

				ИмяРеквизита = "СкладГруппа";
				Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
					ФормаДокумента.ПодключитьОбработчикИзмененияДанных(ИмяРеквизита, "ОбновитьФормуПодбора", Ложь);
					Продолжить;
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	// Открываем форму подбора.
	ФормаПодбора = Обработки.ПодборНоменклатуры.ПолучитьФорму("ОсновнаяФорма", ФормаДокумента, ФормаДокумента);
	ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров = СтруктураПараметров;
	ФормаПодбора.Открыть();

КонецПроцедуры // ОткрытьПодборНоменклатуры()

// Процедура, которая обновляет параметры подбора номенклатуры и
// инициирует обновление формы подбора, если она открыта
//
// Параметры:
//  ДокументОбъект     - объект документа, в котором производится подбор.
//  ФормаДокумента     - форма документа, в который осуществляется подбор,
//  ПолноеИмяРеквизита - полное имя реквизита, который изменился.
//
Процедура ОбновитьПараметрыИФормуПодбора(ДокументОбъект, ФормаДокумента, ПолноеИмяРеквизита) Экспорт

	ФормаПодбора = Обработки.ПодборНоменклатуры.ПолучитьФорму("ОсновнаяФорма", ФормаДокумента, ФормаДокумента);

	Если ФормаПодбора.Открыта() Тогда

		ИмяРеквизита = СтрЗаменить(ПолноеИмяРеквизита, "ДокументОбъект.", "");
		ИмяКлюча     = ?(ИмяРеквизита = "СкладОрдер" ИЛИ ИмяРеквизита = "СкладОтправитель" ИЛИ ИмяРеквизита = "СкладГруппа", "Склад", ИмяРеквизита);

		Если ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров.Свойство(ИмяКлюча) Тогда

			ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров.Вставить(ИмяКлюча, ДокументОбъект[ИмяРеквизита]);
			СтруктураЗапроса = ФормаПодбора.ЭлементыФормы.СписокВидовПодбора.Значение;
			Родитель         = ФормаПодбора.ПолучитьТекущегоРодителя();

			ФормаПодбора.ОбновитьИнформационнуюНадписьПараметрыПодбора(СтруктураЗапроса);
			ФормаПодбора.ПерезаполнитьТаблицуНоменклатуры(Родитель, СтруктураЗапроса);
			Если СтруктураЗапроса = Неопределено ИЛИ СтруктураЗапроса = "Спецификации" Тогда
				Если СтруктураЗапроса = "Спецификации" Тогда
					ФормаПодбора.ЭлементыФормы.СправочникСпецификации.Значение.Обновить();
				ИначеЕсли СтруктураЗапроса = Неопределено Тогда
					ФормаПодбора.ЭлементыФормы.СправочникНоменклатура.Значение.Обновить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбновитьПараметрыИФормуПодбора()




// Функция проверяет ведение производственной деятельности в указанной организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Текущая организация
//	Дата - Дата - Дата документа
//	ТипОбъекта - Тип - Тип документа
//
// Возвращаемое значение:
//	Булево - Истина - Документ может отражаться в регламентированном учете
//			 Ложь - Документ не должен отражаться в регламентированном учете
//
Функция ПолучитьПризнакОтраженияВРегламентированномУчетеДляПроизводственныхДокументов(
	Организация, 
	Дата, 
	ТипОбъекта
	)
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Тип("ДокументОбъект.АктОбОказанииПроизводственныхУслуг"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ВозвратПереданныхТоваров"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ИнвентаризацияБракаВПроизводстве"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ИнвентаризацияНЗП"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.КорректировкаНЗП"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ОприходованиеНЗП"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ПередачаТоваров"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ПолучениеУслугПоПереработке"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.ПоступлениеТоваровИзПереработки"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.РаспределениеМатериаловНаВыпуск"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.РаспределениеПрочихЗатрат"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.РеализацияУслугПоПереработке"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.СписаниеНЗП"));
	МассивДокументов.Добавить(Тип("ДокументОбъект.УстановкаБазыРаспределенияЗатрат"));
	
	ОтражатьВРегламентированномУчете = Истина;
	
	Если МассивДокументов.Найти(ТипОбъекта) <> Неопределено Тогда
		
        УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(Дата, Организация, Ложь);
		Если ЗначениеЗаполнено(УчетнаяПолитика) Тогда
			Если НЕ УчетнаяПолитика.ОрганизацияВедетПроизводственнуюДеятельность Тогда
				ОбщегоНазначения.СообщитьОбОшибке(
					"Для организации " + Организация + " не ведется регл. учет деятельности, связанной с производством продукции и оказанием услуг.");
				ОтражатьВРегламентированномУчете = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ОтражатьВРегламентированномУчете;
	
КонецФункции // ПолучитьПризнакОтраженияВРегламентированномУчетеДляПроизводственныхДокументов()

//Процедура управляет доступностью признаков отражения в БУ и НУ в документах в зависимости от реквизита организации ОтражатьВРегламентированномУчете
//Также процедура может изменять значения реквизитов ОтражатьВБУ и ОтражатьВНУ
//	Может вызываться из обработчиков формы ПриОткрытии, ОрганизацияПриИзменении
//Параметры:
//	Объект - Документ-объект
//	Форма - форма документа
//	ИмяОтражатьВБУ - имя элемента формы, связанного с реквизитом ОтражатьВБУ
//  ИмяОтражатьВНУ - имя элемента формы, связанного с реквизитом ОтражатьВНУ
//  мОтражатьВРегламентированномУчете - переменная формы, передается в процедуру для изменения.
//		далее может использоваться в логике формы в индивидуальном порядке для каждого документа.
//	флИзменятьРеквизитыБУНУ - признак необходимости изменять реквизиты документа ОтражатьвБУ, ОтражатьВНУ
//		Устанавливается если процедура вызывается при изменении значения организации в документе
Процедура УправлениеПризнакомОтраженияВРеглУчете(Объект, Форма,ИмяОтражатьВБУ = "ОтражатьВБухгалтерскомУчете",ИмяОтражатьВНУ = "ОтражатьВНалоговомУчете",мОтражатьВРегламентированномУчете,флИзменятьРеквизитыБУНУ=ложь) Экспорт
	мОтражатьВРегламентированномУчете = Объект.Организация.ОтражатьВРегламентированномУчете;
	
	Если мОтражатьВРегламентированномУчете Тогда
		мОтражатьВРегламентированномУчете = ПолучитьПризнакОтраженияВРегламентированномУчетеДляПроизводственныхДокументов(
			Объект.Организация, Объект.Дата, ТипЗнч(Объект));
	КонецЕсли;
		
	Если флИзменятьРеквизитыБУНУ или Объект.ЭтоНовый() Тогда
		Если мОтражатьВРегламентированномУчете Тогда
			ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
			//организация в РУ отражается. Флаги БУ и НУ необходимо установить в соотв. с настройками пользователя по умолчанию
			Объект.ОтражатьВБухгалтерскомУчете=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
		Иначе
			//организация в РУ не отражается - необходимо сбросить флаги отражения в БУ и НУ
			Если Объект.ОтражатьВБухгалтерскомУчете  Тогда
				Объект.ОтражатьВБухгалтерскомУчете = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Форма.ЭлементыФормы[ИмяОтражатьВБУ].Доступность = мОтражатьВРегламентированномУчете;

КонецПроцедуры

// Выводит строки показателей в документах ввода плановых начислений и удержаний
//
Процедура ПриВыводеСтрокиПлановыхНачислений(Элемент, ОформлениеСтроки, ДанныеСтроки, СведенияОВидахРасчета, ИспользуютсяТарифныеРазряды = Истина) Экспорт
		
	Если ОформлениеСтроки.Ячейки.Найти("Надбавка") = Неопределено Тогда
		СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.ВидРасчета);
	Иначе
		СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ДанныеСтроки.Надбавка);
	КонецЕсли; 
	
	ТолькоПросмотрЯчеек = Ложь;
	
	ЕстьПоказатели = Ложь;
	Для СчПоказателей = 1 По 4 Цикл
		УстановитьТолькоПросмотр = ТолькоПросмотрЯчеек;
		Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
			ЕстьПоказатели = Истина;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["Показатель" + СчПоказателей + "Наименование"]);
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Истина;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
		ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "НаименованиеВидимость"] И ИспользуютсяТарифныеРазряды Тогда
			ЕстьПоказатели = Истина;
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = Ложь;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].УстановитьТекст(СведенияОВидеРасчета["ПоказательТР" + СчПоказателей + "Наименование"]);
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Истина;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" +СчПоказателей].Видимость = Истина;
			КонецЕсли;
			
		Иначе
			ОформлениеСтроки.Ячейки["НаименованиеПоказатель" + СчПоказателей].Видимость = Ложь;
			Если ИспользуютсяТарифныеРазряды Тогда
				ОформлениеСтроки.Ячейки["НаименованиеПоказательТР" + СчПоказателей].Видимость = Ложь;
				ОформлениеСтроки.Ячейки["ТарифныйРазряд" + СчПоказателей].Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].Видимость = СведенияОВидеРасчета["Показатель" + СчПоказателей + "Видимость"];
		ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].Видимость = СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"];
		ОформлениеСтроки.Ячейки["Валюта" + СчПоказателей].ТолькоПросмотр = (НЕ СведенияОВидеРасчета["Валюта" + СчПоказателей + "Видимость"]) ИЛИ (УстановитьТолькоПросмотр);
		ОформлениеСтроки.Ячейки["Показатель" + СчПоказателей].ТолькоПросмотр = УстановитьТолькоПросмотр;
	КонецЦикла;
	
	Если не ЕстьПоказатели Тогда
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.УстановитьТекст("<ввод при расчете>");
		ОформлениеСтроки.Ячейки.НаименованиеПоказатель1.Видимость = Истина;
		ОформлениеСтроки.Ячейки["Показатель1"].ТолькоПросмотр = Истина;
		Если ИспользуютсяТарифныеРазряды Тогда
			ОформлениеСтроки.Ячейки["НаименованиеПоказательТР1"].Видимость = Ложь;
			ОформлениеСтроки.Ячейки["ТарифныйРазряд1"].Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ОформлениеСтроки.Ячейки.Показатели.Видимость = Ложь;
	
	Если Не ОформлениеСтроки.Ячейки.Найти("ОтражатьВРегламентированномУчете") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.ОтражатьВРегламентированномУчете.Видимость = ДанныеСтроки.Сотрудник.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьПредставлениеЭлементовСписка(ТипЗначенияЭлементов, СписокИстории, СохранятьСписокИстории)
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипЗначенияЭлементов);
	Если МетаданныеТипа = Неопределено
		 ИЛИ НЕ(Метаданные.Справочники.Содержит(МетаданныеТипа) 
		 		ИЛИ Метаданные.Документы.Содержит(МетаданныеТипа)
		 		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеТипа)) Тогда
		СписокИстории.Очистить();
		Возврат;
	КонецЕсли;	
	
	ИмяТаблицы = МетаданныеТипа.ПолноеИмя();
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	Ссылка КАК Ссылка, 
	|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Представление 
	|ИЗ " + ИмяТаблицы + " ГДЕ Ссылка В (&СписокЗначений)";
	
	Запрос.УстановитьПараметр("СписокЗначений", СписокИстории);
	Выборка = Запрос.Выполнить().Выбрать();
	
	КолвоЭлементовКоллекции = СписокИстории.Количество(); 
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл 
		ЭлементСписка = СписокИстории[КолвоЭлементовКоллекции - ОбратныйИндекс];
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(ЭлементСписка.Значение, "Ссылка") Тогда
			ЭлементСписка.Представление = Выборка.Представление;
		Иначе
			СписокИстории.Удалить(ЭлементСписка);
			СохранятьСписокИстории = Истина;
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры


// Процедура устанавливает доступность кнопки "ЗаполнитьИзТерминалаСбораДанных"
// в подменю "Заполнить" командной панели "КоманднаяПанельТовары".
//
// Параметры:
//  Форма - Форма документа, в из которого вызвана процедура.
//  Терминалы - массив доступных терминалов сбора данных.
//
Процедура УстановитьДоступностьКнопкиЗаполнитьИзТерминалаСбораДанных(Форма, Терминалы) Экспорт

	КнопкиКоманднойПанели = Форма.ЭлементыФормы.КоманднаяПанельТовары.Кнопки;
	КнопкаЗаполнить = КнопкиКоманднойПанели.ПодменюЗаполнить;

	Если Терминалы.Количество() = 0 Тогда
		КнопкаЗаполнить.Кнопки.Удалить(КнопкаЗаполнить.Кнопки.ИзТерминалаСбораДанных);
	КонецЕсли;

	Если КнопкаЗаполнить.Кнопки.Количество() = 0 Тогда
		КнопкиКоманднойПанели.Удалить(КнопкаЗаполнить);
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьКнопкиЗаполнитьИзТерминалаСбораДанных()


// Процедура обслуживает обработчики события НачалоВыбора ЭУ "СторнируемыйДокумент" или "ДокументОснование" табличной части
Процедура ОбработкаНачалоВыбораСторнируемогоДокумента(Элемент, Форма, Ссылка, Организация, СтандартнаяОбработка, ЭтоОсновныеНачисления, ДокументМенеджер = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если ДокументМенеджер = Неопределено Тогда
		
		СписокДляВыбора = Новый СписокЗначений;
		
		Если ЭтоОсновныеНачисления Тогда
			// основные начисления
			СписокДляВыбора.Добавить(Документы.НачислениеЗарплатыРаботникамОрганизаций, "Начисление зарплаты работникам организаций");		
			СписокДляВыбора.Добавить(Документы.НачислениеОтпускаРаботникамОрганизаций, "Начисление отпуска работникам организаций");
			СписокДляВыбора.Добавить(Документы.НачислениеПоБольничномуЛисту, "Начисление по больничному листу");
			СписокДляВыбора.Добавить(Документы.ОплатаПоСреднемуЗаработку, "Оплата по среднему заработку");
			СписокДляВыбора.Добавить(Документы.ОплатаПраздничныхИВыходныхДнейОрганизаций, "Оплата праздничных и выходных дней организаций");
			СписокДляВыбора.Добавить(Документы.ОплатаСверхурочныхЧасов, "Оплата сверхурочных часов");
			СписокДляВыбора.Добавить(Документы.РегистрацияПростоевРаботниковОрганизаций, "Регистрация простоев работников организаций");
			СписокДляВыбора.Добавить(Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций, "Регистрация разовых начислений работников организаций");
			СписокДляВыбора.Добавить(Документы.НевыходыВОрганизациях, "Невыходы в организациях");
			СписокДляВыбора.Добавить(Документы.Сторнирование, "Сторнирование");
			СписокДляВыбора.Добавить(Документы.ТабельУчетаРабочегоВремениОрганизации, "Табель учета рабочего времени организации");
			СписокДляВыбора.Добавить(Документы.ОтпускПоУходуЗаРебенком, "Отпуск по уходу за ребенком");
			
			
		Иначе
			// дополнительные начисления
			СписокДляВыбора.Добавить(Документы.НачислениеЗарплатыРаботникамОрганизаций, "Начисление зарплаты работникам организаций");
			СписокДляВыбора.Добавить(Документы.НачислениеОтпускаРаботникамОрганизаций, "Начисление отпуска работникам организаций");
			СписокДляВыбора.Добавить(Документы.ПремииРаботниковОрганизаций, "Премии работников организаций");
			СписокДляВыбора.Добавить(Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций, "Регистрация разовых начислений работников организаций");
			СписокДляВыбора.Добавить(Документы.НачислениеЕдиновременныхПособийЗаСчетФСС, "Начисление единовременных пособий за счет ФСС");
			СписокДляВыбора.Добавить(Документы.РасчетПриУвольненииРаботникаОрганизаций, "Расчет при увольнении работника организаций");
			СписокДляВыбора.Добавить(Документы.НачислениеДивидендовОрганизаций, "Начисление дивидендов организаций");
			СписокДляВыбора.Добавить(Документы.Сторнирование, "Сторнирование");
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтражениеЗарплатыВРеглУчете") Или
				ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасчетЕСН") Тогда
				
				СписокДляВыбора.Добавить(Документы.ПогашениеЗадолженностиПодотчетныхЛицВРегламентированномУчете, "Погашение задолженности подотчетных лиц в регламентированном учете");
				
			КонецЕсли; 
		КонецЕсли;
		
		ЭлементСписка = Форма.ВыбратьИзСписка(СписокДляВыбора,Элемент,);
		
		Если Не ЭлементСписка = Неопределено Тогда
			ФормаВыбора = ЭлементСписка.Значение.ПолучитьФормуВыбора( , Элемент, Ссылка);
			Если Не ЭлементСписка.Значение = Документы.Сторнирование Тогда
				ФормаВыбора.Отбор.Организация.Установить(Организация);
			КонецЕсли;
			ФормаВыбора.ПараметрТекущаяСтрока	= ?(ТипЗнч(ЭлементСписка.Значение.ПустаяСсылка()) = ТипЗнч(Элемент.Значение), Элемент.Значение, Неопределено);
			ФормаВыбора.Открыть();
		КонецЕсли;
		
	Иначе
		
		ФормаВыбора = ДокументМенеджер.ПолучитьФормуВыбора( , Элемент, Ссылка);
		Если Не ДокументМенеджер = Документы.Сторнирование Тогда
			ФормаВыбора.Отбор.Организация.Установить(Организация);
		КонецЕсли;
		ФормаВыбора.ПараметрТекущаяСтрока	= Элемент.Значение;
		ФормаВыбора.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// процедуры поддержки команд в журналах документов

////////////////////////////////////////////////////////////////////////////////
// процедуры поддержки команд в журналах документов

// Процедура дополняет переданный список значений видами документов, регистрируемых 
// в журнале и заполняет их представления
// 
// Параметры:
//	МетаданныеЖурнала - метаданные журнала
//  СписокВидов - необязательный. Дополняемый список значений
Процедура ДополнитьСписокВидовДокументов(МетаданныеЖурнала, СписокВидов) Экспорт
	Если СписокВидов = НеОпределено Тогда
		СписокВидов = Новый СписокЗначений;
	КонецЕсли;
	Для Каждого МетаданныеДокумента Из МетаданныеЖурнала.РегистрируемыеДокументы Цикл
		ВидДокумента = СписокВидов.НайтиПоЗначению(МетаданныеДокумента.Имя);
		Если ВидДокумента = НеОпределено Тогда
			СписокВидов.Добавить(МетаданныеДокумента.Имя, МетаданныеДокумента.Представление());
		Иначе
			Если НЕ ЗначениеЗаполнено(ВидДокумента.Представление) Тогда
				ВидДокумента.Представление = МетаданныеДокумента.Представление();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПоВидуДокументаСтрокой(ВидДокумента) Экспорт
	Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы[ВидДокумента]) Тогда
		Предупреждение("Нарушение прав доступа!");
		Возврат;
	КонецЕсли;
	ФормаНового = Документы[ВидДокумента].ПолучитьФормуНовогоДокумента();
	ФормаНового.Открыть();
	
КонецПроцедуры

Процедура ОткрытьПоВидуДокумента(ВидДокумента) Экспорт
	Если Не ПравоДоступа("Просмотр", Метаданные.Документы[ВидДокумента]) Тогда
		Предупреждение("Нарушение прав доступа!");
		Возврат;
	КонецЕсли;
	ФормаСписка = Документы[ВидДокумента].ПолучитьФормуСписка();
	ФормаСписка.Открыть();
КонецПроцедуры

Процедура ЖурналДокументовСписокПередНачаломДобавления(СписокВидовДокументов, Отказ, Копирование, Форма) Экспорт
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	СписокМеню = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокВидовДокументов Цикл
		Если ЭлементСписка.Значение <> НеОпределено Тогда
			СписокМеню.Добавить(ЭлементСписка.Значение, 
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
		КонецЕсли;
	КонецЦикла;
	ВыбранныйЭлемент = Форма.ВыбратьИзМеню(СписокМеню);
	Если ВыбранныйЭлемент <> НеОпределено Тогда
		РаботаСДиалогами.СоздатьПоВидуДокументаСтрокой(ВыбранныйЭлемент.Значение);
	КонецЕсли;
	
КонецПроцедуры

// Процедура вводит команды для создания документов и открытия форм 
// списков документов для журнала
// Параметры:
//	СписокВидовДокументов - список значений с видами документов строкой
//	КнопкиДобавить - массив подменю, в которые необходимо добавить команды создания документов
//	КнопкиОткрыть - массив подменю, в которые необходимо добавить команды открытия списков документов
//  ДействиеСоздать - действие команды создания документов
//  ДействиеОткрыть - действие команды открытия списков документов
// 
Процедура ВвестиКомандыПоВидамДокументов(СписокВидовДокументов, КнопкиДобавить, КнопкиОткрыть, 
	ДействиеСоздать, ДействиеОткрыть) Экспорт
	Для Каждого ВидДокумента Из СписокВидовДокументов Цикл
		Если ВидДокумента.Значение = НеОпределено Тогда  // разделитель
			Для Каждого Кнопки Из КнопкиДобавить Цикл
				Кнопки.Добавить(, ТипКнопкиКоманднойПанели.Разделитель);
			КонецЦикла;
			Для Каждого Кнопки Из КнопкиОткрыть Цикл
				Кнопки.Добавить(, ТипКнопкиКоманднойПанели.Разделитель);
			КонецЦикла;
		Иначе // команда
			Для Каждого Кнопки Из КнопкиДобавить Цикл
				Кнопки.Добавить(ВидДокумента.Значение, 
				ТипКнопкиКоманднойПанели.Действие, 
				ВидДокумента.Представление,
				ДействиеСоздать);
			КонецЦикла;
			Для Каждого Кнопки Из КнопкиОткрыть Цикл
				Кнопки.Добавить(ВидДокумента.Значение, 
				ТипКнопкиКоманднойПанели.Действие, 
				ВидДокумента.Представление,
				ДействиеОткрыть);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// возвращает истина если для документа определена печать по умолчанию иначе ложь
//
// Параметры
//  ИмяДокумента					- строка, имя документа
//  СоответствиеОписанияДокументов	- соответствие, содержит признак наличия у документа печатной формы
//
// Возвращаемое значение:
//   булево
//
Функция ДляДокументаОпределенаПечатьПоУмолчанию(ИмяДокумента, СоответствиеОписанияДокументов) Экспорт
	
	ЗначениеИзСоответствия = СоответствиеОписанияДокументов[ИмяДокумента];
	Если ЗначениеИзСоответствия = Неопределено Тогда
		МенеджерДокумента = Документы[ИмяДокумента];
		Попытка
			СтруктураВнутреннихПечатныхФорм = МенеджерДокумента.СоздатьДокумент().ПолучитьСтруктуруПечатныхФорм()
		Исключение
			СтруктураВнутреннихПечатныхФорм = Новый Структура;
		КонецПопытки;
		ДеревоМакетов = УниверсальныеМеханизмы.ПолучитьДеревоМакетовПечати(МенеджерДокумента.ПустаяСсылка(), СтруктураВнутреннихПечатныхФорм);
		СтрокаПоУмолчанию = УниверсальныеМеханизмы.ПолучитьСтрокуДереваМакетовПоУмолчанию(ИмяДокумента, ДеревоМакетов);
		ЗначениеИзСоответствия = СтрокаПоУмолчанию <> Неопределено; 
		СоответствиеОписанияДокументов.Вставить(ИмяДокумента, ЗначениеИзСоответствия);
	КонецЕсли;
	
	Возврат ЗначениеИзСоответствия;
	
КонецФункции // ДляДокументаОпределенаПечатьПоУмолчанию()

// Функция определяет доступность организаций
//
// Параметры
//  нет
//
// Возвращаемое значение:
//	ДоступностьОрганизаций - 	структура, определяет доступность нескольких организаций,
//  							нескольких головных организаций
//
Функция ДоступностьОрганизаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Организации.Ссылка,
	|	Организации.ГоловнаяОрганизация
	|ПОМЕСТИТЬ РазрешенныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	КОЛИЧЕСТВО(РазрешенныеОрганизации.Ссылка) КАК КоличествоОрганизаций
	|ПОМЕСТИТЬ ДоступныеОрганизации
	|ИЗ
	|	РазрешенныеОрганизации КАК РазрешенныеОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	КОЛИЧЕСТВО(РазрешенныеОрганизации.Ссылка) КАК КоличествоГоловныхОрганизаций
	|ПОМЕСТИТЬ ДоступныеГоловныеОрганизации
	|ИЗ
	|	РазрешенныеОрганизации КАК РазрешенныеОрганизации
	|ГДЕ
	|	РазрешенныеОрганизации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДоступныеОрганизации.КоличествоОрганизаций > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоступноНесколькоОрганизаций,
	|	ВЫБОР
	|		КОГДА ДоступныеГоловныеОрганизации.КоличествоГоловныхОрганизаций > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоступноНесколькоГоловныхОрганизаций
	|ИЗ
	|	ДоступныеОрганизации КАК ДоступныеОрганизации,
	|	ДоступныеГоловныеОрганизации КАК ДоступныеГоловныеОрганизации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ДоступностьОрганизаций = Новый Структура("ДоступноНесколькоОрганизаций,ДоступноНесколькоГоловныхОрганизаций");
	ЗаполнитьЗначенияСвойств(ДоступностьОрганизаций, Выборка);
	
	Возврат ДоступностьОрганизаций;
	
КонецФункции

// Процедура определяет необходимость быстрого отбора по организации, 
//  устанавливает его, если такая необходимость есть, или скрывает, если ее нет
//
// Параметры
//  Форма 							- форма списка документов или журнала документов
//  ИмяСпискаДокументов				- строка, имя реквизита содержащего список документов
//
Процедура НастроитьОтборПоОрганизации(Форма, ИмяСпискаДокументов, ОтборПоГоловнойОрганизации = Ложь) Экспорт
	
	ДоступностьОрганизаций = ДоступностьОрганизаций();
	ОтборДоступен = ?(ОтборПоГоловнойОрганизации, ДоступностьОрганизаций.ДоступноНесколькоГоловныхОрганизаций, ДоступностьОрганизаций.ДоступноНесколькоОрганизаций);
	
	ЭлементыФормы = Форма.ЭлементыФормы;
	ЭлементыФормы[ИмяСпискаДокументов].Колонки.Организация.Видимость = ОтборДоступен;
	
	// если элемент управления отбором размещен на панеле - управляем сверткой
	// если нет - видимостью
	Если ЭлементыФормы.Найти("ПанельОтборПоОрганизации") = Неопределено Тогда
		ЭлементыФормы.ОрганизацияФлаг.Видимость = ОтборДоступен;
		ЭлементыФормы.Организация.Видимость 	= ОтборДоступен;
	Иначе
		ЭлементыФормы.ПанельОтборПоОрганизации.Свертка = ?(ОтборДоступен, РежимСверткиЭлементаУправления.Нет, РежимСверткиЭлементаУправления.Верх);
	КонецЕсли;
	
	Если ОтборДоступен Тогда
		УстановитьБыстрыйОтборПоОрганизации(Форма, ИмяСпискаДокументов, ОтборПоГоловнойОрганизации);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - общая часть обработок оповещения форм списков документов и журналов документов
//
// Параметры
//  Форма 							- форма списка документов или журнала документов
//  ИмяСпискаДокументов				- строка, имя реквизита содержащего список документов
//
Процедура ОбработкаОповещенияСпискаДокументов(ИмяСобытия, Параметр, Источник, Форма, ИмяСпискаДокументов, ОтборПоГоловнойОрганизации = Ложь) Экспорт
		
	Если ИмяСобытия = "ЗаписьПользователя" И Параметр = глЗначениеПеременной("глТекущийПользователь") Тогда
		УстановитьБыстрыйОтборПоОрганизации(Форма, ИмяСпискаДокументов, ОтборПоГоловнойОрганизации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаИзмененияБыстрогоОтбораПоОрганизации(Форма, Элемент, ИмяСпискаДокументов) Экспорт
	
	Если Элемент.Значение = Неопределено Тогда
		Элемент.Значение = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Форма[ИмяСпискаДокументов].Отбор.Организация.Использование = ЗначениеЗаполнено(Элемент.Значение);

КонецПроцедуры

Процедура УстановитьБыстрыйОтборПоОрганизации(Форма, ИмяСпискаДокументов, ОтборПоГоловнойОрганизации) 
	
	ОсновнаяОрганизацияПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если ОтборПоГоловнойОрганизации 
		И ЗначениеЗаполнено(ОсновнаяОрганизацияПользователя) 
		И ЗначениеЗаполнено(ОсновнаяОрганизацияПользователя.ГоловнаяОрганизация) Тогда
		ОсновнаяОрганизацияПользователя = ОсновнаяОрганизацияПользователя.ГоловнаяОрганизация;
	КонецЕсли;
	
	Форма[ИмяСпискаДокументов].Отбор.Организация.Установить(ОсновнаяОрганизацияПользователя, ЗначениеЗаполнено(ОсновнаяОрганизацияПользователя));	
		
КонецПроцедуры

////

// Процедура перезапуска сеанса работы с программой
Процедура ПерезапуститьСеансРаботыСПрограммой() Экспорт
	
	глЗапрашиватьПодтверждениеПриЗакрытии = глЗначениеПеременной("глЗапрашиватьПодтверждениеПриЗакрытии");
	Если глЗапрашиватьПодтверждениеПриЗакрытии Тогда
		глЗначениеПеременнойУстановить("глЗапрашиватьПодтверждениеПриЗакрытии", Ложь);	
	КонецЕсли;
	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СОХРАНЕНИЯ ОЧИЩАЕМЫХ РЕКВИЗИТОВ ОБЪЕКТА

// Сохраняет значение реквизита объекта и очищает реквизит. 
//
Процедура СохранитьЗначениеРеквизитаФормы(ИмяРеквизита, Форма, СтруктураРеквизитов) Экспорт
	
	Если НЕ Форма.ЭлементыФормы[ИмяРеквизита].Доступность Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов.Вставить(ИмяРеквизита, Форма.ЭлементыФормы[ИмяРеквизита].Значение);
	
	Форма.ЭлементыФормы[ИмяРеквизита].Значение = ОбщегоНазначения.ПустоеЗначениеТипа(ТипЗнч(Форма.ЭлементыФормы[ИмяРеквизита].Значение));
	
КонецПроцедуры // СохранитьЗначениеРеквизита()

// Восстанавливает значение реквизита объекта.
//
Процедура ВосстановитьЗначениеРеквизитаФормы(ИмяРеквизита, Форма, СтруктураРеквизитов) Экспорт
	
	Если СтруктураРеквизитов.Свойство(ИмяРеквизита) Тогда
		Форма.ЭлементыФормы[ИмяРеквизита].Значение = СтруктураРеквизитов[ИмяРеквизита];
	КонецЕсли;
	
КонецПроцедуры // ВосстановитьЗначениеРеквизита()

////////////////////////////////////////////////////////////////////////////////

Процедура ВывестиДополненияКОписанию()Экспорт
	
	ФормаОбновлений = Обработки.ОбновлениеИнформационнойБазы.ПолучитьФорму();
	ФормаОбновлений.ВывестиМакетОписаниеОбновлений();
	ФормаОбновлений.Открыть();
	
КонецПроцедуры

Процедура ВывестиПредупреждение(Текст = "", Заголовок = "") Экспорт

	Предупреждение(Текст, , Заголовок);

КонецПроцедуры

Функция ЗадатьВопрос(ТекстВопроса = "", Режим = "", КнопкаПоУмолчанию = Неопределено, Заголовок = "") Экспорт

	Возврат Вопрос(ТекстВопроса, Режим, , КнопкаПоУмолчанию, Заголовок)

КонецФункции

Функция НайтиСтатьиНалоговойДекларацииПоТексту(Текст, ВидДекларации, НаборСтатей = Неопределено)

	СписокНайденных = Новый СписокЗначений;
		
	Если НаборСтатей = Неопределено Тогда
		//подбирать надо среди всей декларации
		СписокСтатей = СформироватьСодержимоеДекларации(ВидДекларации);
	Иначе 
		//подбирать надо по набору
		СписокСтатей = СформироватьСодержимоеНабораСтатей(НаборСтатей);
	КонецЕсли;
	ДлинаТекста = СтрДлина(СокрЛП(Текст));
	
	Для каждого ЭлементСписка Из СписокСтатей Цикл
		Если ВРег(Сред(ЭлементСписка.Представление,1,ДлинаТекста)) = ВРег(СокрЛП(Текст)) Тогда
			СписокНайденных.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНайденных;

КонецФункции

Процедура АвтоПодборТекстаСтатьяНалоговойДекларации(Форма, Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ВидДекларации, НаборСтатей = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СписокНайденных = НайтиСтатьиНалоговойДекларацииПоТексту(Текст, ВидДекларации, НаборСтатей);
	Если СписокНайденных.Количество()>0 Тогда
		Результат = Форма.ВыбратьИзСписка(СписокНайденных,Элемент);
		Если НЕ Результат = Неопределено Тогда
			ТекстАвтоПодбора 	= Результат.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОкончаниеВводаТекстаСтатьяНалоговойДекларации(Элемент, Текст, Значение, СтандартнаяОбработка, ВидДекларации, НаборСтатей = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Значение = НайтиСтатьиНалоговойДекларацииПоТексту(Текст, ВидДекларации, НаборСтатей);
	
КонецПроцедуры

// ПРОЦЕДУРЫ РАБОТЫ СО СТАТЬЯМИ НАЛОГОВЫХ ДЕКЛАРАЦИЙ
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Функция получает сведения о составе комиссии, занимаемых должностях членами комиссии для вывода
// в печатные формы документов.
//
// Параметры:
//  ДокументОбъект – Тип: ДокументОбъект – Распечатываемый документ
//                 
//
// Возвращаемое значение:
//   Тип:   Выборка из запроса – Сведения о составе комиссии, должностях и ФИО членов комиссии 
//
Функция ПолучитьСведенияОКомиссии(ДокументОбъект) Экспорт
		
	
	//Получим информацию о председателе комиссии.
	МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаДату",				ДокументОбъект.Дата);
    Запрос.УстановитьПараметр("ПК",					ДокументОбъект.ПредседательКомиссии);
	Запрос.УстановитьПараметр("Организация", 		ДокументОбъект.Организация);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, РаботникиОрганизацийСрезПоследних.Сотрудник) КАК ФИО,
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ПОМЕСТИТЬ ПК
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	               |			&НаДату,
	               |			Сотрудник.ФизЛицо = &ПК
				   |				И Организация = &организация
	               |				И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	               |				И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПК.ФИО КАК ПредседательКомиссииФИО,
	               |	ПК.Должность КАК ПредседательКомиссииДолжность
	               |ИЗ
	               |	ПК КАК ПК";
				   
	ПК = Запрос.Выполнить().Выбрать();
	ПК.Следующий();
	
	СоставКомиссии = Новый Структура;
	СоставКомиссии.Вставить("ПредседательКомиссииФИО" ,ПК.ПредседательКомиссииФИО);
	СоставКомиссии.Вставить("ПредседательКомиссииДолжность", ПК.ПредседательКомиссииДолжность);
	
	//Получим информацию о первом члене комиссии
	МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаДату",				ДокументОбъект.Дата);
    Запрос.УстановитьПараметр("ЧК1",				ДокументОбъект.ПервыйЧленКомиссии);
	Запрос.УстановитьПараметр("Организация", 		ДокументОбъект.Организация);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, РаботникиОрганизацийСрезПоследних.Сотрудник) КАК ФИО,
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ПОМЕСТИТЬ ЧК1
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	               |			&НаДату,
	               |			Сотрудник.ФизЛицо = &ЧК1
				   |				И Организация = &Организация
	               |				И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	               |				И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧК1.ФИО КАК ПервыйЧленКомиссииФИО,
	               |	ЧК1.Должность КАК ПервыйЧленКомиссииДолжность
	               |ИЗ
	               |	ЧК1 КАК ЧК1";
				   
	ЧК1 = Запрос.Выполнить().Выбрать();
	ЧК1.Следующий();
	
	СоставКомиссии.Вставить("ПервыйЧленКомиссииФИО", ЧК1.ПервыйЧленКомиссииФИО);
	СоставКомиссии.Вставить("ПервыйЧленКомиссииДолжность", ЧК1.ПервыйЧленКомиссииДолжность);
	
	//Получим информацию о втором члене комиссии
	МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаДату",				ДокументОбъект.Дата);
    Запрос.УстановитьПараметр("ЧК2",				ДокументОбъект.ВторойЧленКомиссии);
	Запрос.УстановитьПараметр("Организация", 		ДокументОбъект.Организация);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, РаботникиОрганизацийСрезПоследних.Сотрудник) КАК ФИО,
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ПОМЕСТИТЬ ЧК2
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	               |			&НаДату,
	               |			Сотрудник.ФизЛицо = &ЧК2
				   |				И Организация = &Организация
	               |				И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	               |				И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧК2.ФИО КАК ВторойЧленКомиссииФИО,
	               |	ЧК2.Должность КАК ВторойЧленКомиссииДолжность
	               |ИЗ
	               |	ЧК2 КАК ЧК2";
				   
	ЧК2 = Запрос.Выполнить().Выбрать();
	ЧК2.Следующий();
	
	СоставКомиссии.Вставить("ВторойЧленКомиссииФИО", ЧК2.ВторойЧленКомиссииФИО);
	СоставКомиссии.Вставить("ВторойЧленКомиссииДолжность", ЧК2.ВторойЧленКомиссииДолжность);

	//Получим информацию о третьем члене комиссии
	МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаДату",				ДокументОбъект.Дата);
    Запрос.УстановитьПараметр("ЧК3",				ДокументОбъект.ТретийЧленКомиссии);
	Запрос.УстановитьПараметр("Организация", 		ДокументОбъект.Организация);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, РаботникиОрганизацийСрезПоследних.Сотрудник) КАК ФИО,
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ПОМЕСТИТЬ ЧК3
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	               |			&НаДату,
	               |			Сотрудник.ФизЛицо = &ЧК3
				   |				И Организация = &Организация
	               |				И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	               |				И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧК3.ФИО КАК ТретийЧленКомиссииФИО,
	               |	ЧК3.Должность КАК ТретийЧленКомиссииДолжность
	               |ИЗ
	               |	ЧК3 КАК ЧК3";
				   
	ЧК3 = Запрос.Выполнить().Выбрать();
	ЧК3.Следующий();
	
	СоставКомиссии.Вставить("ТретийЧленКомиссииФИО", ЧК3.ТретийЧленКомиссииФИО);
	СоставКомиссии.Вставить("ТретийЧленКомиссииДолжность", ЧК3.ТретийЧленКомиссииДолжность);


	Возврат СоставКомиссии;

КонецФункции // ПолучитьСведенияОКомиссии()

// Процедура вызывается из обработчика "Нажатие" кнопки "КнопкаВыбратьСоставКомиссии". 
// Она открывает форму выбора регистра сведений "СоставКомиссии".
//
// Параметры
//  ДокументОбъект – Тип: ДокументОбъект – Документ, в котором нужно заполнять
//                                         состав комиссии
//  Владелец       - Тип: Форма          - Форма, в которой заполняется состав
//                 
//
Процедура ВыбратьСоставКомиссии(ДокументОбъект, Владелец) Экспорт

	ФормаВыбора = РегистрыСведений.СоставКомиссий.ПолучитьФормуСписка("ФормаВыбора", Владелец);
	ФормаВыбора.ДокументОбъект           = ДокументОбъект;
	ФормаВыбора.ПараметрОтборПоИзмерению = Новый Структура("Организация", ДокументОбъект.Организация);
	ФормаВыбора.РежимВыбора              = Истина;
	ФормаВыбора.ЗакрыватьПриВыборе       = Истина;
	ФормаВыбора.Открыть();

КонецПроцедуры // ВыбратьСоставКомиссии()

// Процедура вызывается из НачалоВыбораТипа() и открывает формы выбора для выбранного типа.
//
Процедура ОткрытьФормуДляВыбораЗначения(МетаданныеТипа, Элемент)

	Если Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
		ФормаВыбора = Справочники[МетаданныеТипа.Имя].ПолучитьФормуВыбора(, Элемент);
	Иначе
		ФормаВыбора = Документы[МетаданныеТипа.Имя].ПолучитьФормуВыбора(, Элемент);
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // ОткрытьФормуДляВыбораЗначения()

// Данная процедура облегчает выбор типа пользователем,
// для поля ввода с составным типом данных. 
// В составной тип данных должны входить только
// Справочники и документы.
// Процедура сначала обрабатывает ограничение типа, и только
// если оно не установлено, берется тип значения поля ввода.
//
// Параметры
// 	Элемент               – Тип: ПолеВвода – Поле ввода с составным типом
//                 
//  СтандартнаяОбработка  – Тип: Булево – Флаг стандартной обработки
//                 
//  Форма                 – Тип: Форма – Форма, которой принадлежит поле ввода.
//                 
//
Процедура НачалоВыбораТипа(Элемент, СтандартнаяОбработка, Форма) Экспорт

	Если Элемент.Значение = Неопределено Тогда
		// Выбор типа
		
		СтандартнаяОбработка = Ложь;
		
		СписокТипов = Новый СписокЗначений;
		// Сначала типы берутся из ограничения типов.
		МассивТипов = Элемент.ОграничениеТипа.Типы();
		
		Если МассивТипов.Количество() = 0 Тогда
			// Тогда типы берутся из типа значения
			
			МассивТипов = Элемент.ТипЗначения.Типы();
			
		КонецЕсли;
		
		КоличествоТипов = МассивТипов.Количество();
		
		Если КоличествоТипов = 1 Тогда
			// Выбирать нет необходимости
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(МассивТипов[0]);
			ОткрытьФормуДляВыбораЗначения(МетаданныеТипа, Элемент);
			Возврат;
			
		КонецЕсли;
		
		ШиринаСписка = 0;
		
		Для каждого Тип Из МассивТипов Цикл
		
			МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
			Представление  = МетаданныеТипа.Представление();
			ШиринаСписка   = Макс(ШиринаСписка, СтрДлина(Представление) + 10);
			СписокТипов.Добавить(МетаданныеТипа, Представление);
		
		КонецЦикла;
		
		Элемент.ВысотаСпискаВыбора = Мин(15 , КоличествоТипов);
		Элемент.ШиринаСпискаВыбора = Мин(120, ШиринаСписка);
		
		Результат = Форма.ВыбратьИзСписка(СписокТипов,Элемент);
		
		Если Результат <> Неопределено Тогда
			
			ОткрытьФормуДляВыбораЗначения(Результат.Значение, Элемент);
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры // НачалоВыбораТипа()

// Проверяет принадлежность ФизЛица к Подразделению
//
// Параметры
// 	ФизЛицо           – Тип: Справочник.ФизЛица  – проверяемое ФизЛицо
//                 
//  Подразделение     – Тип: Справочник.Подразделения – проверяемое подразделение 
//  
//	НаДату            - Тип: Дата, МоментВремени - на какую дату проверять,
//                                                 если неопределно, то на самую последню
//
//	Спрашивать          - Тип: Булево            - Истина - спрашивать
//	                                               о не соответствии
//
//  ОчищатьФизЛицо      - Тип: Булево            - Истина - очистить параметр ФизЛицо,
//                                                 если не то подразделение;
//                                                 Имеет более высокий приоритет, чем
//                                                 Менять подразделение;
//	                                           
//  МенятьПодразделение - Тип: Булево            - Истина - в параметр подразделние
//                                                 запишится подразделение, в котором
//                                                 числится работник; 
//	                                           
//	ИмяПоля           - Тип: Строка              - наименование поля (для предупреждения),
//	                                               которое будет очищено через параметр 
//                                                 ФизЛицо или изменится через параметр
//                                                 Подразделение;
//
// Возвращаемое значение:
//   Булево - ФизЛицо числится или нет
//
//
Функция ФизЛицоЧислитсяВПодразделении(ФизЛицо, Подразделение, 
	                                                Знач НаДату         = Неопределено,
	                                                ОчищатьФизЛицо      = Ложь,
	                                                МенятьПодразделение = Истина,
	                                                Спрашивать          = Истина,
											        ИмяПоля             = Неопределено ) Экспорт
													
	Если НЕ ЗначениеЗаполнено(ФизЛицо) 
	 ИЛИ (НЕ ЗначениеЗаполнено(Подразделение) И ОчищатьФизЛицо) Тогда

		Возврат Ложь;
		
	КонецЕсли;									 
										 
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату",        НаДату);
	Запрос.УстановитьПараметр("ФизЛицо",       ФизЛицо);
	Запрос.УстановитьПараметр("Подразделение", ?(НЕ ЗначениеЗаполнено(Подразделение), Неопределено, Подразделение));
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Работники.Подразделение КАК Подразделение,
	               |	ВЫБОР 
			   	   |		КОГДА Работники.Подразделение В ИЕРАРХИИ (&Подразделение)
			       |			ТОГДА ИСТИНА 
			       |		ИНАЧЕ ЛОЖЬ 
				   |	КОНЕЦ                   КАК Числится
	               |ИЗ
	               |	РегистрСведений.Работники.СрезПоследних(&НаДату, ФизЛицо = &ФизЛицо) КАК Работники
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Числится УБЫВ";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
					   
		Числится               = Ложь;
		ПодразделениеРаботника = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
        Числится               = Выборка.Числится;
		ПодразделениеРаботника = Выборка.Подразделение;
		
	КонецЕсли;
	
	Если Не Числится Тогда
		
		ТекстСообщения = "На дату " + Формат(НаДату, "ДЛФ=D") + " сотрудник """ + ФизЛицо
			              + """ " + Символы.ПС + "не числится в подразделении """
			              + Подразделение + """.";
		
		Если ОчищатьФизЛицо Тогда
			
			Если Спрашивать Тогда
				
				ИмяПоля = ?(НЕ ЗначениеЗаполнено(ИмяПоля), "МОЛ", ИмяПоля);
				Ответ = Вопрос(ТекстСообщения + Символы.ПС + 
				               "Очистить поле ввода """ + ИмяПоля + """?", 
							   РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					
					ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
					
				КонецЕсли;
				
			Иначе
				
				ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли МенятьПодразделение Тогда
			
			Если Спрашивать И (ЗначениеЗаполнено(Подразделение)) Тогда
				
				ИмяПоля = ?(НЕ ЗначениеЗаполнено(ИмяПоля), "Подразделение", ИмяПоля);
				Ответ = Вопрос(ТекстСообщения + Символы.ПС + 
				               "Заменить значение поля ввода """ + ИмяПоля + """ на """
							   + ПодразделениеРаботника + """?", 
							   РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					
					Подразделение    = ПодразделениеРаботника;
					
				КонецЕсли;
				
			Иначе
				
				Подразделение    = ПодразделениеРаботника;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Числится;

КонецФункции // ФизЛицоЧислитсяВПодразделении()

// Проверяет принадлежность ФизЛица к ПодразделениюОрганизации
//
// Параметры
// 	ФизЛицо           – Тип: Справочник.ФизЛица  – проверяемое ФизЛицо
//                 
//  Подразделение     – Тип: Справочник.ПодразделенияОрганизации – проверяемое подразделение организации
//  
//	НаДату            - Тип: Дата, МоментВремени - на какую дату проверять,
//                                                 если неопределно, то на самую последню
//
//	Спрашивать          - Тип: Булево            - Истина - спрашивать
//	                                               о не соответствии
//
//  ОчищатьФизЛицо      - Тип: Булево            - Истина - очистить параметр ФизЛицо,
//                                                 если не то подразделение;
//                                                 Имеет более высокий приоритет, чем
//                                                 Менять подразделение;
//	                                           
//  МенятьПодразделение - Тип: Булево            - Истина - в параметр подразделние
//                                                 запишится подразделение, в котором
//                                                 числится работник; 
//	                                           
//	ИмяПоля           - Тип: Строка              - наименование поля (для предупреждения),
//	                                               которое будет очищено через параметр 
//                                                 ФизЛицо или изменится через параметр
//                                                 Подразделение;
//
// Возвращаемое значение:
//   Булево - ФизЛицо числится или нет
//
//
Функция ФизЛицоЧислитсяВПодразделенииОрганизации(ФизЛицо, Подразделение, 
	                                                Знач НаДату         = Неопределено,
	                                                ОчищатьФизЛицо      = Ложь,
	                                                МенятьПодразделение = Истина,
	                                                Спрашивать          = Истина,
											        ИмяПоля             = Неопределено ) Экспорт
													
	Если НЕ ЗначениеЗаполнено(ФизЛицо) 
	 ИЛИ (НЕ ЗначениеЗаполнено(Подразделение) И ОчищатьФизЛицо) Тогда

		Возврат Ложь;
		
	КонецЕсли;									 
										 
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату",        НаДату);
	Запрос.УстановитьПараметр("ФизЛицо",       ФизЛицо);
	Запрос.УстановитьПараметр("Подразделение", ?(НЕ ЗначениеЗаполнено(Подразделение), Неопределено, Подразделение));
	
	МассивВидЗанятости = Новый Массив(2);
	МассивВидЗанятости[0] = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
	МассивВидЗанятости[1] = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
	Запрос.УстановитьПараметр("ОсновнойРаботник", МассивВидЗанятости);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Работники.ПодразделениеОрганизации КАК Подразделение,
	               |	ВЫБОР 
			   	   |		КОГДА Работники.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
			       |			ТОГДА ИСТИНА 
			       |		ИНАЧЕ ЛОЖЬ 
				   |	КОНЕЦ                                         КАК Числится
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НаДату, 
				   |	                Сотрудник.ФизЛицо = &ФизЛицо) КАК Работники
	               |
	               |УПОРЯДОЧИТЬ ПО
				   |	Числится УБЫВ";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
					   
		Числится               = Ложь;
		ПодразделениеРаботника = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
        Числится               = Выборка.Числится;
		ПодразделениеРаботника = Выборка.Подразделение;
		
	КонецЕсли;
	
	Если Не Числится Тогда
		
		ТекстСообщения = "На дату " + Формат(НаДату, "ДЛФ=D") + " сотрудник """ + ФизЛицо
			              + """ " + Символы.ПС + "не числится в подразделении """
			              + Подразделение + """.";
		
		Если ОчищатьФизЛицо Тогда
			
			Если Спрашивать Тогда
				
				ИмяПоля = ?(НЕ ЗначениеЗаполнено(ИмяПоля), "МОЛ организации", ИмяПоля);
				Ответ = Вопрос(ТекстСообщения + Символы.ПС + 
				               "Очистить поле ввода """ + ИмяПоля + """?", 
							   РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					
					ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
					
				КонецЕсли;
				
			Иначе
				
				ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли МенятьПодразделение Тогда
			
			Если Спрашивать И (ЗначениеЗаполнено(Подразделение)) Тогда
				
				ИмяПоля = ?(НЕ ЗначениеЗаполнено(ИмяПоля), "Подразделение организации", ИмяПоля);
				Ответ = Вопрос(ТекстСообщения + Символы.ПС + 
				               "Заменить значение поля ввода """ + ИмяПоля + """ на """
							   + ПодразделениеРаботника + """?", 
							   РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					
					Подразделение    = ПодразделениеРаботника;
					
				КонецЕсли;
				
			Иначе
				
				Подразделение    = ПодразделениеРаботника;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Числится;

КонецФункции // ФизЛицоЧислитсяВПодразделенииОрганизации()


// Вызывается в обработчике события "Начало выбора" при выборе налогового назначения.
// Используется для фильтрации по хозяйственной ситуации и дате документа
Процедура НачалоВыбораЗначенияНалоговоеНазначение(Элемент, СтандартнаяОбработка, ГруппаНалоговогоНазначения, ДатаДокумента = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПолучитьФормуВыбора("ФормаВыбора", Элемент,);

	ФормаВыбора.СправочникСписок.Отбор.ГруппаНалоговогоНазначения.ВидСравнения 	= ВидСравнения.Равно;
	ФормаВыбора.СправочникСписок.Отбор.ГруппаНалоговогоНазначения.Значение 		= ГруппаНалоговогоНазначения;
	ФормаВыбора.СправочникСписок.Отбор.ГруппаНалоговогоНазначения.Использование = Истина;
	
	ФормаВыбора.ПараметрТекущаяСтрока = Элемент.Значение;
	ФормаВыбора.Открыть();

	
КонецПроцедуры // НачалоВыбораЗначенияНалоговоеНазначение

Процедура АвтоПодборТекстаНалоговоеНазначение(Форма, Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ГруппаНалоговогоНазначения, ДатаДокумента = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СписокНайденных = НалоговыйУчетПовтИсп.НайтиНалоговыеНазначенияПоТексту(
		Текст, 
		ГруппаНалоговогоНазначения, 
		ДатаДокумента
	);
	Если СписокНайденных.Количество() > 0 Тогда
		Результат = Форма.ВыбратьИзСписка(СписокНайденных, Элемент);
		Если НЕ Результат = Неопределено Тогда
			ТекстАвтоПодбора = Результат.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // АвтоПодборТекстаНалоговоеНазначение

Процедура ОкончаниеВводаТекстаНалоговоеНазначение(Элемент, Текст, Значение, СтандартнаяОбработка, ГруппаНалоговогоНазначения, ДатаДокумента = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Значение = НалоговыйУчетПовтИсп.НайтиНалоговыеНазначенияПоТексту(
		Текст, 
		ГруппаНалоговогоНазначения, 
		ДатаДокумента
	);
	
КонецПроцедуры // ОкончаниеВводаТекстаНалоговоеНазначение

Процедура НачалоВыбораЗначенияНалоговаяГруппаОС(ЭлементФормы, СтандартнаяОбработка, ВидНалоговойГруппыНА) Экспорт

	СтандартнаяОбработка = Ложь;
	ФормаВыбора          = Справочники.НалоговыеГруппыОсновныхСредств.ПолучитьФормуВыбора(,ЭлементФормы,);

	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойГруппыНА.ВидСравнения 	= ВидСравнения.Равно;
	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойГруппыНА.Значение 		= ВидНалоговойГруппыНА;
	ФормаВыбора.СправочникСписок.Отбор.ВидНалоговойГруппыНА.Использование = Истина;
	
    ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = ЭлементФормы.Значение;
	ФормаВыбора.Открыть();

КонецПроцедуры // НачалоВыбораЗначенияНалоговаяГруппаОС()

Функция НайтиНалоговуюГруппуОСПоТексту(Текст, ВидНалоговойГруппыНА)
	
	СписокНайденных = Новый СписокЗначений;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНалоговойГруппыНА", ВидНалоговойГруппыНА);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НалоговыеГруппыОсновныхСредств.Ссылка КАК НалоговаяГруппаОС,
	               |	ПРЕДСТАВЛЕНИЕ(НалоговыеГруппыОсновныхСредств.Ссылка) КАК НалоговаяГруппаОСПредставление
	               |ИЗ
	               |	Справочник.НалоговыеГруппыОсновныхСредств КАК НалоговыеГруппыОсновныхСредств
	               |ГДЕ
	               |	НалоговыеГруппыОсновныхСредств.ВидНалоговойГруппыНА = &ВидНалоговойГруппыНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НалоговыеГруппыОсновныхСредств.Код";
	Результат = Запрос.Выполнить().Выбрать();
	
	ДлинаТекста = СтрДлина(СокрЛП(Текст));
	
	Пока Результат.Следующий() Цикл
		Если ВРег(Сред(Результат.НалоговаяГруппаОСПредставление,1,ДлинаТекста)) = ВРег(СокрЛП(Текст)) Тогда
			СписокНайденных.Добавить(Результат.НалоговаяГруппаОС,Результат.НалоговаяГруппаОСПредставление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНайденных;
	
КонецФункции

Процедура АвтоПодборТекстаНалоговаяГруппаОС(Форма, Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ВидНалоговойГруппыНА) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СписокНайденных = НайтиНалоговуюГруппуОСПоТексту(Текст, ВидНалоговойГруппыНА);
	Если СписокНайденных.Количество()>0 Тогда
		Результат = Форма.ВыбратьИзСписка(СписокНайденных,Элемент);
		Если НЕ Результат = Неопределено Тогда
			ТекстАвтоПодбора 	= Результат.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОкончаниеВводаТекстаНалоговаяГруппаОС(Элемент, Текст, Значение, СтандартнаяОбработка, ВидНалоговойГруппыНА) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Значение = НайтиНалоговуюГруппуОСПоТексту(Текст, ВидНалоговойГруппыНА);
	
КонецПроцедуры


Процедура ОтобразитьОписаниеСтатьиДекларацииВСпискеСтатейЗатрат(ОформленияСтрок) Экспорт
	
	МассивСтатей = Новый Массив;
	
	Для каждого ОформлениеСтроки  Из ОформленияСтрок Цикл
		
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.СтатьяДекларацииПоНалогуНаПрибыль) Тогда
			МассивСтатей.Добавить(ДанныеСтроки.СтатьяДекларацииПоНалогуНаПрибыль);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиНалоговыхДеклараций.Ссылка,
	               |	СтатьиНалоговыхДеклараций.Описание
	               |ИЗ
	               |	Справочник.СтатьиНалоговыхДеклараций КАК СтатьиНалоговыхДеклараций
	               |ГДЕ
	               |	СтатьиНалоговыхДеклараций.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка",МассивСтатей);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для каждого ОформлениеСтроки  Из ОформленияСтрок Цикл
		
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.СтатьяДекларацииПоНалогуНаПрибыль) Тогда
			Выборка.Сбросить();			
			Если Выборка.НайтиСледующий(ДанныеСтроки.СтатьяДекларацииПоНалогуНаПрибыль,"Ссылка") Тогда
				ОформлениеСтроки.Ячейки.ОписаниеСтатьиДекларации.УстановитьТекст(Выборка.Описание);
			КонецЕсли;
		ИначеЕсли ДанныеСтроки.СтатьяДекларацииПоНалогуНаПрибыль = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка() Тогда
			ОформлениеСтроки.Ячейки.ОписаниеСтатьиДекларации.УстановитьТекст(НСтр("ru='Для затрат, которые не признаются в н/у (не отражаются в ""Декларации по налогу на прибыль"")';uk='Для витрат, що не визнаються у п/о (не відображаються у ""Декларації з податку на прибуток"")'"))
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриИзмененииСчетаСубконтоЗатрат(
	СтрокаТабличнойЧасти, 
	ЕстьСубконто = Ложь, 
	ЕстьРеквизитНалоговоеНазначение = Истина, 
	ИмяСчетаЗатрат = "СчетЗатрат", 
	ИмяСубконто = "Субконто",
	ИмяНалоговогоНазначенияДоходовИЗатрат = "НалоговоеНазначениеДоходовИЗатрат"
	) Экспорт
	
	Если ЕстьСубконто Тогда
		Субконто1 = СтрокаТабличнойЧасти[ИмяСубконто+"1"];
		Субконто2 = СтрокаТабличнойЧасти[ИмяСубконто+"2"];
		Субконто3 = СтрокаТабличнойЧасти[ИмяСубконто+"3"];
	Иначе
		Субконто1 = Неопределено;
		Субконто2 = Неопределено;
		Субконто3 = Неопределено;
	КонецЕсли; 
	
	ГруппаНалоговогоНазначенияЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(
		СтрокаТабличнойЧасти[ИмяСчетаЗатрат], 
		Субконто1, 
		Субконто2, 
		Субконто3
	);
	
	Если ГруппаНалоговогоНазначенияЗатрат <> СтрокаТабличнойЧасти[ИмяНалоговогоНазначенияДоходовИЗатрат].ГруппаНалоговогоНазначения Тогда
		СтрокаТабличнойЧасти[ИмяНалоговогоНазначенияДоходовИЗатрат] = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка(); 
		Если ЕстьРеквизитНалоговоеНазначение И ГруппаНалоговогоНазначенияЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда
			СтрокаТабличнойЧасти[ИмяНалоговогоНазначенияДоходовИЗатрат] = СтрокаТабличнойЧасти.НалоговоеНазначение;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриИзмененииСчетаСубконтоЗатрат()

Процедура ПриИзмененииСчетаСубконтоЗатратВШапке(
	ДокОбъект, 
	ЕстьСубконто = Ложь, 
	ЕстьРеквизитНалоговоеНазначение = Истина, 
	ИмяСчетаЗатрат = "СчетДт", 
	ИмяСубконто = "СубконтоДт"
	) Экспорт 
	
	Если ЕстьСубконто Тогда
		Субконто1 = ДокОбъект[ИмяСубконто+"1"];
		Субконто2 = ДокОбъект[ИмяСубконто+"2"];
		Субконто3 = ДокОбъект[ИмяСубконто+"3"];
	Иначе
		Субконто1 = Неопределено;
		Субконто2 = Неопределено;
		Субконто3 = Неопределено;
	КонецЕсли; 
	
	ГруппаНалоговогоНазначенияЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(
		ДокОбъект[ИмяСчетаЗатрат], 
		Субконто1, 
		Субконто2, 
		Субконто3
	);
	
	Если ГруппаНалоговогоНазначенияЗатрат <> ДокОбъект.НалоговоеНазначениеДоходовИЗатрат.ГруппаНалоговогоНазначения Тогда
		ДокОбъект.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка(); 
		Если ЕстьРеквизитНалоговоеНазначение И ГруппаНалоговогоНазначенияЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда
			ДокОбъект.НалоговоеНазначениеДоходовИЗатрат = ДокОбъект.НалоговоеНазначение;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриИзмененииСчетаСубконтоЗатратВШапке()

#КонецЕсли
