
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатуре", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатуре", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	Если Параметры.Свойство("ТолькоАктивные") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТолькоАктивные", Параметры.ТолькоАктивные);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ТолькоАктивные", Ложь);
	КонецЕсли;
КонецПроцедуры
