
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.ВидОбъектаДоступа) Тогда
			ЗаписьНабора.ВидОбъектаДоступа = НастройкаПравДоступа.ПолучитьВидОбъектаДоступа(ЗаписьНабора.ОбъектДоступа);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если  Клиент Тогда
		ПроверитьКорректностьНазначенияГруппПользователям();
	#КонецЕсли
		
КонецПроцедуры

#Если  Клиент Тогда
Процедура ПроверитьКорректностьНазначенияГруппПользователям() Экспорт
		
	ГруппыВНаборе = ЭтотОбъект.ВыгрузитьКолонку("Пользователь");
	Если ГруппыВНаборе.Найти(Справочники.ГруппыПользователей.ВсеПользователи) <> Неопределено Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыПользователей ГДЕ Ссылка <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)";
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Предупреждение("Для корректного функционирования механизма ограничения прав доступа на уровне записей необходимо создать группы 
							|пользователей, для которых следует определить виды объектов доступа, по которым они ограничиваются. Настройки 
							|одной лишь группы «Все пользователи» недостаточно. Подробнее см. в документации.");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли