#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство                                                                 КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток                                                        КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток                                                         КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот                                                                  КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток                                                      КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток                                                       КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот                                                                КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость
	|ПОМЕСТИТЬ
	|	СтоимостьОСОстаткиИОбороты
	|ИЗ
    |   РегистрНакопления.СтоимостьОС.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(ОсновноеСредство).* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОС.ОсновноеСредство            КАК ОсновноеСредство,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость     КАК ПервоначальнаяСтоимость
	|ПОМЕСТИТЬ
	|	РегСведенияОбОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ
	|	РегСостояниеОС
	|ИЗ
	|	РегистрСведений.СостоянияОС КАК СостоянияОС
	|	{ГДЕ
	|		СостоянияОС.ОсновноеСредство.*}
	|		
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОС.ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСоставОС.ОсновноеСредство	КАК ОсновноеСредство,
	|	РегСоставОС.ВСоставе 			КАК ВСоставе
	|ПОМЕСТИТЬ
	|	РегСоставОС
	|ИЗ
	|	РегистрСведений.СоставОС.СрезПоследних(&ДатаКон, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК РегСоставОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОС.МОЛ              КАК МОЛ,
	|	МестонахождениеОС.Местонахождение  КАК Местонахождение
	|ПОМЕСТИТЬ
	|	МестонахождениеОС
	|ИЗ
	|	РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаКон, ) КАК МестонахождениеОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ПараметрыАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство,
	|ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации
    |    ПОМЕСТИТЬ ПараметрыАмортизацииОС
    |    ИЗ
	|РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних(&ДатаКон, ) КАК ПараметрыАмортизацииОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
	|	ПО ПараметрыАмортизацииОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСоставОС.ВСоставе                                       	КАК ОСРодитель,
	|	ПРЕДСТАВЛЕНИЕ(РегСоставОС.ВСоставе),
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию 						КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета                            	КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство.Код КАК ИнвентарныйНомер,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации   	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот   							КАК ОбъемПродукцииРабот,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	МестонахождениеОС.Местонахождение КАК Подразделение,
    |   ПараметрыАмортизацииОС.СпособыОтраженияРасходовПоАмортизации
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*,
	|	ИнвентарныйНомер,
	|	МОЛ.*,
	|	Подразделение.*,
	|	СпособНачисления,
	|	СрокПолезногоИспользования,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	СтоимостьДляВычисленияАмортизации,
	|	ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ОбъемПродукцииРабот,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость,
    |   СпособыОтраженияРасходовПоАмортизации
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИЗ
	|	СтоимостьОСОстаткиИОбороты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСостояниеОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСоставОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСоставОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = ПараметрыАмортизацииОС.ОсновноеСредство}
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСоставОС.ВСоставе.*                                 КАК ОСРодитель,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   (СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство.Код КАК ИнвентарныйНомер,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации   	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот   							КАК ОбъемПродукцииРабот,
	|	МестонахождениеОС.МОЛ.* КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.*  КАК Подразделение,
    |   ПараметрыАмортизацииОС.СпособыОтраженияРасходовПоАмортизации.*
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}

	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	ИнвентарныйНомер,
	|	МОЛ.*,
	|	Подразделение.*,
	|	СпособНачисления,
	|	СрокПолезногоИспользования,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИТОГИ
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ОСРодитель),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(ДатаСнятияСУчета),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ПервоначальнаяСтоимость),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(МОЛ),
	|	СУММА(СрокПолезногоИспользования),
	|	СУММА(СрокИспользованияДляВычисленияАмортизации),
	|	СУММА(СтоимостьДляВычисленияАмортизации),
	|	СУММА(ОбъемПродукцииРаботДляВычисленияАмортизации),
	|	СУММА(ОбъемПродукцииРабот)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
    |   ОБЩИЕ,
    |   Подразделение
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
    |   Подразделение.*,
    |   МОЛ.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		//21122012 +
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("МестонахождениеОС.Местонахождение" , "Подразделение", "Подразделение", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Подразделения);
		//21122012 -
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОСРодитель",      		"В составе ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета", 		"Дата снятия с учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования","Срок полезного использования");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", "Срок исп. для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРабот", "Объем продукции/работ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем прод./раб. для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", "Стоимость для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение"); 
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособыОтраженияРасходовПоАмортизации","Способы отражения расходов по амортизации"); 
    //УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "","Инвентарный номер");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
//	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОСРодитель", 				"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаСнятияСУчета", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", 					"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокПолезногоИспользования", 					"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокИспользованияДляВычисленияАмортизации", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СтоимостьДляВычисленияАмортизации", 			"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОбъемПродукцииРаботДляВычисленияАмортизации", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОбъемПродукцииРабот", 						"ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",			ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокПолезногоИспользования",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокИспользованияДляВычисленияАмортизации",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СтоимостьДляВычисленияАмортизации",			ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",		ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаСнятияСУчета",			ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиБух(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство                                                                 КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация                                                                      КАК Организация,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток                                                        КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток                                                         КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот                                                                  КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток                                                      КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток                                                       КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот                                                                КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость
	|ПОМЕСТИТЬ
	|	СтоимостьОСОстаткиИОбороты
	|ИЗ
    |   РегистрНакопления.СтоимостьОСБухгалтерскийУчет.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(ОсновноеСредство).* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОС.ОсновноеСредство            КАК ОсновноеСредство,
	|	РегСведенияОбОС.Организация            		КАК Организация,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость     КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер            КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ
	|	РегСведенияОбОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОС.Организация      КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ
	|	РегСостояниеОС
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|{ГДЕ
	|	СостоянияОС.ОсновноеСредство.*,
	|	СостоянияОС.Организация.*}
	|		
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОС.ОсновноеСредство,
	|	СостоянияОС.Организация
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСоставОС.ОсновноеСредство	КАК ОсновноеСредство,
	|	РегСоставОС.ВСоставе 			КАК ВСоставе
	|ПОМЕСТИТЬ
	|	РегСоставОС
	|ИЗ
	|	РегистрСведений.СоставОС.СрезПоследних(&ДатаКон, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК РегСоставОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОС.Организация 	   КАК Организация,
	|	МестонахождениеОС.МОЛ              КАК МОЛ,
	|	МестонахождениеОС.Местонахождение  КАК Местонахождение
	|ПОМЕСТИТЬ
	|	МестонахождениеОС
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК МестонахождениеОС
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство 			КАК ОсновноеСредство,
	|	СчетаБухгалтерскогоУчетаОС.Организация 	   				КАК Организация,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета              		КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации  	КАК СчетНачисленияАмортизации
	|ПОМЕСТИТЬ
	|	СчетаБухгалтерскогоУчетаОС
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаКон, ) КАК СчетаБухгалтерскогоУчетаОС
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ПараметрыАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство,
	|ПараметрыАмортизацииОС.Организация КАК Организация,
	|ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|ПараметрыАмортизацииОС.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|СпособыОтраженияРасходовПоАмортизацииОССрезПоследних.СпособыОтраженияРасходовПоАмортизации
    |ПОМЕСТИТЬ ПараметрыАмортизацииОС
    |ИЗ
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК ПараметрыАмортизацииОС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних КАК СпособыОтраженияРасходовПоАмортизацииОССрезПоследних
	|	ПО ПараметрыАмортизацииОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОССрезПоследних.ОсновноеСредство
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСоставОС.ВСоставе                                   КАК ОСРодитель,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию 	КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета 		КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации   	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот   							КАК ОбъемПродукцииРабот,
    |	ПараметрыАмортизацииОС.СпособыОтраженияРасходовПоАмортизации   			КАК СпособыОтраженияРасходовПоАмортизации,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	МестонахождениеОС.Местонахождение КАК Подразделение,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	СрокПолезногоИспользования,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	СтоимостьДляВычисленияАмортизации,
	|	ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ОбъемПродукцииРабот,
    |   СпособыОтраженияРасходовПоАмортизации,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИЗ
	|	СтоимостьОСОстаткиИОбороты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСоставОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСоставОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСостояниеОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = РегСостояниеОС.Организация
	|			И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = МестонахождениеОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = СчетаБухгалтерскогоУчетаОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = ПараметрыАмортизацииОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = ПараметрыАмортизацииОС.ОсновноеСредство}
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	СтоимостьОСОстаткиИОбороты.Организация.* КАК Организация,
	|	МестонахождениеОС.МОЛ.* КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.* КАК Подразделение, 
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК СчетУчета,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСоставОС.ВСоставе.* 						КАК ОСРодитель,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
    |   (СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток) КАК ОстаточнаяСтоимость,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРаботДляВычисленияАмортизации   	КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.ОбъемПродукцииРабот   							КАК ОбъемПродукцииРабот,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
    |   ПараметрыАмортизацииОС.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}

	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	МОЛ.*,
	|	Подразделение.*,
	|	СчетУчета,
	|	СчетНачисленияАмортизации,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
    |   СпособыОтраженияРасходовПоАмортизации,
	|	СрокПолезногоИспользования,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИТОГИ
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ОСРодитель),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(ДатаСнятияСУчета),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(МОЛ),
	|	МАКСИМУМ(СчетУчета),
	|	МАКСИМУМ(СчетНачисленияАмортизации),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(СрокПолезногоИспользования),
	|	СУММА(СрокИспользованияДляВычисленияАмортизации),
	|	СУММА(СтоимостьДляВычисленияАмортизации),
	|	СУММА(ОбъемПродукцииРаботДляВычисленияАмортизации),
	|	СУММА(ОбъемПродукцииРабот)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
    |   ОБЩИЕ,
    |   Подразделение
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
    |   Организация.*,
    |   Подразделение.*,
    |   МОЛ.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		//21122012 +
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("МестонахождениеОС.Местонахождение" , "Подразделение", "Подразделение", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ПодразделенияОрганизаций);
		//21122012 -
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОСРодитель",      		"В составе ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета", 		"Дата снятия с учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования","Срок полезного использования");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", "Срок исп. для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРабот", "Объем продукции/работ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем прод./раб. для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", "Стоимость для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "МОЛ","МОЛ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Подразделение","Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СчетУчета","Счет учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СчетНачисленияАмортизации","Счет начисления амортизации");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособыОтраженияРасходовПоАмортизации","Способы отражения расходов по амортизации");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("МОЛ");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Подразделение", 			"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", 		"ОсновноеСредство");
    УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособыОтраженияРасходовПоАмортизации", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОСРодитель", 				"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаСнятияСУчета", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("МОЛ", 					"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокПолезногоИспользования", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокИспользованияДляВычисленияАмортизации", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СтоимостьДляВычисленияАмортизации", 			"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОбъемПродукцииРаботДляВычисленияАмортизации", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОбъемПродукцииРабот", 						"ОсновноеСредство");
	
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СчетУчета", 					"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СчетНачисленияАмортизации", 	"ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СчетУчета",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
    УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособыОтраженияРасходовПоАмортизации",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокПолезногоИспользования",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокИспользованияДляВычисленияАмортизации",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СтоимостьДляВычисленияАмортизации",			ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаСнятияСУчета",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиБух()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиНал(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство                                                                 КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация                                                                      КАК Организация,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНУНачальныйОстаток                                                        КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНУКонечныйОстаток                                                         КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНУОборот                                                                  КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНУНачальныйОстаток                                                      КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНУКонечныйОстаток                                                       КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНУОборот                                                                КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНУКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияНУКонечныйОстаток КАК ОстаточнаяСтоимость
	|ПОМЕСТИТЬ
	|	СтоимостьОСОстаткиИОбороты
	|ИЗ
	|	РегистрНакопления.СтоимостьОСБухгалтерскийУчет.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СтоимостьОСОстаткиИОбороты
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОС.ОсновноеСредство            КАК ОсновноеСредство,
	|	РегСведенияОбОС.Организация            		КАК Организация,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	РегСведенияОбОС.ПервоначальнаяСтоимость     КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер            КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ
	|	РегСведенияОбОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСведенияОбОСНУ.ОсновноеСредство            КАК ОсновноеСредство,
	|	РегСведенияОбОСНУ.Организация            		КАК Организация,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимостьНУ     КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОСНУ.НалоговаяГруппаОС     КАК НалоговаяГруппаОС
	|ПОМЕСТИТЬ
	|	РегСведенияОбОСНУ
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&ДатаКон, ) КАК РегСведенияОбОСНУ
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОС.Организация      КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|					ТОГДА СостоянияОС.ДатаСостояния
	|				ИНАЧЕ NULL
	|			КОНЕЦ) КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ
	|	РегСостояниеОС
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|{ГДЕ
	|	СостоянияОС.ОсновноеСредство.*,
	|	СостоянияОС.Организация.*}
	|		
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОС.ОсновноеСредство,
	|	СостоянияОС.Организация
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСоставОС.ОсновноеСредство	КАК ОсновноеСредство,
	|	РегСоставОС.ВСоставе 			КАК ВСоставе
	|ПОМЕСТИТЬ
	|	РегСоставОС
	|ИЗ
	|	РегистрСведений.СоставОС.СрезПоследних(&ДатаКон, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК РегСоставОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыеНазначенияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	НалоговыеНазначенияОС.Организация 	   КАК Организация,
	|	НалоговыеНазначенияОС.НалоговоеНазначение  КАК НалоговоеНазначение
	|ПОМЕСТИТЬ
	|	НалоговыеНазначенияОС
	|ИЗ
	|	РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаКон, ) КАК НалоговыеНазначенияОС
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОС.ОсновноеСредство 			КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОС.Организация 	   				КАК Организация,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования   КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации
	|ПОМЕСТИТЬ
	|	ПараметрыАмортизацииОС
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(&ДатаКон, ) КАК ПараметрыАмортизацииОС
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОСОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстаткиИОбороты.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(СтоимостьОСОстаткиИОбороты.ОсновноеСредство),
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСоставОС.ВСоставе                                   КАК ОСРодитель,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию 	КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета 		КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОСНУ.НалоговаяГруппаОС КАК НалоговаяГруппаОС,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	НалоговоеНазначение.*,
	|	НалоговаяГруппаОС.*,
	|	ИнвентарныйНомер,
	|	СпособНачисления,
	|	СрокПолезногоИспользования,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	СтоимостьДляВычисленияАмортизации,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИЗ
	|	СтоимостьОСОстаткиИОбороты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСоставОС
	|		ПО СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСоставОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСостояниеОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = РегСостояниеОС.Организация
	|			И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСостояниеОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегСведенияОбОСНУ
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = РегСведенияОбОСНУ.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = РегСведенияОбОСНУ.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ НалоговыеНазначенияОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = НалоговыеНазначенияОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОС
	|		ПО СтоимостьОСОстаткиИОбороты.Организация = ПараметрыАмортизацииОС.Организация И СтоимостьОСОстаткиИОбороты.ОсновноеСредство = ПараметрыАмортизацииОС.ОсновноеСредство}
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	СтоимостьОСОстаткиИОбороты.Организация.* КАК Организация,
	|	НалоговыеНазначенияОС.НалоговоеНазначение.* КАК НалоговоеНазначение,
	|	РегСведенияОбОС.СпособНачисленияАмортизации КАК СпособНачисления,
	|	РегСведенияОбОСНУ.НалоговаяГруппаОС КАК НалоговаяГруппаОС,
	|	РегСоставОС.ВСоставе.* 						КАК ОСРодитель,
	|	РегСостояниеОС.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	РегСостояниеОС.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияНачальныйОстаток КАК АмортизацияНачальныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК АмортизацияКонечныйОстаток,
	|	СтоимостьОСОстаткиИОбороты.АмортизацияОборот КАК АмортизацияОборот,
	|	СтоимостьОСОстаткиИОбороты.СтоимостьКонечныйОстаток - СтоимостьОСОстаткиИОбороты.АмортизацияКонечныйОстаток КАК ОстаточнаяСтоимость,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	РегСведенияОбОСНУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	РегСведенияОбОС.ИнвентарныйНомер КАК ИнвентарныйНомер 
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}

	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	НалоговоеНазначение.*,
	|	ИнвентарныйНомер,
	|	НалоговаяГруппаОС,
	|	СпособНачисления,
	|	СрокПолезногоИспользования,
	|	ОСРодитель.*,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета,
	|	ПервоначальнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьКонечныйОстаток,
	|	СтоимостьОборот,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияКонечныйОстаток,
	|	АмортизацияОборот,
	|	ОстаточнаяСтоимость
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}

	|ИТОГИ
	|	МАКСИМУМ(СпособНачисления),
	|	МАКСИМУМ(ОСРодитель),
	|	МАКСИМУМ(ДатаВводаВЭксплуатацию),
	|	МАКСИМУМ(ДатаСнятияСУчета),
	|	МАКСИМУМ(ИнвентарныйНомер),
	|	МАКСИМУМ(НалоговаяГруппаОС),
	|	МАКСИМУМ(НалоговоеНазначение),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(СтоимостьОборот),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияКонечныйОстаток),
	|	СУММА(АмортизацияОборот),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(СрокПолезногоИспользования),
	|	СУММА(СрокИспользованияДляВычисленияАмортизации),
	|	СУММА(СтоимостьДляВычисленияАмортизации)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	ОсновноеСредство.*,
	|	Организация.*,
	|	НалоговаяГруппаОС.*,
	|	НалоговоеНазначение.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("СтоимостьОСОстаткиИОбороты.ОсновноеСредство" , "ОсновноеСредство","Основное средство", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ОсновныеСредства);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",       "Основное средство");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот",        "Изменение стоимости ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",      "Амортизация за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОстаточнаяСтоимость",    "Остаточная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СпособНачисления",       "Способ начисления амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ОСРодитель",      		"В составе ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета", 		"Дата снятия с учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток","Стоимость начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток","Стоимость конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьОборот","Стоимость оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияНачальныйОстаток", "Амортизация начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияКонечныйОстаток","Амортизация конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "АмортизацияОборот", "Амортизация оборот");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПервоначальнаяСтоимость","Первоначальная стоимость");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования","Срок полезного использования");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", "Срок исп. для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", "Стоимость для амортизации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер","Инвентарный номер");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "НалоговаяГруппаОС","Налоговая группа ОС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "НалоговоеНазначение","Налоговое назначение");

	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель( "ПервоначальнаяСтоимость",   "первоначальная ",    Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьОборот",           "изменение",         Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "СтоимостьКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	УниверсальныйОтчет.ДобавитьПоказатель( "ОстаточнаяСтоимость",       "остаточная",        Истина, "ЧЦ=15; ЧДЦ=2","Стоимость","Стоимость");
	
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияНачальныйОстаток", "на начало периода", Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияОборот",           "за период",         Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	УниверсальныйОтчет.ДобавитьПоказатель( "АмортизацияКонечныйОстаток",  "на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2","Амортизация","Амортизация");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("НалоговоеНазначение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("НалоговаяГруппаОС");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ОсновноеСредство");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("ОсновноеСредство");
	УниверсальныйОтчет.ДобавитьОтбор("НалоговаяГруппаОС");
	УниверсальныйОтчет.ДобавитьОтбор("НалоговоеНазначение");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("Подразделение", 			"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СпособНачисления", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ОСРодитель", 				"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаВводаВЭксплуатацию", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ДатаСнятияСУчета", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ИнвентарныйНомер", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("НалоговаяГруппаОС", 		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("НалоговоеНазначение",		"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокПолезногоИспользования", "ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СрокИспользованияДляВычисленияАмортизации", 	"ОсновноеСредство");
	УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("СтоимостьДляВычисленияАмортизации", 			"ОсновноеСредство");
	
	// Установка представлений полей
	// УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	// УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);

	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СпособНачисления",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокПолезногоИспользования",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СрокИспользованияДляВычисленияАмортизации",	ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("СтоимостьДляВычисленияАмортизации",			ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаВводаВЭксплуатацию",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДатаСнятияСУчета",ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
КонецПроцедуры // УстановитьНачальныеНастройкиБух()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним) + " "
		+ ?(ВидУчета = 1, "(бухгалтерский учет)",
	   	  ?(ВидУчета = 2, "(налоговый учет)", "(управленческий учет)"));
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "";

	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	Если      ВидУчета = 1 Тогда // Бух.
		УстановитьНачальныеНастройкиБух(ДополнительныеПараметры);
	ИначеЕсли ВидУчета = 2 Тогда // Нал.
		УстановитьНачальныеНастройкиНал(ДополнительныеПараметры);
	Иначе // Упр
		УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	КонДата = Дата(УниверсальныйОтчет.ДатаКон);
	КонДата = КонецДня(?(КонДата = Дата('00010101000000'), Дата('39991231235959'), КонДата));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата", Дата(УниверсальныйОтчет.ДатаНач));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата", КонДата);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
