Перем мТаблицаДвижений Экспорт; // Таблица движений


// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Для каждого СтрокаДвижения Из мТаблицаДвижений Цикл
	
		Движение=ЭтотОбъект.Добавить();
		
		// Дебетовая сторона проводки
		Движение.СчетДт=СтрокаДвижения.СчетДт;
		ВидыСубконто=Движение.СчетДт.ВидыСубконто;
		
		Для Индекс=1 По ВидыСубконто.Количество() Цикл
				
				Движение.СубконтоДт[ВидыСубконто[Индекс-1].ВидСубконто]=СтрокаДвижения["СубконтоДт"+Индекс];
						
		КонецЦикла; 		
		
		Если Движение.СчетДт.Валютный Тогда
			
			Движение.ВалютаДт=СтрокаДвижения.ВалютаДт;
			Движение.ВалютнаяСуммаДт=СтрокаДвижения.ВалютнаяСуммаДт;
			
		КонецЕсли;
		
		Если Движение.СчетДт.Количественный Тогда
			
			Движение.КоличествоДт=СтрокаДвижения.КоличествоДт;
			
		КонецЕсли;		
				
		//Кредитовая сторона проводки
		Движение.СчетКт=СтрокаДвижения.СчетКт;
		
		ВидыСубконто=Движение.СчетКт.ВидыСубконто;
		
		Для Индекс=1 По ВидыСубконто.Количество() Цикл
				
				Движение.СубконтоКт[ВидыСубконто[Индекс-1].ВидСубконто]=СтрокаДвижения["СубконтоКт"+Индекс];
						
		КонецЦикла; 	

		Если Движение.СчетКт.Валютный Тогда
			
			Движение.ВалютаКт=СтрокаДвижения.ВалютаКт;
			Движение.ВалютнаяСуммаКт=СтрокаДвижения.ВалютнаяСуммаКт;
			
		КонецЕсли;
		
		Если Движение.СчетКт.Количественный Тогда
			
			Движение.КоличествоКт=СтрокаДвижения.КоличествоКт;
			
		КонецЕсли;

		// Общие реквизиты проводки
		Движение.Период=СтрокаДвижения.Период;
		Движение.Сценарий=СтрокаДвижения.Сценарий;
		Движение.СтатьяОборотов=СтрокаДвижения.СтатьяОборотов;	
		Движение.СуммаУпр=СтрокаДвижения.СуммаУпр;
		Движение.СуммаСценария=СтрокаДвижения.СуммаСценария;
		
	КонецЦикла; 
	
КонецПроцедуры // ВыполнитьДвижения()
