
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	Для каждого Запись из ЭтотОбъект цикл
		ХарактерЗатрат = Запись.СтатьяЗатрат.ХарактерЗатрат;
		Если ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве ИЛИ
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
			Сообщить("Для статьи затрат с характером затрат '"+ХарактерЗатрат+"' нельзя назначать основной проект для учета затрат",СтатусСообщения.Важное);
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
