Перем мУчетДенежныхСредствПоОбособленнымПодразделениям Экспорт;

Процедура ОбновитьПараметрыУчетнойПолитики(Дата,Организация) Экспорт

	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Бух");

	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	ЕстьАналитикаПоОбособленнымПодразделениям = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);

	мУчетДенежныхСредствПоОбособленнымПодразделениям = Ложь;
	Если ЗначениеЗаполнено(мУчетнаяПолитикаБУ) Тогда	
		мУчетДенежныхСредствПоОбособленнымПодразделениям = ЕстьАналитикаПоОбособленнымПодразделениям И мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям;
	КонецЕсли;
	
КонецПроцедуры
