&НаСервере
Функция ЭтоНеТовар()
	Возврат Объект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар;	
КонецФункции
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	// сбросим флаг БСУ и УПНС, если он был выбран и выбран не товар
	Если ЭтоНеТовар() Тогда
		Если Объект.БланкСтрогогоУчета ИЛИ Объект.УчитываетсяПоНоминальнойСтоимости Тогда
			Объект.БланкСтрогогоУчета = НЕ Объект.БланкСтрогогоУчета;
			Объект.УчитываетсяПоНоминальнойСтоимости = НЕ Объект.УчитываетсяПоНоминальнойСтоимости;
		КонецЕсли;
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
    		
	Если ЭтоНеТовар() Тогда
		// установим недоступность флага БСУ и УПН
		Элементы.БланкСтрогогоУчета.Доступность = Ложь;
		Элементы.УчитываетсяПоНоминальнойСтоимости.Доступность = Ложь;
	Иначе
		Элементы.БланкСтрогогоУчета.Доступность = Истина;
	КонецЕсли; 
	Если Объект.БланкСтрогогоУчета Тогда 
		 Элементы.УчитываетсяПоНоминальнойСтоимости.Доступность = Истина;
	 Иначе 
		 Элементы.УчитываетсяПоНоминальнойСтоимости.Доступность = Ложь;
    КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура БланкСтрогогоУчетаПриИзменении(Элемент)
	УстановитьДоступность();
	// сбросим флаг БСУ и УПНС, если он был выбран и выбран не товар
		Если Объект.УчитываетсяПоНоминальнойСтоимости Тогда
			Объект.УчитываетсяПоНоминальнойСтоимости = НЕ Объект.УчитываетсяПоНоминальнойСтоимости;
		КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры
