// УВЕЛИЧЕНИЕ ДЛИНЫ НОМЕРА ДОКУМЕНТОВ

Функция ПолучитьВыборкуДокументов(ТипДокумента, ДатаНач, СсылкаНач)
	
	
	УсловиеСсылка = " Ссылка > &СсылкаНач ";
	УсловиеДата = " ВыборкаДокументы.Дата >= &ДатаНач ";
	
	Условие = "";
	
	Если СсылкаНач = Неопределено Тогда
		Если ЗначениеЗаполнено(ДатаНач) Тогда
			Условие = " ГДЕ " + УсловиеДата;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ДатаНач) Тогда
			Условие = " ГДЕ " + УсловиеСсылка + " И " + УсловиеДата;
		Иначе
			Условие = " ГДЕ " + УсловиеСсылка;
		КонецЕсли;
	КонецЕсли; 	
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СсылкаНач", СсылкаНач);
	Запрос.УстановитьПараметр("ДатаНач",   ДатаНач);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	ВыборкаДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ТипДокумента + " КАК ВыборкаДокументы 
	| " +
	Условие + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
    Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура УвеличениеДлиныНомераДокументов(ТипДокумента, ДатаНач) Экспорт
	
	НоваяДлинаНомера = Метаданные.Документы[ТипДокумента].ДлинаНомера;
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
    Пока ЕстьДокументы Цикл
		
		Выборка = ПолучитьВыборкуДокументов(ТипДокумента, ДатаНач, ДокументСсылка);
		ЕстьДокументы = Выборка.Количество() > 0;
		
		Пока Выборка.Следующий() Цикл
			
			ДокументСсылка = Выборка.Ссылка;
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			СтарыйНомер = СокрЛП(ДокументОбъект.Номер);
			
			// ищем с конца до начала первую не цифру - то что нашли - числовая часть номера 
			// ее дополняем 0-ми до новой длины, остальное префикс - оставляем неизменным и затем дополняем
			ДлинаСтарогоНомера = СтрДлина(СтарыйНомер);
			
			ДополняющихНулей = НоваяДлинаНомера - ДлинаСтарогоНомера;
			Если ДополняющихНулей <= 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Для н = 0 По ДлинаСтарогоНомера - 1 Цикл
				Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(Сред(СтарыйНомер, ДлинаСтарогоНомера - н, 1), Истина, Ложь) Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла; 
			
			Префикс = Сред(СтарыйНомер, 1, ДлинаСтарогоНомера - н);
			ЧисловаяЧастьНомера = Сред(СтарыйНомер, ДлинаСтарогоНомера - н + 1);
			
			Для к = 1 По ДополняющихНулей Цикл
				ЧисловаяЧастьНомера = "0" + ЧисловаяЧастьНомера;
			КонецЦикла; 
			
			НовыйНомер = Префикс + ЧисловаяЧастьНомера;
			
			ДокументОбъект.Номер = НовыйНомер;

			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ по обновлению реквизитов НалоговоеНазначение, НалоговоеНазначениеДоходовИЗатрат, начиная с 01.04.2011

Процедура ЗаполнитьНалоговыеНазначения(ЗаполнятьДокументы = Ложь, ДатаНачалаОбработки = '20110401') Экспорт
	
	СтруктураНН = Новый Структура;
	
	СоответствиеНалоговыхНазначений_НП = Неопределено;
	СоответствиеНалоговыхНазначений_НДС = Неопределено;
	ПолучитьСоответствиеСтарыхИНовыхНалоговыхНазначений(СоответствиеНалоговыхНазначений_НП, СоответствиеНалоговыхНазначений_НДС);
	СтруктураНН.Вставить("СоответствиеНалоговыхНазначений_НП",  СоответствиеНалоговыхНазначений_НП);
	СтруктураНН.Вставить("СоответствиеНалоговыхНазначений_НДС", СоответствиеНалоговыхНазначений_НДС);
	
	Если ЗаполнятьДокументы = Ложь Тогда
		ТаблицаОбъектов = ЗаполнитьТаблицуОбъектовНалоговыеНазначенияСправочники();
	Иначе	
		ТаблицаОбъектов = ЗаполнитьТаблицуОбъектовНалоговыеНазначенияДокументы();
	КонецЕсли;
	
	ПредИмяОбъекта = "";
	ПредВидОбъекта = "";
	МассивСтруктурРеквизитов = Новый Массив;
	
	Для Каждого СтрокаОбъект Из ТаблицаОбъектов Цикл
		
		ИмяОбъекта = СтрокаОбъект.ИмяОбъекта;
		Если ПредИмяОбъекта <> ИмяОбъекта Тогда
			Если НЕ ПредИмяОбъекта = "" Тогда
				ОбработатьОбъектНалоговыеНазначения(ПредВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки);	
			КонецЕсли; 
			МассивСтруктурРеквизитов = Новый Массив;
		КонецЕсли; 
		
		СтруктураРеквизитов = Новый Структура(
			"ИмяОбъекта, 
			|ИмяТабличнойЧасти, 
			|ИмяРеквизитНалоговоеНазначение, 
			|ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат,
			|ИмяРеквизитСчетЗатрат,
			|ИмяРеквизитСубконтоЗатрат",
			СтрокаОбъект.ИмяОбъекта, 
			СтрокаОбъект.ИмяТабличнойЧасти,
			СтрокаОбъект.ИмяРеквизитНалоговоеНазначение, 
			СтрокаОбъект.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат,
			СтрокаОбъект.ИмяРеквизитСчетЗатрат,
			СтрокаОбъект.ИмяРеквизитСубконтоЗатрат
		);
		
		МассивСтруктурРеквизитов.Добавить(СтруктураРеквизитов);
		
		ПредИмяОбъекта = ИмяОбъекта;
		ПредВидОбъекта = СтрокаОбъект.ВидОбъекта;
		
	КонецЦикла; 
	
	Если НЕ ПредИмяОбъекта = "" Тогда
		ОбработатьОбъектНалоговыеНазначения(ПредВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки);	
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗаполнитьТаблицуОбъектовНалоговыеНазначенияСправочники() 

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ТаблицаОбъектов.Колонки.Добавить("ВидОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТабличнойЧасти"); // пустая строка - шапка или нет тч
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначение");               // имя реквизита налогового назначения НДС
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат"); // имя реквизита налогового назначения доходов и затрат
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитСчетЗатрат");        // имя реквизита счета затрат - для определения группы налогового назначения доходов и затрат
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитСубконтоЗатрат");    // имя реквизита субконто затрат - для определения группы налогового назначения доходов и затрат
	
	// СПРАВОЧНИКИ 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "НаправленияСписанияВыпущеннойПродукции", "Направления" ,"", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "НоменклатурныеГруппы", "" ,"НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "ПодразделенияОрганизаций", "" ,"НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "СпособыОтраженияЗарплатыВРеглУчете", "" ,"", "НалоговоеНазначениеДоходовИЗатрат", "СчетДт", "СубконтоДт");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Справочник", "СпособыОтраженияРасходовПоАмортизации", "Способы" ,"", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	// РЕГИСТРЫ СВЕДЕНИЙ 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "КонтрагентыОрганизаций", "" ,"НалоговоеНазначениеПриобретений", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "КонтрагентыОрганизаций", "" ,"НалоговоеНазначениеПриобретенийПоТаре", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "КонтрагентыОрганизаций", "" ,"НалоговоеНазначениеПродаж", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "КонтрагентыОрганизаций", "" ,"НалоговоеНазначениеПродажПоТаре", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "СчетаУчетаНоменклатуры", "" ,"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "РегистрСведений", "ОбъектыСтроительстваОрганизаций", "" ,"НалоговоеНазначение", "");
	
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "УстановкаПараметровУчетаНоменклатуры", "СчетаУчетаНоменклатуры",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетУчетаБУ", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "УстановкаПараметровУчетаНоменклатуры", "ПараметрыУчетаУслуг",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "");
	
	Возврат ТаблицаОбъектов;

КонецФункции // ЗаполнитьТаблицуОбъектовНалоговыеНазначения()

Функция ЗаполнитьТаблицуОбъектовНалоговыеНазначенияДокументы() 

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ТаблицаОбъектов.Колонки.Добавить("ВидОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ИмяТабличнойЧасти"); // пустая строка - шапка или нет тч
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначение");               // имя реквизита налогового назначения НДС
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат"); // имя реквизита налогового назначения доходов и затрат
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитСчетЗатрат");        // имя реквизита счета затрат - для определения группы налогового назначения доходов и затрат
	ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизитСубконтоЗатрат");    // имя реквизита субконто затрат - для определения группы налогового назначения доходов и затрат
	
	// ДОКУМЕНТЫ
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"Товары",					"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"Прочее",					"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АвансовыйОтчет", 	"ВозвратнаяТара",			"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"Услуги", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"Материалы", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"ПрочиеЗатраты", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"РаспределениеМатериалов", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "АктОбОказанииПроизводственныхУслуг", 	"РаспределениеПрочихЗатрат", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВводНачальныхОстатковМатериаловВЭксплуатации", 	"Материалы", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВводНачальныхОстатковОС",  "ОС", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратПереданныхТоваров",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратПереданныхТоваров",  "ВозвратнаяТара", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровОтПокупателя",  "Товары", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровОтПокупателя",  "ВозвратнаяТара", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику",  "ВозвратнаяТара", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщику",  "Оборудование", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщикуИзНТТ",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВозвратТоваровПоставщикуИзНТТ",  "ВозвратнаяТара", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ВыпускПродукции",  "Продукция", "НалоговоеНазначение", "");
	
	// НН доходов и затрат устанавливается по-умолчанию из первой строки
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ГТДИмпорт",  "", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "ЗатратСубконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ГТДИмпорт",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ГТДИмпорт",  "Оборудование", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ЗаказНаПроизводство",  "", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ЗаказПокупателя",  "", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ЗаписьКнигиПриобретения",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ЗаписьКнигиПриобретения",  "ВозвратнаяТара", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияЗапасов",  "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияЗапасов",  "Товары", "НалоговоеНазначениеНовое", "");
	
	// НН доходов и затрат устанавливается по-умолчанию 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияОС",  "", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетУчетаЗатрат", "ЗатратыСубконто");
	// НН в строках ТЧ заполняются особым образом 
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияОС",  "ОС", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИзменениеНалоговогоНазначенияОС",  "ОС", "НалоговоеНазначениеНовое", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИнвентаризацияБракаВПроизводстве",  "ЗатратыПоБракуВПроизводстве", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИнвентаризацияНЗП",  "Материалы", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ИнвентаризацияНЗП",  "ПрочиеЗатраты", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КомплектацияНоменклатуры",  "", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КомплектацияНоменклатуры",  "Комплектующие", "НалоговоеНазначение");
	
	// НН доходов и затрат устанавливается по-умолчанию из первой строки
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаДолга",  "СуммыДолга", "НалоговоеНазначение");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаДолгаПоВозвратнойТаре",  "", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетДт", "СубконтоДт");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаКачестваТоваров",  "Товары", "НалоговоеНазначение");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаНЗП",  "Материалы", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаНЗП",  "Материалы", "НалоговоеНазначениеПолучатель");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС",  "", "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС",  "ПриобретенияПодтвержденный", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС",  "ПриобретенияОжидаемый", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС",  "ПродажиПодтвержденный", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаОжидаемогоИПодтвержденногоНДС",  "ПродажиОжидаемый", "НалоговоеНазначение");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаПрочихЗатрат",  "Затраты", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаПрочихЗатрат",  "Затраты", "", "НалоговоеНазначениеДоходовИЗатратПолучатель", "СчетЗатратПолучатель", "СубконтоПолучатель");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "КорректировкаСерийИХарактеристикТоваров",  "Товары", "НалоговоеНазначение");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "МодернизацияНМА",  "", "НалоговоеНазначениеОбъектаСтроительства");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "МодернизацияОС",  "", "НалоговоеНазначениеОбъектаСтроительства");
	
    // НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"", "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"Товары", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"Услуги", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"ОС", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"НематериальныеАктивы", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"ВозвратнаяТара", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "НалоговаяНакладная", 	"ЧастичнаяОтгрузка", "НалоговоеНазначение");
	
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеМатериаловИзПроизводства", 	"Материалы", "НалоговоеНазначение");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеНЗП", 	"", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетКт", "СубконтоКт");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеНЗП", 	"Материалы", "НалоговоеНазначение");
	
	// НН доходов и затрат устанавливается по-умолчанию по первой строке
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеТоваров", 	"Товары", 			   "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОприходованиеТоваров", 	"БланкиСтрогогоУчета", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомиссионераОПродажах", 	"", 				   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомиссионераОПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомитентуОПродажах", 	"", 				   "", 					  "НалоговоеНазначениеДоходовИЗатратПоВознаграждению");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетКомитентуОПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетОРозничныхПродажах", 	"Товары", 			   "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"Продукция",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатратПолучатель", "Субконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"Материалы",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"РаспределениеМатериалов",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"ТехнологическиеОперации",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"РаспределениеТехнологическихОпераций",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"ПрочиеЗатраты",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"РаспределениеПрочихЗатрат",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"ВозвратныеОтходы",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"РаспределениеВозвратныхОтходов",  "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ОтчетПроизводстваЗаСмену", 	"НаправленияСписания",  "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаМатериаловВЭксплуатацию", "Материалы", "НалоговоеНазначение");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаНМА", "НематериальныеАктивы", "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаОборудованияВМонтаж", "Оборудование", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаОС", 	"ОС", "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаТоваров", 	"Товары", "НалоговоеНазначение", "");
	// НН для тары будут заполнены по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПередачаТоваров", 	"ВозвратнаяТара", "", "");
	
	// НН заполняется для малоценки по умолчанию отдельно
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеМатериаловВЭксплуатации", "Материалы", "", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"Товары", 				"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"ВозвратнаяТара", 		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПеремещениеТоваров", 	"БланкиСтрогогоУчета", 	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПереоценкаТоваровОтданныхНаКомиссию", 	"Товары", 				"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПереоценкаТоваровПринятыхНаКомиссию", 	"Товары", 				"НалоговоеНазначение", "");
	
	// Заполняется отдельно - по УДАЛИТЬВидНалоговойДеятельности, УДАЛИТЬВидДеятельностиНДС
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеВходящее", 	"", 	"", "НалоговоеНазначениеДоходовИЗатрат");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеПоручениеИсходящее", 	"", 	"", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеТребованиеПолученное", 	"", 	"", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежноеТребованиеПоручениеПолученное", 	"", 	"", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПлатежныйОрдерСписаниеДенежныхСредств", 	"", 	"", "НалоговоеНазначениеДоходовИЗатрат");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "", "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "ПартииТоваров", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "ПартииТоваров", "НалоговоеНазначениеПоФакту");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "ПартииТоваров", "НалоговоеНазначениеПоФактуРекомендуемый");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "НезавершенноеПроизводство", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "НезавершенноеПроизводство", "НалоговоеНазначениеПоФакту");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "НезавершенноеПроизводство", "НалоговоеНазначениеПоФактуРекомендуемый");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "БракВПроизводстве", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "БракВПроизводстве", "НалоговоеНазначениеПоФакту");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "БракВПроизводстве", "НалоговоеНазначениеПоФактуРекомендуемый");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "Затраты", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "Затраты", "НалоговоеНазначениеПоФакту");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "Затраты", "НалоговоеНазначениеПоФактуРекомендуемый");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "СтроительствоОбъектовОсновныхСредств", "НалоговоеНазначение");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "СтроительствоОбъектовОсновныхСредств", "НалоговоеНазначениеПоФакту");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПодтверждениеКорректировокИспользованияНалоговыйУчет", "СтроительствоОбъектовОсновныхСредств", "НалоговоеНазначениеПоФактуРекомендуемый");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПолучениеУслугПоПереработке", "", "НалоговоеНазначениеДоходовИЗатрат", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПолучениеУслугПоПереработке", "Товары", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПолучениеУслугПоПереработке", "Услуги", "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПолучениеУслугПоПереработке", "ИспользованныеМатериалы", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеДопРасходов", 	"Товары", 			   "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеДопРасходов", 	"Оборудование",			"НалоговоеНазначение", "");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеНМА", 	"НематериальныеАктивы", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "Продукция", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "Материалы", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "РаспределениеМатериалов", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "ПрочиеЗатраты", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "РаспределениеПрочихЗатрат", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "ВозвратнаяТара", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "ВозвратныеОтходы", "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровИзПереработки", "РаспределениеВозвратныхОтходов", "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Товары",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"ВозвратнаяТара",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Оборудование",			"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"ОбъектыСтроительства",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"БланкиСтрогогоУчета",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслуг", 	"Услуги",				"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"Товары",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"ВозвратнаяТара",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПоступлениеТоваровУслугВНТТ", 	"Услуги",				"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "Приложение2КНалоговойНакладной", 	"Товары",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "Приложение2КНалоговойНакладной", 	"Услуги",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "Приложение2КНалоговойНакладной", 	"ОС",			    "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "Приложение2КНалоговойНакладной", 	"ВозвратнаяТара",		"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "Приложение2КНалоговойНакладной", 	"НематериальныеАктивы","НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПринятиеКУчетуНМА", 	"",	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПринятиеКУчетуОС", 	"",	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ПрочиеЗатраты", 	"Затраты", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеМатериаловНаВыпуск", "Материалы",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеМатериаловНаВыпуск", "РаспределениеМатериалов",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеМатериаловНаВыпуск", "Продукция",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеМатериаловНаВыпуск", "РаспределениеВозвратныхОтходов",	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеПрочихЗатрат", "ПрочиеЗатраты",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеПрочихЗатрат", "Продукция",	"НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РаспределениеПрочихЗатрат", "ЗатратыНаПродукцию",	"НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РасходныйКассовыйОрдер", 	"", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетУчетаРасчетовСКонтрагентом", "СубконтоДт");

	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"Товары",			"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"ВозвратнаяТара",	"НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияТоваровУслуг", 	"Услуги",			"", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияУслугПоПереработке", 	"Продукция",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РеализацияУслугПоПереработке", 	"Услуги",  "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РегистрацияАвансовВНалоговомУчете", 	"Приобретения",  "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "РегистрацияАвансовВНалоговомУчете", 	"Продажи",  "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СдельныйНаряд", 	"Выработка", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеДепонентовВДоходыОрганизаций", 	"", "", "НалоговоеНазначениеДоходовИЗатрат", "СчетУчетаРасходов", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеМатериаловИзЭксплуатации", 	"Материалы",  "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеНЗП", 	"",  "", "НалоговоеНазначениеДоходовИЗатрат", "СчетДт", "СубконтоДт");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеНЗП", 	"Материалы",  "НалоговоеНазначение", "");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеНМА", "",  "", "НалоговоеНазначениеДоходовИЗатрат");
	
	// НН доходов и затрат устанавливается по-умолчанию
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеОС", 	"",  "", "НалоговоеНазначениеДоходовИЗатрат");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"",  "", "НалоговоеНазначениеДоходовИЗатрат", "СчетДт", "СубконтоДт");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"Товары",  "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"ВозвратнаяТара",  "НалоговоеНазначение", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "СписаниеТоваров", 	"БланкиСтрогогоУчета",  "НалоговоеНазначение", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "ТребованиеНакладная", "Материалы",  "НалоговоеНазначение", "НалоговоеНазначениеДоходовИЗатрат", "СчетЗатрат", "Субконто");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "УслугиСобственнымПодразделениям", "",  "НалоговоеНазначение", "", "", "");
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "УслугиСобственнымПодразделениям", "Затраты",  "", "НалоговоеНазначениеДоходовИЗатрат", "Счет", "");
	
	ДобавитьСтрокуТабОбъектовНН(ТаблицаОбъектов, "Документ", "УстановкаБазыРаспределенияЗатрат", "БазаРаспределения",  "НалоговоеНазначение", "", "", "");
	

	Возврат ТаблицаОбъектов;

КонецФункции // ЗаполнитьТаблицуОбъектовНалоговыеНазначения()

Процедура ДобавитьСтрокуТабОбъектовНН(
	ТаблицаОбъектов, 
	ВидОбъекта, 
	ИмяОбъекта, 
	ИмяТабличнойЧасти = "", 
	ИмяРеквизитНалоговоеНазначение = "", 
	ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = "",
	ИмяРеквизитСчетЗатрат = "",
	ИмяРеквизитСубконтоЗатрат = ""
	)

	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ВидОбъекта = ВидОбъекта;
	НоваяСтрока.ИмяОбъекта = ИмяОбъекта;
	НоваяСтрока.ИмяТабличнойЧасти 							 = ИмяТабличнойЧасти;
	НоваяСтрока.ИмяРеквизитНалоговоеНазначение 				 = ИмяРеквизитНалоговоеНазначение;
	НоваяСтрока.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат;
	НоваяСтрока.ИмяРеквизитСчетЗатрат                        = ИмяРеквизитСчетЗатрат;
	НоваяСтрока.ИмяРеквизитСубконтоЗатрат                    = ИмяРеквизитСубконтоЗатрат;
	

КонецПроцедуры 

Процедура ОбработатьОбъектНалоговыеНазначения(ВидОбъекта, МассивСтруктурРеквизитов, СтруктураНН, ДатаНачалаОбработки)
	
	Если ВидОбъекта = "Справочник" Тогда
		ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, 1, СтруктураНН, ДатаНачалаОбработки);
	ИначеЕсли ВидОбъекта = "Документ" Тогда
		ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, 2, СтруктураНН, ДатаНачалаОбработки);
	ИначеЕсли ВидОбъекта = "РегистрСведений" Тогда
		ОбработатьРегистрСведенийНалоговыеНазначения(МассивСтруктурРеквизитов, 2, СтруктураНН);
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ОбработатьРегистрСведенийНалоговыеНазначения(МассивСтруктурРеквизитов, ВидРегистра, СтруктураНН)
	
	ИмяРегистра = МассивСтруктурРеквизитов[0].ИмяОбъекта;

	НаборДвижений = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			
	НаборДвижений.Прочитать();

	ИзмененыДвижения = Ложь;
	Для Каждого Движение Из НаборДвижений Цикл
		
		Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
			
			ИмяРеквизитаНалоговоеНазначениеСтарое = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
			НалоговоеНазначениеСтарое             = Движение[ИмяРеквизитаНалоговоеНазначениеСтарое];
			
			// Налоговое назначение НДС
			ИмяРеквизитНалоговоеНазначениеНДС = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение;
			Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеНДС) Тогда
				Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
					(НЕ ЗначениеЗаполнено(Движение[ИмяРеквизитНалоговоеНазначениеНДС]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(Движение[ИмяРеквизитНалоговоеНазначениеНДС]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
					НалоговоеНазначениеНДСНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
					Движение[ИмяРеквизитНалоговоеНазначениеНДС] = НалоговоеНазначениеНДСНовое;
					ИзмененыДвижения = Истина;
				КонецЕсли; 
			КонецЕсли; 
			
			// Налоговое назначение доходов и затрат
			ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат;
			Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
				Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
					(НЕ ЗначениеЗаполнено(Движение[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(Движение[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
					// определим группу налогового назначения доходов и затрат, она может зависить от счета затрат
					Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСчетЗатрат) Тогда
						СчетЗатрат = Движение[СтруктураРеквизитов.ИмяРеквизитСчетЗатрат];
						Субконто1 = Неопределено; Субконто2 = Неопределено; Субконто3 = Неопределено; 
						Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат) Тогда
							Субконто1 = Движение[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "1"];
							Субконто2 = Движение[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "2"];
							Субконто3 = Движение[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "3"];
						КонецЕсли; 
						ГруппаНалоговоеНазначениеДоходовИЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СчетЗатрат, Субконто1, Субконто2, Субконто3);
					Иначе
						ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат;
					КонецЕсли; 
					Если ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда
						НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеДоходовИЗатрат(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НП);
					Иначе
						НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
					КонецЕсли; 
					Движение[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = НалоговоеНазначениеДоходовИЗатратНовое;
					ИзмененыДвижения = Истина;
				КонецЕсли; 
			КонецЕсли; 
			
		КонецЦикла; 
			
	КонецЦикла; 	
		
	Если ИзмененыДвижения Тогда
		НаборДвижений.ОбменДанными.Загрузка = Истина;
		НаборДвижений.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОбработатьСправочникДокументНалоговыеНазначения(МассивСтруктурРеквизитов, Вид, СтруктураНН, ДатаНачалаОбработки)
	
	ИмяОбъекта = МассивСтруктурРеквизитов[0].ИмяОбъекта;
	
	ЕстьДокументы = Истина;
	ДокументСсылка = Неопределено;
	
	МассивТабЧастей = Новый Массив;
	Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
		Если СтруктураРеквизитов.ИмяТабличнойЧасти <> "" Тогда
			Если МассивТабЧастей.Найти(СтруктураРеквизитов.ИмяТабличнойЧасти) = Неопределено Тогда
				МассивТабЧастей.Добавить(СтруктураРеквизитов.ИмяТабличнойЧасти)
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;	
	
	Пока ЕстьДокументы Цикл
		
		Если ИмяОбъекта = "УстановкаПараметровУчетаНоменклатуры" Тогда
			ТаблицаДокументов = ПолучитьТаблицуСправочниковДокументов(ДокументСсылка, ИмяОбъекта, Вид, '00010101');
		Иначе
			ТаблицаДокументов = ПолучитьТаблицуСправочниковДокументов(ДокументСсылка, ИмяОбъекта, Вид, ДатаНачалаОбработки);
		КонецЕсли;	
		
		ЕстьДокументы = ТаблицаДокументов.Количество() > 0;
		
		Для Каждого Строка Из ТаблицаДокументов Цикл
			
			ДокументСсылка = Строка.Ссылка;
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			ОбъектИзменен = Ложь;
			
			// обрабатываем шапку
			Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
				
				Если СтруктураРеквизитов.ИмяТабличнойЧасти <> "" Тогда
					Продолжить;
				КонецЕсли; 
				
				Если Вид = 1 И ДокументОбъект.ЭтоГруппа Тогда // Вид = 1 - Справочник
					Продолжить;
				КонецЕсли;	
				
				// особые случаи
				Если Вид = 2 И (
					ИмяОбъекта = "ИзменениеНалоговогоНазначенияОС"
					ИЛИ ИмяОбъекта = "КорректировкаДолгаПоВозвратнойТаре"
					ИЛИ ИмяОбъекта = "КорректировкаОжидаемогоИПодтвержденногоНДС"
					ИЛИ ИмяОбъекта = "НалоговаяНакладная"
					ИЛИ ИмяОбъекта = "ОприходованиеНЗП"
					ИЛИ ИмяОбъекта = "ПодтверждениеКорректировокИспользованияНалоговыйУчет"
					ИЛИ ИмяОбъекта = "СписаниеОС"
					ИЛИ ИмяОбъекта = "СписаниеНМА"
					)
					// документы, в которых в шапке ранее не было реквизита НалоговоеНазначениеДоходовИЗатрат
					Тогда
					
					// заполняем по умолчанию 
					Если НЕ ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат) Тогда
						ОбъектИзменен = Истина;
						ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат;
						Если Не ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСчетЗатрат) Тогда
							ИмяРеквизитСчетЗатрат = СокрЛП(СтруктураРеквизитов.ИмяРеквизитСчетЗатрат);
							ИмяРеквизитСубконтоЗатрат = СокрЛП(СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат);
							Если Не ПустаяСтрока(ИмяРеквизитСчетЗатрат) Тогда
								СчетЗатрат = ДокументОбъект[ИмяРеквизитСчетЗатрат];
								Субконто1 = Неопределено; Субконто2 = Неопределено; Субконто3 = Неопределено; 
								Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат) Тогда
									Субконто1 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "1"];
									Субконто2 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "2"];
									Субконто3 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "3"];
								КонецЕсли; 
								ГруппаНалоговоеНазначениеДоходовИЗатрат =  НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СчетЗатрат, Субконто1, Субконто2, Субконто3);
							КонецЕсли; 
						КонецЕсли;
						Если ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда
							ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;	
						Иначе
							ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
						КонецЕсли; 
					КонецЕсли;	
					
				ИначеЕсли Вид = 2 И ИмяОбъекта = "ПлатежноеПоручениеВходящее" Тогда
					// документы, в которых были еще старые "тройки" налоговых реквизитов
					ВидНалоговойДеятельности =  ДокументОбъект.УДАЛИТЬВидНалоговойДеятельности;
					ВидДеятельностиНДС       =  ДокументОбъект.УДАЛИТЬВидДеятельностиНДС;
					
					ГруппаНалоговоеНазначениеДоходовИЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(ДокументОбъект.СчетУчетаРасчетовСКонтрагентом, ДокументОбъект.СубконтоКт1, ДокументОбъект.СубконтоКт2, ДокументОбъект.СубконтоКт3);
					
					Если ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда
						НалоговоеНазначениеНовое = ПолучитьНалоговоеНазначениеДоходовИЗатрат(Неопределено, Неопределено, ВидНалоговойДеятельности);	
					Иначе
						НалоговоеНазначениеНовое = ПолучитьНалоговоеНазначениеНДС(Неопределено, Неопределено, ВидДеятельностиНДС);	
					КонецЕсли; 
					
					ОбъектИзменен = Истина;
					ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = НалоговоеНазначениеНовое;
					
				ИначеЕсли Вид = 2 И (
					ИмяОбъекта = "МодернизацияОС"
					ИЛИ
					ИмяОбъекта = "МодернизацияНМА"
					)
					Тогда

					// заполняем по умолчанию 
					Если Не ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеОбъектаСтроительства) Тогда
						ОбъектИзменен = Истина;
						ДокументОбъект.НалоговоеНазначениеОбъектаСтроительства = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
					КонецЕсли;	
					
				Иначе 
				    // обычная обработка
					ИмяРеквизитаНалоговоеНазначениеСтарое = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
					НалоговоеНазначениеСтарое             = ДокументОбъект[ИмяРеквизитаНалоговоеНазначениеСтарое];
					
					// Налоговое назначение НДС
					ИмяРеквизитНалоговоеНазначениеНДС = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение;
					Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеНДС) Тогда
						Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
							(НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитНалоговоеНазначениеНДС]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(ДокументОбъект[ИмяРеквизитНалоговоеНазначениеНДС]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
							НалоговоеНазначениеНДСНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
							ДокументОбъект[ИмяРеквизитНалоговоеНазначениеНДС] = НалоговоеНазначениеНДСНовое;
							ОбъектИзменен = Истина;
						КонецЕсли; 
					КонецЕсли; 
					
					// Налоговое назначение доходов и затрат
					ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат;
					Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
						Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
							(НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(ДокументОбъект[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
							// определим группу налогового назначения доходов и затрат, она может зависить от счета затрат
							Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСчетЗатрат) Тогда
								СчетЗатрат = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСчетЗатрат];
								Субконто1 = Неопределено; Субконто2 = Неопределено; Субконто3 = Неопределено; 
								Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат) Тогда
									Субконто1 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "1"];
									Субконто2 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "2"];
									Субконто3 = ДокументОбъект[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "3"];
								КонецЕсли; 
								ГруппаНалоговоеНазначениеДоходовИЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СчетЗатрат, Субконто1, Субконто2, Субконто3);
							Иначе
								ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат;
							КонецЕсли; 
							Если ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда
								НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеДоходовИЗатрат(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НП);
							Иначе
								НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
							КонецЕсли; 
							ДокументОбъект[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = НалоговоеНазначениеДоходовИЗатратНовое;
							ОбъектИзменен = Истина;
						КонецЕсли; 
					КонецЕсли; 
					
					// заполняем зависимые реквизиты шапки
					Если ИмяОбъекта = "ПринятиеКУчетуОС" Тогда
						Если Не ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеОборудования) Тогда
							ОбъектИзменен = Истина;
							ДокументОбъект.НалоговоеНазначениеОборудования = ДокументОбъект.НалоговоеНазначение;
						КонецЕсли;	
					ИначеЕсли ИмяОбъекта = "ПринятиеКУчетуНМА" Тогда
						Если Не ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеОбъектаСтроительства) Тогда
							ОбъектИзменен = Истина;
							ДокументОбъект.НалоговоеНазначениеОбъектаСтроительства = ДокументОбъект.НалоговоеНазначение;
						КонецЕсли;	
					КонецЕсли;
					
				КонецЕсли; 	
			
			КонецЦикла; 
			
			// обрабатываем таб. части
			Для Каждого ИмяТабЧасти Из МассивТабЧастей Цикл
				Для Каждого СтрокаТабЧасти Из ДокументОбъект[ИмяТабЧасти] Цикл
					
					ЕстьУдалитьПропорциональныйНДС = НЕ ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабЧасти].Реквизиты.Найти("УдалитьПропорциональныйНДС") = Неопределено;
					
					Для Каждого СтруктураРеквизитов Из МассивСтруктурРеквизитов Цикл
				
						Если СтруктураРеквизитов.ИмяТабличнойЧасти <> ИмяТабЧасти Тогда
							Продолжить;
						КонецЕсли; 
						
						// особые случаи
						Если  
							ИмяОбъекта = "ПередачаМалоценныхАктивовВЭксплуатацию"
							ИЛИ ИмяОбъекта = "СписаниеМатериаловИзЭксплуатации"
							ИЛИ ИмяОбъекта = "ПеремещениеМатериаловВЭксплуатации"
							
							Тогда
							 
							// заполняем отсутствующие в предыдущей редакции реквизиты
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
							
							КонецЕсли;
							
						ИначеЕсли ИмяОбъекта = "ИзменениеНалоговогоНазначенияОС" Тогда	
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначениеНовое = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(ДокументОбъект.УдалитьНалоговоеНазначение);
								
								ДанныеПоСтаромуНН =РегистрыСведений.НалоговыеНазначенияОС.СрезПоследних('20110401', Новый Структура("Организация, ОсновноеСредство", ДокументОбъект.Организация, СтрокаТабЧасти.ОсновноеСредство));
								Если ДанныеПоСтаромуНН.Количество() > 0  Тогда
									СтароеНН = ДанныеПоСтаромуНН[0].НалоговоеНазначение;	
									Если СтруктураНН.СписокНалоговыхНазначенийНКУ_НДС.НайтиПоЗначению(СтароеНН) = Неопределено Тогда
									    СтрокаТабЧасти.НалоговоеНазначение = СтруктураНН.СоответствиеНалоговыхНазначений_НДС.Получить(СтароеНН);
									Иначе	
										СтрокаТабЧасти.НалоговоеНазначение = СтароеНН;
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли (ИмяОбъекта = "ПередачаТоваров" И ИмяТабЧасти = "ВозвратнаяТара")
							
							Тогда
							
							Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти.НалоговоеНазначение) Тогда
							
								ОбъектИзменен = Истина;
								СтрокаТабЧасти.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
								СтрокаТабЧасти.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
								
							КонецЕсли;
							
						Иначе
							// обычная обработка
							ИмяРеквизитаНалоговоеНазначениеСтарое = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение), СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение, СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат); 
							НалоговоеНазначениеСтарое             = СтрокаТабЧасти[ИмяРеквизитаНалоговоеНазначениеСтарое];
							
							// Налоговое назначение НДС
							ИмяРеквизитНалоговоеНазначениеНДС = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначение;
							Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеНДС) Тогда
								Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
									(НЕ ЗначениеЗаполнено(СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеНДС]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеНДС]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
									
									Если  ЕстьУдалитьПропорциональныйНДС
										И СтрокаТабЧасти["УдалитьПропорциональныйНДС"] = Истина Тогда
										СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеНДС] = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально;
										
									Иначе	
									
										НалоговоеНазначениеНДСНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
										СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеНДС] = НалоговоеНазначениеНДСНовое;
										
									КонецЕсли;	
									ОбъектИзменен = Истина;
								КонецЕсли; 
							КонецЕсли; 
							
							// Налоговое назначение доходов и затрат
							ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат = СтруктураРеквизитов.ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат;
							Если НЕ ПустаяСтрока(ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат) Тогда
								Если ЗначениеЗаполнено(НалоговоеНазначениеСтарое) И 
									(НЕ ЗначениеЗаполнено(СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) ИЛИ НалоговыйУчетПовтИсп.ПолучитьГруппуНалоговогоНазначения(СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат]) = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоНКУ) Тогда
									// определим группу налогового назначения доходов и затрат, она может зависить от счета затрат
									Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСчетЗатрат) Тогда
										СчетЗатрат = СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитСчетЗатрат];
										Субконто1 = Неопределено; Субконто2 = Неопределено; Субконто3 = Неопределено; 
										Если НЕ ПустаяСтрока(СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат) Тогда
											Субконто1 = СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "1"];
											Субконто2 = СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "2"];
											Субконто3 = СтрокаТабЧасти[СтруктураРеквизитов.ИмяРеквизитСубконтоЗатрат + "3"];
										КонецЕсли; 
										ГруппаНалоговоеНазначениеДоходовИЗатрат = НалоговыйУчетПовтИсп.ОпределитьГруппуНалоговогоНазначенияЗатрат(СчетЗатрат, Субконто1, Субконто2, Субконто3);
									Иначе
										ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат;
									КонецЕсли; 
									Если ГруппаНалоговоеНазначениеДоходовИЗатрат = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда
										НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеДоходовИЗатрат(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НП);
									Иначе
										НалоговоеНазначениеДоходовИЗатратНовое = ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеСтарое, СтруктураНН.СоответствиеНалоговыхНазначений_НДС);
									КонецЕсли; 
									СтрокаТабЧасти[ИмяРеквизитНалоговоеНазначениеДоходовИЗатрат] = НалоговоеНазначениеДоходовИЗатратНовое;
									ОбъектИзменен = Истина;
								КонецЕсли; 
							КонецЕсли; 
							
							// заполняем зависимые реквизиты шапки по первой обработанной строке документа
							// налоговое назначение по прибыли берем из первой строки ТЧ
							Если    ИмяОбъекта = "ГТДИмпорт"
								ИЛИ ИмяОбъекта = "КорректировкаДолга"
								ИЛИ ИмяОбъекта = "ОприходованиеТоваров"
								ИЛИ ИмяОбъекта = "ПолучениеУслугПоПереработке" Тогда
								
								Если НЕ ЗначениеЗаполнено(ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат)
									И ОбъектИзменен = Истина Тогда
									ДокументОбъект.НалоговоеНазначениеДоходовИЗатрат = СтруктураНН.СоответствиеНалоговыхНазначений_НП.Получить(НалоговоеНазначениеСтарое);
								КонецЕсли;
								
							КонецЕсли;
							
							
						КонецЕсли; 	
						
						
						
					КонецЦикла;
				КонецЦикла; 
			КонецЦикла;	
			
			Если ОбъектИзменен Тогда
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать();
			КонецЕсли; 
				
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры // ОбработатьСправочникДокументНалоговыеНазначения

Функция ПолучитьТаблицуРегистраторов(СсылкаНач, ИмяРегистра, ВидРегистра)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	РегистрУчета.Регистратор КАК Регистратор
	|ИЗ 	
	|	Регистр"+?(ВидРегистра=1,"Накопления","Сведений")+"." + ИмяРегистра + " КАК РегистрУчета "
	+ ?(СсылкаНач = Неопределено,""," ГДЕ РегистрУчета.Регистратор > &СсылкаНач ") + "
	|
	|УПОРЯДОЧИТЬ ПО Регистратор
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 				СсылкаНач);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуРегистраторов()

Функция ПолучитьТаблицуСправочниковДокументов(СсылкаНач, ИмяСправочникаДокумента, Вид, ДатаНачалаОбработки)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ 	
	|	"+?(Вид = 1, "Справочник", "Документ")+"." + ИмяСправочникаДокумента + " КАК Таблица 
	| ГДЕ "
	+ ?(СсылкаНач = Неопределено,"ИСТИНА "," Таблица.Ссылка > &СсылкаНач ")  
	+ ?(Вид = 1, "", " И  Дата >= &ДатаНачалаОбработки ") + "
	|
	|УПОРЯДОЧИТЬ ПО Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("СсылкаНач", 				СсылкаНач);
	Запрос.УстановитьПараметр("ДатаНачалаОбработки", 				ДатаНачалаОбработки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуСправочниковДокументов()

Функция ПолучитьНалоговоеНазначениеНДС(НалоговоеНазначениеНДССтарое, СоответствиеНалоговыхНазначенийНДС, ВидДеятельностиНДССтарый = Неопределено) 
	
	
	Результат = Неопределено;
	
	Если СоответствиеНалоговыхНазначенийНДС <> Неопределено Тогда
		Результат = СоответствиеНалоговыхНазначенийНДС.Получить(НалоговоеНазначениеНДССтарое);
	КонецЕсли;	
		
	
	Если Результат = Неопределено Тогда
		Если НалоговоеНазначениеНДССтарое <> Неопределено Тогда
			ВидДеятельностиНДС = НалоговоеНазначениеНДССтарое.ВидДеятельностиНДС;
		Иначе
			ВидДеятельностиНДС = ВидДеятельностиНДССтарый;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВидДеятельностиНДС) Тогда
			Возврат Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли; 
		
		Если ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.Необлагаемая Тогда
			Результат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		Иначе
			Результат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая;
		КонецЕсли; 
		Если СоответствиеНалоговыхНазначенийНДС <> Неопределено Тогда
			СоответствиеНалоговыхНазначенийНДС.Вставить(НалоговоеНазначениеНДССтарое, Результат);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьНалоговоеНазначениеНДС()

Функция ПолучитьНалоговоеНазначениеДоходовИЗатрат(НалоговоеНазначениеДоходовИЗатратСтарое, СоответствиеНалоговыхНазначенийДоходовИЗатрат, ВидНалоговойДеятельностиСтарый = Неопределено)
	
	Результат = Неопределено;
	
	Если СоответствиеНалоговыхНазначенийДоходовИЗатрат <> Неопределено Тогда
		Результат = СоответствиеНалоговыхНазначенийДоходовИЗатрат.Получить(НалоговоеНазначениеДоходовИЗатратСтарое);
	КонецЕсли;	
	
	Если Результат = Неопределено Тогда
		// ищем налоговое назначение с таким же видом налоговой деятельности, группой доходов и затрат
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	НалоговыеНазначенияАктивовИЗатрат.Ссылка КАК НалоговоеНазначение
		|ИЗ
		|	Справочник.НалоговыеНазначенияАктивовИЗатрат КАК НалоговыеНазначенияАктивовИЗатрат
		|ГДЕ
		|	НалоговыеНазначенияАктивовИЗатрат.ВидНалоговойДеятельности = &ВидНалоговойДеятельности
		|	И НалоговыеНазначенияАктивовИЗатрат.ГруппаНалоговогоНазначения = ЗНАЧЕНИЕ(Перечисление.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат)
		|";
		
		Если НалоговоеНазначениеДоходовИЗатратСтарое <> Неопределено Тогда
			ВидНалоговойДеятельности = НалоговоеНазначениеДоходовИЗатратСтарое.ВидНалоговойДеятельности;
		Иначе
			ВидНалоговойДеятельности = ВидНалоговойДеятельностиСтарый;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ВидНалоговойДеятельности) Тогда
			Возврат Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка();
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("ВидНалоговойДеятельности", ВидНалоговойДеятельности); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.НалоговоеНазначение;
		Иначе
			// создадим
			
			НовыйЭлемент = Справочники.НалоговыеНазначенияАктивовИЗатрат.СоздатьЭлемент();
			НовыйЭлемент.ВидНалоговойДеятельности = ВидНалоговойДеятельности;
			НовыйЭлемент.ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат;
			
			Наименование = "";
			Наименование = Наименование + ВидНалоговойДеятельности;
			
			НовыйЭлемент.Наименование = Наименование;
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			Сообщить("Записано новое налоговое назначение " + Наименование);
			Результат = НовыйЭлемент.Ссылка;
			
		КонецЕсли;
		Если СоответствиеНалоговыхНазначенийДоходовИЗатрат <> Неопределено Тогда
			СоответствиеНалоговыхНазначенийДоходовИЗатрат.Вставить(НалоговоеНазначениеДоходовИЗатратСтарое, Результат);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьНалоговоеНазначениеДоходовИЗатрат()

Процедура ПолучитьСоответствиеСтарыхИНовыхНалоговыхНазначений(ПоПрибыли = Неопределено, ПоНДС = Неопределено) 
	
	ПоНДС = Новый Соответствие;
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельность				   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАморт            , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАмортНеОблагНДС  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьНеОблагНДС       , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельность                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАморт              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАмортНеОблагНДС    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельность                  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАморт             , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАмортНеОблагНДС   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьНеОблагНДС        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслуги                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалюты                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнес                        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАморт                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАмортНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ПоНДС.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесНеОблагНДС              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	
	ПоПрибыли = Новый Соответствие;
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельность				   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАморт            , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьАмортНеОблагНДС  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НеХозДеятельностьНеОблагНДС       , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельность                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАморт              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьАмортНеОблагНДС    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ХозДеятельностьНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельность                  , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАморт             , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьАмортНеОблагНДС   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ТоргДеятельностьНеОблагНДС        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ТоргДеятельность);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслуги                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.БытУслугиНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_БытУслуги);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалюты                         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАморт                    , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыАмортНеОблагНДС          , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ОбмВалютыНеОблагНДС               , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ОбмВалюты);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнес                        , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАморт                   , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесАмортНеОблагНДС         , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);
	ПоПрибыли.Вставить(Справочники.НалоговыеНазначенияАктивовИЗатрат.ИгорБизнесНеОблагНДС              , Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ИгорБизнес);	
	
КонецПроцедуры

Процедура ЗаполнитьНалоговыеНазначенияНКУСправочниковРегистров() Экспорт
	
	ЗаполнитьНалоговыеНазначения();
	
КонецПроцедуры



