Перем глСерверТО Экспорт;

// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверТО() Экспорт

	Если глСерверТО = Неопределено Тогда
		//глСерверТО = Обработки.ТОСервер.Создать();
	КонецЕсли;

	Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// Получим параметры работы клиента за одно обращение к серверу
	// Чтобы при повторном вызове этой функции не было обращений к серверу
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	
	Если НЕ ПараметрыРаботыКлиента.ПользователюРазрешенЗапускКонфигурации Тогда
		Предупреждение(НСтр("ru = 'Вам не назначена роль ""Пользователь"". Запуск конфигурации невозможен.'"));
		Отказ = Истина;		
		Возврат; //Дальше нет необходимости выполнения, т.к. могут быть ошибки нарушения прав
	КонецЕсли; 	
	
	Если НЕ Отказ И ПараметрыРаботыКлиента.НеобходимоОбновлениеИнформационнойБазы  Тогда
		Предупреждение(НСтр("ru = 'Требуется обновить информационную базу. Обратитесь к администратору информационной базы. 
                             |Работа системы будет завершена.'"));
		           
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	ОбщегоНазначенияКлиент.УстановитьПроизвольныйЗаголовокПриложения();
	
КонецПроцедуры
