
Функция ОпределитьСтатьюЗатратСхемыРеализации(Субконто1, Субконто2, Субконто3) Экспорт
	
	Если ТипЗнч(Субконто1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		Возврат Субконто1;
	КонецЕсли;	
	
	Если ТипЗнч(Субконто2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		Возврат Субконто2;
	КонецЕсли;	
	
	Если ТипЗнч(Субконто3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		Возврат Субконто3;
	КонецЕсли;	
	
КонецФункции // ОпределитьСтатьюЗатратСхемыРеализации()
 
Функция ВыбиратьВалютнуюСуммуПланаСчетов(ВидПланаСчетов) Экспорт 
	Возврат (Не Метаданные.РегистрыБухгалтерии[ВидПланаСчетов].Ресурсы.Найти("ВалютнаяСумма") = Неопределено);
КонецФункции // ВыбиратьВалютнуюСуммуПланаСчетов()

Функция ОтборПоОрганизацииПланаСчетов(ВидПланаСчетов) Экспорт 
	Возврат (Не Метаданные.РегистрыБухгалтерии[ВидПланаСчетов].Измерения.Найти("Организация")= Неопределено);
КонецФункции // ОтборПоОрганизацииПланаСчетов()

 