
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогамиСервер.УстановитьОтборыВДинамическомСписке(Список, Параметры);
	
	//Условное оформление по списку непроведенных документов
	Если Параметры.Свойство("НепроведенныеДокументы") И Параметры.НепроведенныеДокументы.Количество()>0 Тогда
		СписокСсылок = Новый СписокЗначений();
		СписокСсылок.ЗагрузитьЗначения(Параметры.НепроведенныеДокументы);
		
		ЭлементУсловногоОформленияСписка = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформленияСписка.Использование = Истина;
		ЭлементУсловногоОформленияСписка.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТусклоРозовый);
		
		ОтборПоСсылке = ЭлементУсловногоОформленияСписка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСсылке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборПоСсылке.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборПоСсылке.ПравоеЗначение = СписокСсылок;
	КонецЕсли;
КонецПроцедуры
