&НаСервере
Процедура ДоработатьКомпоновщикПередВыводом()

	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	СписокРазделовУчета = Новый СписокЗначений;
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.МПЗ);
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.ТоварыОтгруженные);
	СписокРазделовУчета.Добавить(Перечисления.РазделыУчета.МатериалыВЭксплуатации);
		
	ПараметрРазделыУчета = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РазделыУчета"));
	Если ПараметрРазделыУчета <> Неопределено Тогда
		ПараметрРазделыУчета.Значение = СписокРазделовУчета;
		ПараметрРазделыУчета.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры // ДоработатьКомпоновщикПередВыводом()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоработатьКомпоновщикПередВыводом();
КонецПроцедуры
