
// Проверяет остатки по регистрам "ЗаявкиНаРасходованиеСредств" и "ДенежныеСредстваВРезерве"
// по переданной в параметре заявке и управляет значением отказа в проведении платежного документа
//
// Параметры
//  ЗаявкаНаРасходованиеСредств	:Документ.ЗаявкаНаРасходованиеСредств  – заявка, для которой формируются остатки
//  Дата						:Дата –дата, на которую формируются остатки
//  Отказ						:Булево –отказ в проведении документа
//  Заголовок					:Строка –представление документа при проведении
//  БанковскийСчетКасса			:Банковский счет, касса - место списания денежных средств
//  СуммаДокумента				:Число - сумма денежных средств к списанию
//  СуммаВзаиморасчетов			:Число - сумма взаиморасчетов по документу
//
Процедура ПроверитьОстаткиПоЗаявке(Дата,Отказ,Заголовок,
			БанковскийСчетКасса,СуммаДокумента,ТаблицаПлатежейУпр, ЕстьРазрешение) Экспорт
					
	ТабДоговорыЗаявки = ТаблицаПлатежейУпр.Скопировать();
	ТабДоговорыЗаявки.Свернуть("ДоговорКонтрагента,Сделка,ДокументПланированияПлатежа","СуммаВзаиморасчетов");
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов в ТЧ заявки
	
	Для Каждого Платеж Из ТабДоговорыЗаявки Цикл
		
		Если ЕстьРазрешение И НЕ ЗначениеЗаполнено(Платеж.ДокументПланированияПлатежа) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьРазрешение И НЕ ЗначениеЗаполнено(Платеж.ДокументПланированияПлатежа) Тогда
			
			Если Платеж.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
				ТекстСообщения = "Не указана заявка.";
			Иначе
				ТекстСообщения = "Договор: " + Платеж.ДоговорКонтрагента 
				+ ", сделка: " + ?(ЗначениеЗаполнено(Платеж.Сделка), Платеж.Сделка, "не указана")
				+ ": не указана заявка.";
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);	
			
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ ЕстьРазрешение И НЕ Платеж.ДокументПланированияПлатежа.Проведен Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(Строка(Платеж.ДокументПланированияПлатежа)+" не проведена.", Отказ, Заголовок);	
			
			Продолжить;
			
		КонецЕсли;
			
		Запрос = Новый Запрос;
		
		ТекстУсловия = "ЗаявкаНаРасходование = &ДокументЗаявка";
		
		Если ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) Тогда
			ТекстУсловия = ТекстУсловия + "
			|И ДоговорКонтрагента = &ДоговорКонтрагента";
			Запрос.УстановитьПараметр("ДоговорКонтрагента", Платеж.ДоговорКонтрагента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Платеж.Сделка) Тогда
			ТекстУсловия = ТекстУсловия + "
			|И (Сделка = &Сделка ИЛИ Сделка=Неопределено)";
			Запрос.УстановитьПараметр("Сделка", Платеж.Сделка);
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкиНаРасходованиеСредствОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток
					   |	
		               |ИЗ
		               |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(, " + ТекстУсловия + " ) КАК ЗаявкиНаРасходованиеСредствОстатки";
		
		Запрос.УстановитьПараметр("ДокументЗаявка", Платеж.ДокументПланированияПлатежа);
				
		РезультатЗапроса = Запрос.Выполнить();
		ВыбраннаяЗаявка  = РезультатЗапроса.Выбрать();
		
		Если НЕ ВыбраннаяЗаявка.Следующий() Тогда
			ОстатокПоЗаявке = 0;
		Иначе
			ОстатокПоЗаявке = ?(ВыбраннаяЗаявка.СуммаВзаиморасчетовОстаток = NULL, 0, ВыбраннаяЗаявка.СуммаВзаиморасчетовОстаток);
		КонецЕсли;
		
		Если ОстатокПоЗаявке < Платеж.СуммаВзаиморасчетов Тогда
			
			Если Платеж.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
				
				ВалютаПлатежа = Платеж.ДокументПланированияПлатежа.ВалютаДокумента;
				
				ТекстОшибки="Сумма платежа превышает остаток по заявке.
				|Текущий остаток = " + Формат(ОстатокПоЗаявке, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаПлатежа + "
				|Сумма платежа = " + Формат(Платеж.СуммаВзаиморасчетов, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаПлатежа;
				
			Иначе
				
				ВалютаРасчетовЗаявки = Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				
				ТекстОшибки = "Договор: " + Платеж.ДоговорКонтрагента + ", сделка: " + ?(ЗначениеЗаполнено(Платеж.Сделка), Платеж.Сделка, "не указана") + "
				|Сумма взаиморасчетов превышает остаток по заявке.
				|Текущий остаток = " + Формат(ОстатокПоЗаявке, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаРасчетовЗаявки + "
				|Сумма взаиморасчетов = "+Формат(Платеж.СуммаВзаиморасчетов, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаРасчетовЗаявки;
				
			КонецЕсли;	
			
			Если ЕстьРазрешение Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, , Заголовок, СтатусСообщения.Информация);
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ, Заголовок);
			КонецЕсли;
	
		КонецЕсли;
					
	КонецЦикла;
		
КонецПроцедуры // ПроверитьОстаткиПоЗаявке()

// Проверяет числится ли данный работник в указанной организации
//
// Параметры
//  Работник     – СправочникСсылка.ФизическиеЛица – Работник
//  Организация  – СправочникСсылка.Организации    – Организация
//  ДатаСреза    - Дата                            - Дата, на которую проверяется соответствие
//  Отказ        – Булево                          – Флаг отказа от проведения
//  Заголовок    – Строка                          – Заголовок сообщения об ошибке
//
Процедура ПроверитьСоответствиеРаботникаОрганизации(Работник, Организация, ДатаСреза, Отказ, Заголовок) Экспорт

	Возврат;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния,
	|   РаботникиОрганизацийСрезПоследних.Приказ
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		&ДатаСреза,
	|		Организация в (&СписокОрганизаций)
	|			И Физлицо = &Физлицо) КАК РаботникиОрганизацийСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Приказ.Дата УБЫВ";
	
	СписокОрганизаций = новый СписокЗначений;
	СписокОрганизаций.Добавить(Организация);
	Если ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
		СписокОрганизаций.Добавить(Организация.ГоловнаяОрганизация);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("Физлицо", Работник);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	флНеЧислится = истина;
	ПриказУвольнение = неопределено;
	Пока Выборка.Следующий() цикл
		Если Выборка.ПричинаИзмененияСостояния <> Перечисления.ПричиныИзмененияСостояния.Увольнение Тогда
			Если Выборка.Приказ <> ПриказУвольнение Тогда
				флНеЧислится = ложь;
				Прервать;
			КонецЕсли;
		Иначе
			ПриказУвольнение = Выборка.Приказ;
		КонецЕсли;
	КонецЦикла;
	Если флНеЧислится Тогда
		ТекстОшибки = "Работник "+Строка(Работник)+" не числится в организации """+Строка(Организация)+"""";
		
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ, Заголовок);

	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеРаботникаОрганизации()

// Сравнивается реквизит в документе с переданным в качестве параметра
//
// Параметры
//  ДокументСсылка			– <ДокументСсылка> – документ, в котором проверяется реквизит
//  ИмяРеквизита			– <Строка> – имя реквизита документа
//  ЗначениеДляСравнения	– <произвольное> – значение, с которым сравнивается реквизит документа
//  ИмяТаблицыДокумента		– <Строка> – можно передать имя таблицы документа в явном виде, 
//								чтобы избежать обращения к метаданным (необязательный параметр)
//
// Возвращаемое значение:
//   <Булево>   – <Истина> - реквизиты совпали, <Ложь> - реквизиты разные
//					для пустой ссылки считается, что проверка закончилась успешно
//					если к реквизитам документа нет прав на чтение - считается, что реквизиты разные
//
Функция ПроверитьЗначениеРеквизитаДокумента(ДокументСсылка, ИмяРеквизита, ЗначениеДляСравнения, ИмяТаблицыДокумента = "") Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяТаблицыДокумента = "" Тогда
		ИмяТаблицыДокумента = ДокументСсылка.Метаданные().Имя;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1
	|ИЗ
	|	Документ." + ИмяТаблицыДокумента + " КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка 
	|		И Док." + ИмяРеквизита + " = &ЗначениеДляСравнения");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ЗначениеДляСравнения", ЗначениеДляСравнения);
	Результат = Запрос.Выполнить();
	
	РеквизитыСовпали = НЕ Результат.Пустой();
	Возврат РеквизитыСовпали;

КонецФункции // ПроверитьЗначениеРеквизитаДокумента()

// Возвращает свободный остаток денежных средств (текущий остаток за вычетом сумм, уже предназначенных
// к списанию, и зарезервированных).
//
// Параметры
//  БанковскийСчетКасса			:Банковский счет, касса - место списания денежных средств
//  Дата						:Дата –дата, на которую формируются остатки
//
// Возвращаемое значение:
//   Свободный остаток			:число - свободный остаток на дату по выбранному счету (кассе)
//
Функция ПолучитьСвободныйОстатокДС(БанковскийСчетКасса,Дата, МассивЗаявки) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.СуммаОстаток 
	|		- ВЫБОР КОГДА НЕ((ДенежныеСредстваВРезервеОстатки.СуммаОстаток) ЕСТЬ NULL ) 
	|				ТОГДА ДенежныеСредстваВРезервеОстатки.СуммаОстаток 
	|				ИНАЧЕ 0 КОНЕЦ 
	|		- ВЫБОР КОГДА НЕ((ДенежныеСредстваКСписаниюОстатки.СуммаОстаток) ЕСТЬ NULL ) 
	|				ТОГДА ДенежныеСредстваКСписаниюОстатки.СуммаОстаток 
	|				ИНАЧЕ 0 КОНЕЦ 
	|		+ ВЫБОР КОГДА НЕ((ДенежныеСредстваКПолучениюОстатки.СуммаОстаток) ЕСТЬ NULL ) 
	|				ТОГДА ДенежныеСредстваКПолучениюОстатки.СуммаОстаток 
	|				ИНАЧЕ 0 КОНЕЦ КАК СвободныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата, БанковскийСчетКасса = &БанковскийСчетКасса) КАК ДенежныеСредстваОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВРезерве.Остатки(&Дата, БанковскийСчетКасса = &БанковскийСчетКасса И (НЕ ДокументРезервирования В (&МассивЗаявки))) КАК ДенежныеСредстваВРезервеОстатки
	|		ПО ДенежныеСредстваОстатки.БанковскийСчетКасса = ДенежныеСредстваВРезервеОстатки.БанковскийСчетКасса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКСписанию.Остатки(&Дата, БанковскийСчетКасса = &БанковскийСчетКасса) КАК ДенежныеСредстваКСписаниюОстатки
	|		ПО ДенежныеСредстваОстатки.БанковскийСчетКасса = ДенежныеСредстваКСписаниюОстатки.БанковскийСчетКасса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКПолучению.Остатки(&Дата, БанковскийСчетКасса = &БанковскийСчетКасса) КАК ДенежныеСредстваКПолучениюОстатки
	|		ПО ДенежныеСредстваОстатки.БанковскийСчетКасса = ДенежныеСредстваКПолучениюОстатки.БанковскийСчетКасса";
	
	Запрос.УстановитьПараметр("БанковскийСчетКасса",БанковскийСчетКасса);
	Запрос.УстановитьПараметр("Дата",Новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивЗаявки",МассивЗаявки);
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() И (НЕ РезультатЗапроса.СвободныйОстаток=NULL) Тогда
		Возврат РезультатЗапроса.СвободныйОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // ПолучитьСвободныйОстатокДС() 
	
// Возвращает остаток денежных средств в планируемых поступлениях, еще не размещенных по другим заявкам
// к списанию, и зарезервированных).
//
// Параметры
//  ДокументПланировани			:Документ планируемого поступления денежных средств
//  Дата						:Дата –дата, на которую формируются остатки
//
// Возвращаемое значение:
//   Свободный остаток			:число - свободный остаток на дату выбранному документу
//
Функция ПолучитьНеразмещенныйостаток(ДокументПланирования,Дата, ЗаявкаНаРасходованиеСредств) Экспорт

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПланируемыеПоступленияДенежныхСредствОстатки.СуммаОстаток - ВЫБОР КОГДА НЕ((РазмещениеЗаявокНаРасходованиеСредствОстатки.СуммаОстаток) ЕСТЬ NULL ) ТОГДА РазмещениеЗаявокНаРасходованиеСредствОстатки.СуммаОстаток ИНАЧЕ 0 КОНЕЦ КАК СвободныйОстаток
	             |ИЗ
	             |	РегистрНакопления.ПланируемыеПоступленияДенежныхСредств.Остатки(&Дата, ДокументПланирования = &ДокументПланирования) КАК ПланируемыеПоступленияДенежныхСредствОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаявокНаРасходованиеСредств.Остатки(, НЕ(ДокументРезервирования = &ТекущаяЗаявка)) КАК РазмещениеЗаявокНаРасходованиеСредствОстатки
	             |		ПО ПланируемыеПоступленияДенежныхСредствОстатки.ДокументПланирования = РазмещениеЗаявокНаРасходованиеСредствОстатки.ДокументПланирования";
	
	
	Запрос.УстановитьПараметр("ДокументПланирования",ДокументПланирования);
	Запрос.УстановитьПараметр("Дата",Новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ТекущаяЗаявка",ЗаявкаНаРасходованиеСредств);
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() И (НЕ РезультатЗапроса.СвободныйОстаток=NULL) Тогда
		Возврат РезультатЗапроса.СвободныйОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции // ПолучитьНеразмещенныйостаток()

// Возвращает таблицу, аналогичную таблице "Расшифровка платежа" с добавленной колонкой "СуммаУпр"
//
Функция ПолучитьТаблицуПлатежейУпр(ДатаДокумента,ВалютаДокумента,Документ, ВидПлатежногоДокумента) Экспорт
	
	ВыбиратьДокументРасчетовСКонтрагентом = (	ВидПлатежногоДокумента = "ПлатежноеПоручениеВходящее"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеПоручениеИсходящее"
											ИЛИ ВидПлатежногоДокумента = "РасходныйКассовыйОрдер"
											ИЛИ ВидПлатежногоДокумента = "ПриходныйКассовыйОрдер"
											ИЛИ ВидПлатежногоДокумента = "ПлатежныйОрдерСписаниеДенежныхСредств"
											ИЛИ ВидПлатежногоДокумента = "ПлатежныйОрдерПоступлениеДенежныхСредств"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеВыставленное"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеПолученное"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеПоручениеВыставленное"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеПоручениеПолученное"
											ИЛИ ВидПлатежногоДокумента = "АккредитивПереданный"
											ИЛИ ВидПлатежногоДокумента = "АккредитивПолученный");
	
	КонтролироватьЗадолженности=(	ВидПлатежногоДокумента = "ПлатежноеПоручениеИсходящее"
											ИЛИ ВидПлатежногоДокумента = "РасходныйКассовыйОрдер"
											ИЛИ ВидПлатежногоДокумента = "ПлатежныйОрдерСписаниеДенежныхСредств"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеПолученное"
											ИЛИ ВидПлатежногоДокумента = "ПлатежноеТребованиеПоручениеПолученное"
											ИЛИ ВидПлатежногоДокумента = "АккредитивПереданный");										
											
	Запрос=Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,";
	Если КонтролироватьЗадолженности Тогда
		Запрос.Текст=Запрос.Текст+"
		|	РасшифровкаПлатежаДок.ДоговорКонтрагента.КонтролироватьСуммуЗадолженности КАК КонтролироватьСуммуЗадолженности,
		|	РасшифровкаПлатежаДок.ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности КАК КонтролироватьЧислоДнейЗадолженности,
		|	РасшифровкаПлатежаДок.ДоговорКонтрагента.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
		|	РасшифровкаПлатежаДок.ДоговорКонтрагента.ПроцентПредоплаты КАК ПроцентПредоплаты,";
	Иначе
		Запрос.Текст=Запрос.Текст+"
		|	ЛОЖЬ КАК КонтролироватьСуммуЗадолженности,
		|	ЛОЖЬ КАК КонтролироватьЧислоДнейЗадолженности,
		|	0 КАК ДопустимаяСуммаЗадолженности,
		|	0 КАК ПроцентПредоплаты,";
	КонецЕсли;
	Запрос.Текст=Запрос.Текст+"
	|	ВЫБОР КОГДА НЕ РасшифровкаПлатежаДок.ДоговорКонтрагента=&ПустойДоговор 
	|		Тогда РасшифровкаПлатежаДок.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
	|		Иначе ЛОЖЬ КОНЕЦ КАК ВестиПоДокументамРасчетовСКонтрагентом,	
	|	РасшифровкаПлатежаДок.Сделка КАК Сделка," + ?(ВыбиратьДокументРасчетовСКонтрагентом, "
	|	РасшифровкаПлатежаДок.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,", "") + "
	|	РасшифровкаПлатежаДок.ЗаТару КАК ЗаТару,
	|	РасшифровкаПлатежаДок.СуммаПлатежа КАК СуммаПлатежа,
	|	РасшифровкаПлатежаДок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасшифровкаПлатежаДок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасшифровкаПлатежаДок.ДокументПланированияПлатежа КАК ДокументПланированияПлатежа,
	|	РасшифровкаПлатежаДок.ДокументПланированияПлатежа.ВключатьВПлатежныйКалендарь КАК ВключатьВПлатежныйКалендарь,
	|	РасшифровкаПлатежаДок.Проект КАК Проект,
	|	РасшифровкаПлатежаДок.СуммаПлатежаПлан КАК СуммаПлатежаПлан,
	|	ВЫРАЗИТЬ 
	|	(ВЫБОР 
	|		КОГДА &ВалютаДокумента=&ВалютаУпрУчета ТОГДА РасшифровкаПлатежаДок.СуммаПлатежа
	|		КОГДА (КурсыУпрУчета.Курс ЕСТЬ NULL) ИЛИ (КурсыДокумента.Курс ЕСТЬ NULL) ТОГДА 0
	|		КОГДА &ВалютаДокумента<>&ВалютаУпрУчета И КурсыДокумента.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
	|			РасшифровкаПлатежаДок.СуммаПлатежа*КурсыДокумента.Курс * КурсыУпрУчета.Кратность 
	|			/ (КурсыУпрУчета.Курс * КурсыДокумента.Кратность)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО (15,2)) КАК СуммаУпр,
	|	ВЫРАЗИТЬ 
	|	(ВЫБОР 
	|		КОГДА &ВалютаДокумента=&ВалютаРеглУчета ТОГДА РасшифровкаПлатежаДок.СуммаПлатежа
	|		КОГДА (КурсыУпрУчета.Курс ЕСТЬ NULL) ИЛИ (КурсыДокумента.Курс ЕСТЬ NULL) ТОГДА 0
	|		КОГДА &ВалютаДокумента<>&ВалютаРеглУчета И КурсыДокумента.Курс <>0 ТОГДА
	|			РасшифровкаПлатежаДок.СуммаПлатежа*КурсыДокумента.Курс
	|			/ КурсыДокумента.Кратность
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК ЧИСЛО (15,2)) КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА КурсыДокумента.Курс ЕСТЬ NULL ТОГДА 0
	|		ИНАЧЕ КурсыДокумента.Курс КОНЕЦ Как КурсДокумента,
	|	ВЫБОР
	|		КОГДА КурсыДокумента.Кратность ЕСТЬ NULL ТОГДА 0
	|		ИНАЧЕ КурсыДокумента.Кратность КОНЕЦ Как КратностьДокумента,
	|	ВЫБОР
	|		КОГДА КурсыУпрУчета.Курс ЕСТЬ NULL ТОГДА 0
	|		ИНАЧЕ КурсыУпрУчета.Курс КОНЕЦ Как КурсУпрУчета,
	|	ВЫБОР
	|		КОГДА КурсыУпрУчета.Кратность ЕСТЬ NULL ТОГДА 0
	|		ИНАЧЕ КурсыУпрУчета.Кратность КОНЕЦ Как КратностьУпрУчета,
	|	ЕСТЬNULL(ОстаткиВзаиморасчетовПоДокументам.СуммаВзаиморасчетовОстаток, ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаВзаиморасчетовОстаток, 0)) КАК СуммаВзаиморасчетовОстаток,
	|	ВЫБОР КОГДА ОстаткиВзаиморасчетовПоДокументам.СуммаВзаиморасчетовОстаток ЕСТЬ NULL 
	|		ТОГДА
	|			ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаУпрОстаток, 0) 
	|		КОГДА ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаВзаиморасчетовОстаток, 0) = 0
	|			ТОГДА
	|				ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаУпрОстаток, 0) 
	|		ИНАЧЕ
	|			ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаУпрОстаток, 0) * ЕСТЬNULL(ОстаткиВзаиморасчетовПоДокументам.СуммаВзаиморасчетовОстаток, 0) / ОстаткиВзаиморасчетов.СуммаВзаиморасчетовОстаток
	|	КОНЕЦ КАК СуммаУпрОстаток
	|ИЗ
	|	Документ."+ВидПлатежногоДокумента+".РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
	|	ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта=&ВалютаДокумента) КАК КурсыДокумента
	|	ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,ДоговорКонтрагента В (
	|																			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|																				РасшифровкаПлатежаДокВнутр.ДоговорКонтрагента
	|																			ИЗ
	|																			Документ."+ВидПлатежногоДокумента+".РасшифровкаПлатежа КАК РасшифровкаПлатежаДокВнутр
	|																				ГДЕ РасшифровкаПлатежаДокВнутр.Ссылка = &Ссылка)
	|															) КАК ОстаткиВзаиморасчетов
	|	ПО РасшифровкаПлатежаДок.ДоговорКонтрагента = ОстаткиВзаиморасчетов.ДоговорКонтрагента
	|		И ВЫБОР КОГДА РасшифровкаПлатежаДок.Сделка В (&ПустыеСделки) ТОГДА Неопределено ИНАЧЕ РасшифровкаПлатежаДок.Сделка КОНЕЦ = ОстаткиВзаиморасчетов.Сделка
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(,ДоговорКонтрагента В (
	|																			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|																				РасшифровкаПлатежаДокВнутр.ДоговорКонтрагента
	|																			ИЗ
	|																			Документ."+ВидПлатежногоДокумента+".РасшифровкаПлатежа КАК РасшифровкаПлатежаДокВнутр
	|																				ГДЕ РасшифровкаПлатежаДокВнутр.Ссылка = &Ссылка)
	|															) КАК ОстаткиВзаиморасчетовПоДокументам
	|	ПО РасшифровкаПлатежаДок.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом = ИСТИНА 
	|		И РасшифровкаПлатежаДок.ДоговорКонтрагента = ОстаткиВзаиморасчетовПоДокументам.ДоговорКонтрагента
	|		И ВЫБОР КОГДА РасшифровкаПлатежаДок.Сделка В (&ПустыеСделки) ТОГДА Неопределено ИНАЧЕ РасшифровкаПлатежаДок.Сделка КОНЕЦ = ОстаткиВзаиморасчетовПоДокументам.Сделка" + ?(ВыбиратьДокументРасчетовСКонтрагентом, "
	|		И ВЫБОР КОГДА РасшифровкаПлатежаДок.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы) ТОГДА Неопределено ИНАЧЕ РасшифровкаПлатежаДок.ДокументРасчетовСКонтрагентом КОНЕЦ = ОстаткиВзаиморасчетовПоДокументам.ДокументРасчетовСКонтрагентом", "") + "
	|ГДЕ
	|	РасшифровкаПлатежаДок.Ссылка = &Ссылка";
	
	// Получим ссылки пустых документов:
	ТипыСделок = Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Измерения.Сделка.Тип.Типы();
	МассивПустыхСделок = Новый Массив;
	Для каждого Элемент Из ТипыСделок Цикл
		МассивПустыхСделок.Добавить(Новый(Элемент));
	КонецЦикла;
	
	ТипыРасчетныхДокументов = Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Измерения.ДокументРасчетовСКонтрагентом.Тип.Типы();
	МассивПустыхРасчетныхДокументов = Новый Массив;
	Для каждого Элемент Из ТипыРасчетныхДокументов Цикл
		МассивПустыхРасчетныхДокументов.Добавить(Новый(Элемент));
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПустыеСделки",МассивПустыхСделок);
	Запрос.УстановитьПараметр("ПустыеРасчетныеДокументы",МассивПустыхРасчетныхДокументов);
	
	Запрос.УстановитьПараметр("ДатаДокумента",ДатаДокумента);
	Запрос.УстановитьПараметр("ВалютаДокумента",ВалютаДокумента);
	Запрос.УстановитьПараметр("ВалютаУпрУчета",глЗначениеПеременной("ВалютаУправленческогоУчета"));
	Запрос.УстановитьПараметр("ВалютаРеглУчета",глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	Запрос.УстановитьПараметр("Ссылка",Документ);
	Запрос.УстановитьПараметр("ПустойДоговор",Справочники.ДоговорыКонтрагентов.ПустаяСсылка());	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуПлатежей()

Функция ПолучитьДатуДвижений(ДатаДокумента,ДатаОплаты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаОплаты) Тогда
		
		ДатаДвижений=ДатаДокумента;
		
	ИначеЕсли КонецДня(ДатаДокумента)=КонецДня(ДатаОплаты) Тогда
		
		СпособОпределения = глЗначениеПеременной("ОпределениеВремениПроведенияПлатежногоДокумента");
			
		Если СпособОпределения=Перечисления.СпособыОпределенияВремениПроведенияПлатежногоДокумента.ПоВремениРегистрацииДокумента Тогда
			
			ДатаДвижений=ДатаДокумента;
			
		Иначе
			
			ДатаДвижений = КонецДня(ДатаОплаты);
			
		КонецЕсли;
		
	Иначе
		
		ДатаДвижений=КонецДня(ДатаОплаты);
		
	КонецЕсли;
	
	Возврат ДатаДвижений;
	
КонецФункции // ПолучитьДатуДвижений()

// Процедура выполняет заполнение суммы документа,
// по регистру "СуммыЗаказов".
//
// Параметры:
//  ДокументОснование  - документ ссылка (Заказ покупателя, Заказ поставщику).
//  ВалютаДокумента    - валюта документа (валюта регламентированного учета организаций)
//  КурсВзаиморасчетов - курс взаиморасчетов по договору
//  КратностьВзаиморасчетов - кратность взаиморасчетов по договору
//
Процедура ЗаполнитьПоЗаказуУпр(ДокументОснование, ВалютаДокумента,КурсДокумента,КратностьДокумента,СтрокаПлатеж, Коэффициент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);
	
	Запрос.Текст ="ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.Сделка Как Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(, Сделка = &Заказ) КАК РасчетыСКонтрагентамиОстатки
	|ГДЕ
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток "+?(Коэффициент=1,">0","<0")+"
	|
	|";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Сделка = Выборка.Сделка;
		
		СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.Сумма*Коэффициент;
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма*Коэффициент,
		СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, 
		ВалютаДокумента,
		СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
		
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект) Тогда
				СтрокаПлатеж.Проект=СтрокаПлатеж.ДоговорКонтрагента.ОсновнойПроект;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказуУпр()

// Процедура выполняет заполнение суммы документа,
// суммы взаиморасчетов по регистру "КонтрагентыВзаиморасчетыКомпании".
//
Процедура ЗаполнитьПоВзаиморасчетамУпр(ВалютаДокумента,КурсДокумента,КратностьДокумента,СтрокаПлатеж,Коэффициент) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента);
	
	ТекстУсловия="";
	
	Если НЕ СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		Запрос.УстановитьПараметр("Сделка", СтрокаПлатеж.Сделка);
		ТекстУсловия=ТекстУсловия+" И Сделка=&Сделка";
	КонецЕсли;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		Запрос.УстановитьПараметр("ДокументРасчетовСКонтрагентом", СтрокаПлатеж.ДокументРасчетовСКонтрагентом);
		ТекстУсловия=ТекстУсловия+" И ДокументРасчетовСКонтрагентом = &ДокументРасчетовСКонтрагентом
		|";
		ТекстРегистр="ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов";
	Иначе
		ТекстРегистр="ВзаиморасчетыСКонтрагентами";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сделка КАК Сделка,
	|	СуммаВзаиморасчетовОстаток КАК СуммаДолга // в валюте взаиморасчетов
	|ИЗ
	|	РегистрНакопления."+ТекстРегистр+".Остатки(,
	|	                                                    ДоговорКонтрагента = &ДоговорКонтрагента
	|	                                                   "+ТекстУсловия+")
	|ГДЕ
	|	СуммаВзаиморасчетовОстаток "+?(Коэффициент=1,">0","<0");

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаДолга*Коэффициент;
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, 
		                            СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ВалютаДокумента,
		                            СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		                            СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
									
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;							
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоВзаиморасчетамУпр()

// Заполняет сумму документа и сумму взаиморасчетов на основании остатка
// по заявке в регистре "ЗаявкиНаРасходованиеСредств"
//
Процедура ЗаполнитьПоЗаявкеУпр(ДокументОбъект,ДокументОснование,ТекущийПользователь) Экспорт
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов заявки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаПлатежа,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.Контрагент КАК Контрагент,
	|	ЗаявкиНаРасходованиеСредствОстатки.Контрагент.ОсновнойБанковскийСчет КАК СчетКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.Сделка КАК Сделка,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДокументРасчетовСКонтрагентом,
	|	ЗаявкиНаРасходованиеСредствОстатки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаРасходованиеСредствОстатки.Проект КАК Проект,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.ВалютаВзаиморасчетовПодотчетника КАК ВалютаВзаиморасчетовПодотчетника,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Ссылка КАК ЗаявкаНаРасходование,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Получатель КАК Получатель
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(, ЗаявкаНаРасходование = &ДокументЗаявка) КАК ЗаявкиНаРасходованиеСредствОстатки";
	
	Запрос.УстановитьПараметр("ДокументЗаявка",ДокументОснование);
	
	СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнаяСтавкаНДС");
	
	РезультатЗапроса=Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДокументОбъект.РасшифровкаПлатежа.Очистить();
	Иначе
		Если ДокументОснование.Проведен Тогда
			Сообщить("Эта заявка уже закрыта. Невыплаченный остаток по ней равен нулю.");
		Иначе
			Сообщить("Заявка должна быть проведена. Невыплаченный остаток по ней равен нулю.");
		КонецЕсли;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога
			ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			
			СтрокаПлатеж					 = ДокументОбъект.РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.СуммаПлатежа		 = Выборка.СуммаПлатежа;
			СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.СуммаПлатежа;
			ДокументОбъект.Контрагент		 = Выборка.Контрагент;
			
		Иначе
			
			ДокументОбъект.Контрагент = Выборка.Контрагент;
			
			Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				ДокументОбъект.СчетКонтрагента = Выборка.СчетКонтрагента;
			КонецЕсли;
			
			СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов;
			СтрокаПлатеж.СуммаПлатежа		 = Выборка.СуммаПлатежа;
			
			Если ДокументОбъект.ВалютаДокумента = Выборка.ВалютаВзаиморасчетов Тогда
				СтрокаПлатеж.КурсВзаиморасчетов		 = ДокументОбъект.КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = ДокументОбъект.КратностьДокумента;
			Иначе
				
				СтруктураКурсВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетов,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (ДокументОбъект.КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * ДокументОбъект.КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / ДокументОбъект.КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС						 = СтавкаНДС;
			СтрокаПлатеж.Сделка							 = Выборка.Сделка;
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом	 = Выборка.ДокументРасчетовСКонтрагентом;
			СтрокаПлатеж.ДоговорКонтрагента				 = Выборка.ДоговорКонтрагента;
			
			ПересчитатьСуммуНДС(СтрокаПлатеж);
			
		КонецЕсли;
		
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств	 = Выборка.СтатьяДвиженияДенежныхСредств;
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			СтрокаПлатеж.Проект						 = Выборка.Проект;
		КонецЕсли;
		СтрокаПлатеж.ДокументПланированияПлатежа	 = Выборка.ЗаявкаНаРасходование;
		СтрокаПлатеж.СуммаПлатежаПлан				 = СтрокаПлатеж.СуммаПлатежа;
		СтрокаПлатеж.КурсВзаиморасчетовПлан			 = СтрокаПлатеж.КурсВзаиморасчетов;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента=ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры // ЗаполнитьПоЗаявкеУпр()

// Заполняет сумму документа и сумму взаиморасчетов на основании остатка
// по планируемому поступлению в регистре "ПланируемыеПоступленияДенежныхСредств"
//
Процедура ЗаполнитьПоПланируемомуПоступлениюУпр(РасшифровкаПлатежа,ДокументОснование,СтавкаНДС,ВалютаДокумента,КурсДокумента,КратностьДокумента,ВидОперации) Экспорт
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов заявки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланируемоеПоступлениеОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ПланируемоеПоступлениеОстатки.СуммаОстаток КАК СуммаПлатежа,
	|	ПланируемоеПоступлениеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПланируемоеПоступлениеОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПланируемоеПоступлениеОстатки.Сделка КАК Сделка,
	|	ПланируемоеПоступлениеОстатки.ДокументРасчетовСКонтрагентом,
	|	ПланируемоеПоступлениеОстатки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ПланируемоеПоступлениеОстатки.Проект КАК Проект,
	|	ПланируемоеПоступлениеОстатки.ДокументПланирования.Ссылка КАК ДокументПланирования
	|ИЗ
	|	РегистрНакопления.ПланируемыеПоступленияДенежныхСредств.Остатки(, ДокументПланирования = &ДокументПланирования) КАК ПланируемоеПоступлениеОстатки";
	
	Запрос.УстановитьПараметр("ДокументПланирования",ДокументОснование);
	РасшифровкаПлатежа.Очистить();
		
	РезультатЗапроса=Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств
			ИЛИ ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее
			//Смартис Лиманчук начало 05.11.2012
			ИЛИ ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочееНал
			//Смартис Лиманчук окончание 05.11.2012
			//Смартис Лиманчук начало 01.11.2012
			ИЛИ ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручкаНал
			//Смартис Лиманчук окончание 01.11.2012
			ИЛИ ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
			
			СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.СуммаПлатежа;
			
		Иначе
			
			СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			
			Если ВалютаДокумента = Выборка.ВалютаВзаиморасчетов Тогда
				СтрокаПлатеж.КурсВзаиморасчетов      = КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = КратностьДокумента;
			Иначе
				
				СтруктураКурсВзаиморасчетов=МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетов,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПлатеж.КурсВзаиморасчетовПлан=СтрокаПлатеж.КурсВзаиморасчетов;
			СтрокаПлатеж.СуммаПлатежаПлан=СтрокаПлатеж.СуммаПлатежа;
			
		КонецЕсли;
		
		СтрокаПлатеж.СтавкаНДС = СтавкаНДС;
		СтрокаПлатеж.Сделка = Выборка.Сделка;
		СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Выборка.ДокументРасчетовСКонтрагентом;
		СтрокаПлатеж.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			СтрокаПлатеж.Проект = Выборка.Проект;
		КонецЕсли;
		СтрокаПлатеж.ДокументПланированияПлатежа = Выборка.ДокументПланирования;
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		
	КонецЦикла;
	
	Если РасшифровкаПлатежа.Количество()=0 Тогда
		НоваяСтрока=РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ДокументПланированияПлатежа=ДокументОснование;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаявкеУпр()

// Заполняет входящий платежный документ на основании исходящего (для расчетов между собственными организациями)
//
Процедура ЗаполнитьПоПлатежномуДокументу(ДокументОбъект,Основание)
	
	ОпределитьВидОперацииПоПлатежномуДокументу(Основание.ВидОперации, ДокументОбъект.ВидОперации);	
	
	// Получим преобразованный номер документа
	ПреобразованныйНомер = СокрЛП(Основание.Номер);

	Префикс = "";
	МетаданныеДокумента = Основание.Метаданные();

	Если ЗначениеЗаполнено(Основание.Организация) Тогда
		Префикс = СокрЛП(Основание.Организация.Префикс);
	КонецЕсли;

	// удаление префикса из номера документа
	Если Найти(ПреобразованныйНомер, Префикс)=1 Тогда 
		ПреобразованныйНомер = Сред(ПреобразованныйНомер, СтрДлина(Префикс)+1);
	КонецЕсли;

	// так же, может остаться "минус" впереди
	Если Лев(ПреобразованныйНомер, 1) = "-" Тогда
		ПреобразованныйНомер = Сред(ПреобразованныйНомер, 2);
	КонецЕсли;

	// удаление ведущих нулей
	Пока Лев(ПреобразованныйНомер, 1)="0" Цикл
		ПреобразованныйНомер=Сред(ПреобразованныйНомер, 2);
	КонецЦикла;
	
	ДокументОбъект.НомерВходящегоДокумента = ПреобразованныйНомер;
	ДокументОбъект.ДатаВходящегоДокумента  = Основание.Дата;
	
	// Поменяем организацию и контрагента местами.	
	ДокументОбъект.Организация = ЗаполнениеДокументов.ПолучитьОрганизациюПоКонтрагенту(Основание.Контрагент);
	ДокументОбъект.Контрагент  = ЗаполнениеДокументов.ПолучитьКонтрагентаПоОрганизации(Основание.Организация);
	
	ДокументОбъект.СчетОрганизации=Основание.СчетКонтрагента;
	ДокументОбъект.СчетКонтрагента=Основание.СчетОрганизации;
	
	ДокументОбъект.ВалютаДокумента=Основание.ВалютаДокумента;
	
	Если ДокументОбъект.Организация = ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента.Организация Тогда
		ДоговорКонтрагента = ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента;
	Иначе
		ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;	
	
	// Получим список договоров между собственными организациями
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	             |	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	             |ИЗ
	             |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	             |
	             |ГДЕ
	             |	ДоговорыКонтрагентов.Владелец = &Владелец И
	             |	ДоговорыКонтрагентов.Организация = &Организация";
				 
	Запрос.УстановитьПараметр("Владелец",ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация",ДокументОбъект.Организация);
	ТабДоговоры=Запрос.Выполнить().Выгрузить();
	
	ВидДокумента=Основание.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ
	|	ПлатежныйДокументРасшифровкаПлатежа.КурсВзаиморасчетов,
	|	ПлатежныйДокументРасшифровкаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПлатежныйДокументРасшифровкаПлатежа.СуммаПлатежа,
	|	ПлатежныйДокументРасшифровкаПлатежа.КратностьВзаиморасчетов,
	|	ПлатежныйДокументРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ПлатежныйДокументРасшифровкаПлатежа.СтавкаНДС,
	|	ПлатежныйДокументРасшифровкаПлатежа.СуммаНДС,
	|	ПлатежныйДокументРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ПлатежныйДокументРасшифровкаПлатежа.Проект,
	|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка.СуммаДокумента,
	|	КурсыВалютСрезПоследних.Курс КАК КурсДокумента,
	|	КурсыВалютСрезПоследних.Кратность КАК КратностьДокумента
	|ИЗ
	|	Документ."+ВидДокумента+".РасшифровкаПлатежа КАК ПлатежныйДокументРасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ПО ПлатежныйДокументРасшифровкаПлатежа.Ссылка.ВалютаДокумента = КурсыВалютСрезПоследних.Валюта
	|
	|ГДЕ
	|	ПлатежныйДокументРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Основание);
	
	РезультатЗапроса=Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументОбъект.СуммаДокумента=Выборка.СуммаДокумента;
		ДокументОбъект.КурсДокумента=Выборка.КурсДокумента;
		ДокументОбъект.КратностьДокумента=Выборка.КратностьДокумента;
		Выборка.Сбросить();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа.Добавить();
		
		СтруктураПоискаДоговор=Новый Структура;
		СтруктураПоискаДоговор.Вставить("ДоговорКонтрагента",ДоговорКонтрагента);
		СтруктураПоискаДоговор.Вставить("ВалютаВзаиморасчетов",Выборка.ВалютаВзаиморасчетов);
		
		МассивДоговор=ТабДоговоры.НайтиСтроки(СтруктураПоискаДоговор);
		
		Если МассивДоговор.Количество()=1 Тогда
			СтрокаПлатеж.ДоговорКонтрагента=ДоговорКонтрагента;
		Иначе
			СтруктураПоискаВалюта=Новый Структура;
			СтруктураПоискаВалюта.Вставить("ВалютаВзаиморасчетов",Выборка.ВалютаВзаиморасчетов);
			
			МассивВалюта=ТабДоговоры.НайтиСтроки(СтруктураПоискаВалюта);
			Если МассивВалюта.Количество()>0 Тогда
				СтрокаПлатеж.ДоговорКонтрагента=МассивВалюта[0].ДоговорКонтрагента;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаПлатеж.КурсВзаиморасчетов=Выборка.КурсВзаиморасчетов;
		СтрокаПлатеж.КратностьВзаиморасчетов=Выборка.КратностьВзаиморасчетов;
		СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
		СтрокаПлатеж.СуммаПлатежа=Выборка.СуммаПлатежа;
		СтрокаПлатеж.СтавкаНДС=Выборка.СтавкаНДС;
		СтрокаПлатеж.СуммаНДС=Выборка.СуммаНДС;	
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=Выборка.СтатьяДвиженияДенежныхСредств;
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			СтрокаПлатеж.Проект=Выборка.Проект;
		КонецЕсли;
		
	КонецЦикла;
				 	
КонецПроцедуры // ЗаполнитьПриходПоПлатежномуДокументу()

// Стандартная процедура ввода расходного платежного документа на основании. Применяется ко всем документам,
// кроме исходящего платежного поручения и расходного кассового ордера.
//
Процедура ЗаполнитьРасходПоОснованию(ДокументОбъект, Основание, ПользовательДокумента) Экспорт
	
	мВалютаРегламентированногоУчета=глЗначениеПеременной("ВалютаРегламентированногоУчета");
	СтавкаНДС=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПользовательДокумента,"ОсновнаяСтавкаНДС");
		
	СпособЗаполнения = "Не заполнять";
	ДокументОбъект.ВалютаДокумента  = мВалютаРегламентированногоУчета;
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") 
		 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
		СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа.Добавить();
		
		ДокументОбъект.ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику;
		СтрокаПлатеж.ДоговорКонтрагента        = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,);
		СтрокаПлатеж.КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;
		
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.ДоговорКонтрагента.ОсновнойПроект) Тогда
				СтрокаПлатеж.Проект=Основание.ДоговорКонтрагента.ОсновнойПроект;
			КонецЕсли;
		КонецЕсли;
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику"))
			И (СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			СтрокаПлатеж.Сделка=Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			
			СтрокаПлатеж.Сделка=Основание;
			
		КонецЕсли;
									
		Если ЗначениеЗаполнено(Основание.СтруктурнаяЕдиница) Тогда
			ДокументОбъект.СчетОрганизации          = Основание.СтруктурнаяЕдиница;
		Иначе
			ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		КонецЕсли;	
		
		Если НЕ ДокументОбъект.СчетОрганизации.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
	
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") И Основание.Проведен  Тогда
			СпособЗаполнения = "По заказу";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		Если НЕ ДокументОбъект.СчетОрганизации.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента      		= СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента 		= СтруктураКурсаДокумента.Кратность;	
		СтрокаПлатеж.СтавкаНДС	= СтавкаНДС;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")) 
			или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДопРасходов")) 
		  	или (ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")) 
		  	или (ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")) Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю;
		Иначе
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику;
		КонецЕсли;
		
		СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа.Добавить();
		
		ДокументОбъект.Контрагент  = Основание.Контрагент;
		СтрокаПлатеж.ДоговорКонтрагента        = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,);
		СтрокаПлатеж.КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ПоступлениеДопРасходов") И 
			УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				СтрокаПлатеж.Проект=Основание.Проект;
			КонецЕсли;
		КонецЕсли;

		СтрокаПлатеж.Сделка = ?(ЗначениеЗаполнено(Основание.Сделка), Основание.Сделка, Неопределено);
		Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
		КонецЕсли;
		
		Если Основание.Проведен И ТипЗнч(Основание) <> Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			СпособЗаполнения = "По взаиморасчетам";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		
		Если НЕ ДокументОбъект.СчетОрганизации.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
			
		СтруктураКурсаДокумента           = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента      = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;	
		
		СтрокаПлатеж.СтавкаНДС=СтавкаНДС;
		
	ИначеЕсли Основание.Метаданные().Имя = "БюджетнаяОперация" Тогда
		
		СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа.Добавить();
		
		ДокументОбъект.ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику;
		ДокументОбъект.Контрагент = Основание.Контрагент;
		
		ЗаполнитьРеквизитыРасчетногоДокумента(ДокументОбъект, ПользовательДокумента, мВалютаРегламентированногоУчета,ДокументОбъект.РасшифровкаПлатежа);
		СтрокаПлатеж=ДокументОбъект.РасшифровкаПлатежа[0];
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				СтрокаПлатеж.Проект=Основание.Проект;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов=ДокументОбъект.ВалютаДокумента;
		Иначе
			ВалютаВзаиморасчетов=СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		// Получаем курсы валют
		СтруктураГруппаВалют = Новый Структура;
		СтруктураГруппаВалют.Вставить("ВалютаВзаиморасчетов",ВалютаВзаиморасчетов.Код);
		СтруктураГруппаВалют.Вставить("ВалютаДокумента",ДокументОбъект.ВалютаДокумента.Код);
		СтруктураГруппаВалют.Вставить("ВалютаОперации",Основание.ВалютаДокумента.Код);
		
		СтруктураКурсыВалют=ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,ДокументОбъект.Дата);
		
		ДокументОбъект.КурсДокумента=СтруктураКурсыВалют.ВалютаДокументаКурс;
		ДокументОбъект.КратностьДокумента=СтруктураКурсыВалют.ВалютаДокументаКратность;
		
		СтрокаПлатеж.КурсВзаиморасчетов=СтруктураКурсыВалют.ВалютаВзаиморасчетовКурс;
		СтрокаПлатеж.КратностьВзаиморасчетов=СтруктураКурсыВалют.ВалютаВзаиморасчетовКратность;
		ДокументОбъект.Подразделение=Основание.ЦФО;
		
		КурсОперации=СтруктураКурсыВалют.ВалютаОперацииКурс;
		КратностьОперации=СтруктураКурсыВалют.ВалютаОперацииКратность;
		
		ДокументОбъект.СуммаДокумента=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Сумма,
		Основание.ВалютаДокумента, 
		ДокументОбъект.ВалютаДокумента,
		КурсОперации, ДокументОбъект.КурсДокумента,
		КратностьОперации, ДокументОбъект.КратностьДокумента);
		
		СтрокаПлатеж.СуммаПлатежа=ДокументОбъект.СуммаДокумента;
		
		СтрокаПлатеж.СуммаВзаиморасчетов=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ДокументОбъект.СуммаДокумента,
		ДокументОбъект.ВалютаДокумента, 
		ВалютаВзаиморасчетов,
		ДокументОбъект.КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		ДокументОбъект.КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
		
		СтрокаПлатеж.СтавкаНДС=СтавкаНДС;
		ПересчитатьСуммуНДС(СтрокаПлатеж);
						
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		
		Если Основание.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные Тогда
			Сообщить("Заявка оформлена на расходование наличных денежных средств.");
			Возврат;
		КонецЕсли;
		Отказ = Ложь;
		УправлениеДенежнымиСредствами.ПроверитьСогласованиеЗаявок(Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ВидОперацииЗаявка = Основание.ВидОперации;
		
		ОпределитьОперациюПоОснованиюУпр(ДокументОбъект.ВидОперации,ВидОперацииЗаявка);
		
		ДокументОбъект.Организация = Основание.Организация;
		ДокументОбъект.ВалютаДокумента = Основание.ВалютаДокумента;
		
		Если ЗначениеЗаполнено(Основание.БанковскийСчетКасса) Тогда
			ДокументОбъект.СчетОрганизации = Основание.БанковскийСчетКасса;
		ИначеЕсли ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетОрганизации= ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		КонецЕсли;
		
		ДокументОбъект.Ответственный     = Основание.Ответственный;
		ДокументОбъект.ДокументОснование = Основание.Ссылка;
		
		Если ДокументОбъект.ВалютаДокумента.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента = мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента      = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		ЗаполнитьПоЗаявкеУпр(ДокументОбъект,Основание, ПользовательДокумента);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное") Или ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеТребованиеПоручениеВыставленное") Тогда
		ЗаполнитьПоПлатежномуДокументу(ДокументОбъект,Основание);
		ДокументОбъект.Ответственный = ПользовательДокумента;
		
	КонецЕсли;
	
	Если СпособЗаполнения = "По заказу" Тогда
		
		ЗаполнитьПоЗаказуУпр(Основание, ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ДокументОбъект.КратностьДокумента,СтрокаПлатеж,-1);
		
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		
		ДокументОбъект.СуммаДокумента=СтрокаПлатеж.СуммаПлатежа;
		ДокументОбъект.Ответственный=ПользовательДокумента;		
		
	ИначеЕсли СпособЗаполнения = "По взаиморасчетам" Тогда
		
		ЗаполнитьПоВзаиморасчетамУпр(ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ДокументОбъект.КратностьДокумента,СтрокаПлатеж,-1);
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		
		ДокументОбъект.Ответственный=ПользовательДокумента;
		
	ИначеЕсли СпособЗаполнения = "По сумме документа" Тогда
		
		// Если основание - отчет комитенту, то надо вычесть вознаграждение
		ОснованиеСуммаДокумента = Основание.СуммаДокумента;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			ОснованиеСуммаДокумента = ?(Основание.УдержатьКомиссионноеВознаграждение, ОснованиеСуммаДокумента - Основание.СуммаВознаграждения, ОснованиеСуммаДокумента);
		КонецЕсли;

		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования=СтруктураКурсаОснования.Курс;
		КратностьОснования=СтруктураКурсаОснования.Кратность;

		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                 КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента      = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДокументОбъект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                                 ДокументОбъект.КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов, ДокументОбъект.КратностьДокумента);
										 
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		
		ДокументОбъект.Ответственный=ПользовательДокумента;

	КонецЕсли;
	
	ДокументОбъект.СуммаДокумента=ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ДокументОбъект.ОтраженоВОперУчете=Истина;
	ДокументОбъект.ДокументОснование=Основание.Ссылка;
	
	
КонецПроцедуры // ЗаполнитьРасходПоОснованию

// Процедура стандартного заполнения входящего платежного документа при вводе на основании. Применима ко всем документам,
// кроме приходного кассового ордера.
//
Процедура ЗаполнитьПриходПоОснованию(ДокументОбъект, Основание, ПользовательДокумента) Экспорт
	
	мВалютаРегламентированногоУчета=глЗначениеПеременной("ВалютаРегламентированногоУчета");
	СтавкаНДС=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПользовательДокумента,"ОсновнаяСтавкаНДС");

	СпособЗаполнения = "Не заполнять";

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда

	    СтрокаПлатеж     = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	 
		СтрокаПлатеж.ДоговорКонтрагента      = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
		
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.ДоговорКонтрагента.ОсновнойПроект) Тогда
				СтрокаПлатеж.Проект=Основание.ДоговорКонтрагента.ОсновнойПроект;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И Основание.Проведен  Тогда
			СпособЗаполнения = "По заказу";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		СделкаПлатежа = Неопределено;
		ТипДокДляЗапроса = "ЗаказПокупателя";
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя"))
			И (СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			СделкаПлатежа=Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			ТипДокДляЗапроса = "СчетНаОплатуПокупателю";
			Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				СделкаПлатежа=Основание;
			ИначеЕсли СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
				И ЗначениеЗаполнено(Основание.ЗаказПокупателя) Тогда
				СделкаПлатежа=Основание.ЗаказПокупателя;
			ИначеЕсли СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
				СделкаПлатежа=Основание.ЗаказПокупателя;			
			КонецЕсли;
		КонецЕсли;
		
		//заполняем заказ покупателя из табличной части
		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования=СтруктураКурсаОснования.Курс;
		КратностьОснования=СтруктураКурсаОснования.Кратность;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументТовары.СтавкаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ДокументТовары.Ссылка.УчитыватьНДС
		|					И (НЕ ДокументТовары.Ссылка.СуммаВключаетНДС)
		|				ТОГДА ДокументТовары.Сумма + ДокументТовары.СуммаНДС
		|			ИНАЧЕ ДокументТовары.Сумма
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	Документ."+ТипДокДляЗапроса+".Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &СчетНаОплату
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументТовары.СтавкаНДС";
		
		Запрос.УстановитьПараметр("СчетНаОплату",Основание.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ПервыйПроход = Истина;
		Пока Выборка.Следующий() Цикл
			Если ПервыйПроход Тогда
				СтрокаПлатеж.Сделка = СделкаПлатежа;
				КопияСтрокаПлатеж = СтрокаПлатеж;
				ПервыйПроход = Ложь;
			Иначе
				СтрокаПлатеж = ДокументОбъект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПлатеж, КопияСтрокаПлатеж);
				//СтрокаПлатеж.Сделка = Выборка.ЗаказПокупателя;
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС = Выборка.СтавкаНДС;
			СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
											   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДокументОбъект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
							 ДокументОбъект.КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,ДокументОбъект.КратностьДокумента);
			СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
			ПересчитатьСуммуНДС(СтрокаПлатеж);
		КонецЦикла;
		
		ДокументОбъект.Ответственный      = ПользовательДокумента;
		СпособЗаполнения = "";
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ОплатаПокупателя;	
		Иначе	
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
		КонецЕсли;	

		Если ЗначениеЗаполнено(Основание.СтруктурнаяЕдиница) Тогда
			ДокументОбъект.СчетОрганизации = Основание.СтруктурнаяЕдиница;
		Иначе
			ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		КонецЕсли;
		
		Если НЕ ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;

		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента           = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента      = СтруктураКурсаДокумента.Кратность;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
		  ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг")Тогда

		СтрокаПлатеж     = ДокументОбъект.РасшифровкаПлатежа.Добавить(); 
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				СтрокаПлатеж.Проект=Основание.Проект;
			КонецЕсли;
		КонецЕсли;
		 
		СтрокаПлатеж.ДоговорКонтрагента   = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ОплатаПокупателя;	
		Иначе	
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
		КонецЕсли;	
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если ЗначениеЗаполнено(Основание.БанковскийСчетОрганизации) Тогда
				ДокументОбъект.СчетОрганизации = Основание.БанковскийСчетОрганизации;
			Иначе
				ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
			КонецЕсли;
			
		Иначе
			
			ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
			
		КонецЕсли;
		
		Если НЕ ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		СтрокаПлатеж.Сделка = ?(ЗначениеЗаполнено(Основание.Сделка), Основание.Сделка, Неопределено);
		Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
			
		КонецЕсли;
		
		Если Основание.Проведен И ТипЗнч(Основание) <> Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			СпособЗаполнения = "По взаиморасчетам";
		Иначе;
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
	
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента           = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		СтрокаПлатеж.СтавкаНДС  = СтавкаНДС;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда

		СтрокаПлатеж     = ДокументОбъект.РасшифровкаПлатежа.Добавить(); 
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				СтрокаПлатеж.Проект=Основание.Проект;
			КонецЕсли;
		КонецЕсли;
						 
		СтрокаПлатеж.ДоговорКонтрагента   = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
						
		ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
						
		Если НЕ ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;

		СтрокаПлатеж.Сделка = ?(ЗначениеЗаполнено(Основание.Сделка), Основание.Сделка, Неопределено);
		Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
							
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
							
			Если Основание.Проведен Тогда
				СпособЗаполнения = "По взаиморасчетам";
			КонецЕсли;
		Иначе
			Если Основание.Проведен Тогда
				СпособЗаполнения = "По сумме документа";
			КонецЕсли;
		КонецЕсли;

		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента           = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		СтрокаПлатеж.СтавкаНДС  = СтавкаНДС;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		или ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ") Тогда

		СтрокаПлатеж     = ДокументОбъект.РасшифровкаПлатежа.Добавить();
		Если УправлениеПроектами.ВедениеУчетаПоПроектам() Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				СтрокаПлатеж.Проект=Основание.Проект;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком;	
		Иначе	
			ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком;
		КонецЕсли;	
		ДокументОбъект.Контрагент  = Основание.Контрагент;

		СтрокаПлатеж.ДоговорКонтрагента   = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов         = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, );
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;

		ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		
		Если НЕ ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента=ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		Иначе
			ДокументОбъект.ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		Если ДокументОбъект.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
		КонецЕсли;

		СтрокаПлатеж.Сделка = Основание.Сделка;
		Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
		КонецЕсли;
		Если Основание.Проведен Тогда
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента           = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		СтрокаПлатеж.СтавкаНДС  = СтавкаНДС;
		
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ПланируемоеПоступлениеДенежныхСредств") Тогда
		
		Если (НЕ Основание.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Безналичные) 
			ИЛИ Основание.ВидОперации=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПриходДенежныхСредствРозничнаяВыручка Тогда
			Сообщить("Документом планировалось поступление наличных денежных средств.");
			Возврат;
		КонецЕсли;
		
		ВидОперацииПоступление = Основание.ВидОперации;
		
		ОпределитьОперациюПоОснованиюУпр(ДокументОбъект.ВидОперации,ВидОперацииПоступление);
		
		ДокументОбъект.Организация = Основание.Организация;
		ДокументОбъект.ВалютаДокумента = Основание.ВалютаДокумента;
		
		Если ЗначениеЗаполнено(Основание.БанковскийСчетКасса) Тогда
			ДокументОбъект.СчетОрганизации = Основание.БанковскийСчетКасса;
		ИначеЕсли ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			ДокументОбъект.СчетОрганизации          = ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета);
		КонецЕсли;
		
		ДокументОбъект.Ответственный     = Основание.Ответственный;
		
		Если ДокументОбъект.ВалютаДокумента.Пустая() Тогда
			ДокументОбъект.ВалютаДокумента = мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента,);
		ДокументОбъект.КурсДокумента      = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		Если ДокументОбъект.ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
			ДокументОбъект.Контрагент=Основание.КассаККМ;
		//Смартис Лиманчук начало 01.11.2012
		ИначеЕсли ДокументОбъект.ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручкаНал Тогда
			ДокументОбъект.Контрагент=Основание.КассаККМ;
		//Смартис Лиманчук окончание 01.11.2012
		Иначе
			ДокументОбъект.Контрагент=Основание.Контрагент;
		КонецЕсли;
		
		ЗаполнитьПоПланируемомуПоступлениюУпр(ДокументОбъект.РасшифровкаПлатежа,
							Основание,
							СтавкаНДС, 
							ДокументОбъект.ВалютаДокумента,
							ДокументОбъект.КурсДокумента,
							ДокументОбъект.КратностьДокумента,
							ДокументОбъект.ВидОперации);
				
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АккредитивПереданный")
		 или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее")) Тогда
		 			
			ЗаполнитьПоПлатежномуДокументу(ДокументОбъект,Основание);
			ДокументОбъект.Ответственный      = ПользовательДокумента;
			
	КонецЕсли;

	Если СпособЗаполнения = "По заказу" Тогда

		ЗаполнитьПоЗаказуУпр(Основание, ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ДокументОбъект.КратностьДокумента,СтрокаПлатеж,1);
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		ДокументОбъект.Ответственный      = ПользовательДокумента;

	ИначеЕсли СпособЗаполнения = "По взаиморасчетам" Тогда

		ЗаполнитьПоВзаиморасчетамУпр(ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ДокументОбъект.КратностьДокумента,СтрокаПлатеж,1);
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		ДокументОбъект.Ответственный      = ПользовательДокумента;

	ИначеЕсли СпособЗаполнения = "По сумме документа" Тогда

		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования=СтруктураКурсаОснования.Курс;
		КратностьОснования=СтруктураКурсаОснования.Кратность;

		ОснованиеСуммаДокумента  = Основание.СуммаДокумента;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			ОснованиеСуммаДокумента = ?(Основание.УдержатьКомиссионноеВознаграждение, ОснованиеСуммаДокумента - Основание.СуммаВознаграждения, ОснованиеСуммаДокумента);
		КонецЕсли;

		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                   КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДокументОбъект.ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                 ДокументОбъект.КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов,ДокументОбъект.КратностьДокумента);

		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		ПересчитатьСуммуНДС(СтрокаПлатеж);
		ДокументОбъект.Ответственный      = ПользовательДокумента;

	КонецЕсли;

	ДокументОбъект.СуммаДокумента=ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ДокументОбъект.ДокументОснование=Основание.Ссылка;
	ДокументОбъект.ОтраженоВОперУчете = Истина;
	
	
КонецПроцедуры // ЗаполнитьПриходПоОснованию()
 
// Возвращает структуру с курсами и кратностями для валют, переданных в качестве параметра
//
// Параметры
//  СтруктураГруппаВалют: Структура - Структура, содержащее валюты, для которых необходимо получить курсы
//	ДатаКурса: Дата - дата, на которую необходимо получить курсы.
//
// Возвращаемое значение:
//   СтруктураКурсыВалют: структура - структура, содержащая курсы для указанных валют.
//
Функция ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,ДатаКурса) Экспорт
	
	Запрос=Новый Запрос;
	СписокВалют=Новый СписокЗначений;
	
	Для каждого Валюта Из СтруктураГруппаВалют Цикл
	
		СписокВалют.Добавить(Валюта.Значение);
	
	КонецЦикла; 
	
	Запрос.Текст="ВЫБРАТЬ
	             |	КурсыВалютСрезПоследних.Курс КАК Курс,
	             |	КурсыВалютСрезПоследних.Кратность КАК Кратность,
	             |	КурсыВалютСрезПоследних.Валюта.Код КАК КодВалюты,
	             |	КурсыВалютСрезПоследних.Валюта.Ссылка КАК Валюта
	             |ИЗ
	             |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта.Код В (&СписокВалют)) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКурса",ДатаКурса);
	Запрос.УстановитьПараметр("СписокВалют",СписокВалют);
	
	СтруктураКурсыВалют=Новый Структура;

	Результат=Запрос.Выполнить().Выгрузить();
		
	Для каждого Валюта Из СтруктураГруппаВалют Цикл
		
		СтрокаВалюта=Результат.Найти(Валюта.Значение,"КодВалюты");
		
		Если НЕ СтрокаВалюта=Неопределено Тогда
		   	СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Курс",СтрокаВалюта.Курс);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Кратность",СтрокаВалюта.Кратность);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ,СтрокаВалюта.Валюта);
		Иначе
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Курс",0);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Кратность",0);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ,Новый(Тип("СправочникСсылка.Валюты")));
		КонецЕсли;
		
	КонецЦикла; 		
	
	Возврат СтруктураКурсыВалют;

КонецФункции // ПолучитьКурсыДляГруппыВалют()
	
// Определяет сделку, по которой надо сделать движение по строке ТЧ платежного документа 
//
// Параметры: 
//  ДокументОбъект          	- объект проводимого документа, 
//  СтрокаТЧ				 	- строка табличной части документа, для которой надо определить сделку.
//  ИмяРеквизитаСделка      	- необязательный параметр, имя реквизита "сделка".
//
// Возвращаемое значение:
//  Ссылка на документ или Неопределно, т.е. значение, которое надо записать в измерение Сделка регистра.
//
Функция ОпределитьСделкуСтрокиТЧ (ДокументОбъект,СтрокаТЧ, ИмяРеквизитаСделка = "Сделка", ИмяРеквизитаДоговор="ДоговорКонтрагента") Экспорт

	// Возвращаемое значение.
	Сделка = Неопределено;
	
	ВедениеВзаиморасчетов=СтрокаТЧ[ИмяРеквизитаДоговор].ВедениеВзаиморасчетов; 
	
	Если ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		ИЛИ ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда

		Сделка = СтрокаТЧ[ИмяРеквизитаСделка];

	КонецЕсли;

	Возврат Сделка;

КонецФункции // ОпределитьСделкуСтрокиТЧ()

// Процедура контролирует остаток регистра "Взаиморасчеты с контрагентами" по сделкам
// и договорам переданной табличной части платежного документа.
//
// Параметры:
//  РасшифровкаПлатежа    - табличная часть платежного документа 
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатковПоТЧ(ДатаПлатежа, ТаблицаПлатежейУпр, Отказ, Заголовок, РасчетыВозврат = Неопределено, ВходящийПлатеж = Ложь) Экспорт
	
	// Контроль суммы задолженности по договору
	
	СтруктураОтбора      = Новый Структура("КонтролироватьСуммуЗадолженности", Истина);
	ТаблицаКонтроляСуммы = ТаблицаПлатежейУпр.Скопировать(СтруктураОтбора, "ДоговорКонтрагента,ВалютаВзаиморасчетов,ДопустимаяСуммаЗадолженности,СуммаВзаиморасчетов");
	
	Если ТаблицаКонтроляСуммы.Количество() > 0 Тогда
	
		ТаблицаКонтроляСуммы.Свернуть("ДоговорКонтрагента,ВалютаВзаиморасчетов,ДопустимаяСуммаЗадолженности","СуммаВзаиморасчетов");
		
		Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
			СтруктураПараметровБлокировки = Новый Структура(
				"ИмяТаблицы, ИсточникДанных", "ВзаиморасчетыСКонтрагентами", ТаблицаКонтроляСуммы);
			СтруктураИсточникаДанных      = Новый Структура(
				"ДоговорКонтрагента", "ДоговорКонтрагента");
			ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, , СтруктураИсточникаДанных, Отказ, Заголовок);
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
		|   ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,
		|	ДоговорКонтрагента В (&МассивДоговоров)) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки";
		
		
		МассивДоговоров = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаКонтроляСуммы.ВыгрузитьКолонку("ДоговорКонтрагента"));
		Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
		Результат = Запрос.Выполнить();
		Выборка   = Результат.Выбрать();
		
		Для Каждого Платеж ИЗ ТаблицаКонтроляСуммы Цикл
				
			Если Выборка.НайтиСледующий(Платеж.ДоговорКонтрагента, "ДоговорКонтрагента") Тогда
				
				СуммаВзаиморасчетовОстаток = Выборка.СуммаВзаиморасчетовОстаток;
				
				СуммаВзаиморасчетовПоПлатежу = Платеж.СуммаВзаиморасчетов;
				
				Если (СуммаВзаиморасчетовОстаток + СуммаВзаиморасчетовПоПлатежу) > Платеж.ДопустимаяСуммаЗадолженности Тогда
					Валюта = Строка(Платеж.ВалютаВзаиморасчетов);
					ОбщегоНазначения.СообщитьОбОшибке(
					"Сумма задолженности по договору " + Платеж.ДоговорКонтрагента + 
					" с учетом документа превышает допустимую сумму задолженности." + Символы.ПС +
					Символы.Таб + "Сумма задолженности с учетом документа: " + (СуммаВзаиморасчетовОстаток + СуммаВзаиморасчетовПоПлатежу) + " " + Валюта + 
					", допустимая сумма задолженности: " + Платеж.ДопустимаяСуммаЗадолженности + " " + Валюта + 
					", превышение: " + (Формат(СуммаВзаиморасчетовОстаток + СуммаВзаиморасчетовПоПлатежу - Платеж.ДопустимаяСуммаЗадолженности, "ЧЦ=15;ЧДЦ=2")) + " " + Валюта, Отказ, Заголовок);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	// Контроль процента предоплаты по сделке
	
	Если НЕ РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда
		
		Запрос = Новый Запрос;
		МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
		Запрос.УстановитьПараметр("ТаблицаПлатежейУпр", ТаблицаПлатежейУпр);
		Запрос.Текст =
		"ВЫБРАТЬ 
		|	Таб.ДоговорКонтрагента,
		|	Таб.Сделка,
		|	Таб.ПроцентПредоплаты
		|ПОМЕСТИТЬ
		|	ТаблицаКонтроляПроцентаОплаты
		|ИЗ
		|	&ТаблицаПлатежейУпр КАК Таб
		|ГДЕ
		|	Таб.ПроцентПредоплаты > 0";
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таб.ДоговорКонтрагента,
		|	Таб.Сделка,
		|	Таб.ПроцентПредоплаты
		|ИЗ
		|	ТаблицаКонтроляПроцентаОплаты КАК Таб";
		ТаблицаКонтроляПроцентаОплаты = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаКонтроляПроцентаОплаты.Количество() > 0 Тогда
			
			Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
				СтруктураПараметровБлокировки = Новый Структура(
					"ИмяТаблицы, ИсточникДанных", "РасчетыСКонтрагентами", ТаблицаКонтроляПроцентаОплаты);
				СтруктураИсточникаДанных      = Новый Структура(
					"ДоговорКонтрагента, Сделка", "ДоговорКонтрагента", "Сделка");
				ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, , СтруктураИсточникаДанных, Отказ, Заголовок);
				
			КонецЕсли;
		
			Запрос.Текст =
			"ВЫБРАТЬ
			|    РасчетыСКонтрагентамиОбороты.ДоговорКонтрагента,
			|    РасчетыСКонтрагентамиОбороты.Сделка,
			|    РасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход   КАК СуммаЗаказа,
			|    РасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход   КАК СуммаОплаты
			|ИЗ
			|	 РегистрНакопления.РасчетыСКонтрагентами.Обороты(,,,
			|	 	(ДоговорКонтрагента, Сделка) В (ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорКонтрагента, Сделка ИЗ ТаблицаКонтроляПроцентаОплаты)) КАК РасчетыСКонтрагентамиОбороты
			|
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрНакопления.РасчетыСКонтрагентами.Обороты";
			
			Результат = Запрос.Выполнить();
			Выборка   = Результат.Выбрать();
			
			Для Каждого Платеж Из ТаблицаКонтроляПроцентаОплаты Цикл
				
				СтруктураПоиска = Новый Структура("ДоговорКонтрагента, Сделка", Платеж.ДоговорКонтрагента, Платеж.Сделка);
				Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
					
					СуммаЗаказа = Выборка.СуммаЗаказа;
					СуммаОплаты = Выборка.СуммаОплаты;
					ПроцентПредоплаты = Платеж.ПроцентПредоплаты;
					ПроцентСовершеннойПредоплаты = ?(СуммаЗаказа = 0, 100, СуммаОплаты / СуммаЗаказа * 100);
					
					Если ПроцентСовершеннойПредоплаты < ПроцентПредоплаты Тогда
						ОбщегоНазначения.СообщитьОбОшибке("Недостаточна предоплата по заказу " + Платеж.Сделка + 
							Символы.ПС + Символы.Таб + " По договору """ + Платеж.ДоговорКонтрагента + 
							""" требуется предоплата в размере " + ПроцентПредоплаты + "% ; Поступила предоплата  в размере " 
							+ Окр(ПроцентСовершеннойПредоплаты, 2, 1) + "%", Отказ, Заголовок);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Контроль числа дней задолженности по документу расчетов
	
	Если НЕ РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат И НЕ ВходящийПлатеж Тогда
		
		Запрос = Новый Запрос;
		МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
		Запрос.УстановитьПараметр("ТаблицаПлатежейУпр", ТаблицаПлатежейУпр);
		Запрос.Текст =
		"ВЫБРАТЬ 
		|	Таб.ДоговорКонтрагента
		|ПОМЕСТИТЬ
		|	ТаблицаКонтроляСрокаДолга
		|ИЗ
		|	&ТаблицаПлатежейУпр КАК Таб
		|ГДЕ
		|	Таб.ВестиПоДокументамРасчетовСКонтрагентом
		|		И Таб.КонтролироватьЧислоДнейЗадолженности";
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таб.ДоговорКонтрагента,
		|	Таб.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности
		|ИЗ
		|	ТаблицаКонтроляСрокаДолга КАК Таб";
		ТаблицаКонтроляСрокаДолга = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаКонтроляСрокаДолга.Количество() > 0 Тогда
			
			Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
				СтруктураПараметровБлокировки = Новый Структура(
					"ИмяТаблицы, ИсточникДанных", "ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов", ТаблицаКонтроляСрокаДолга);
				СтруктураЗначенийБлокировки   = Новый Структура();
				СтруктураИсточникаДанных      = Новый Структура(
					"ДоговорКонтрагента", "ДоговорКонтрагента");
				ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
				
			КонецЕсли;
		
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВзаиморасчетыПоДокументамОстатки.ДоговорКонтрагента,
			|	МИНИМУМ(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата) КАК ДатаПервойСделки
			|ИЗ	
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, 
			|		ДоговорКонтрагента В (ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорКонтрагента ИЗ ТаблицаКонтроляСрокаДолга)
			|			) КАК ВзаиморасчетыПоДокументамОстатки
			|ГДЕ 
			|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО 
			|	ВзаиморасчетыПоДокументамОстатки.ДоговорКонтрагента
			|
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки";
				
			Результат = Запрос.Выполнить();
			Выборка   = Результат.Выбрать();
			
			Для Каждого Платеж Из ТаблицаКонтроляСрокаДолга Цикл
				
				Если Выборка.НайтиСледующий(Платеж.ДоговорКонтрагента, "ДоговорКонтрагента") Тогда
					
					ДопустимоеЧислоДнейЗадолженности = Платеж.ДопустимоеЧислоДнейЗадолженности;
					РазницаДатВСекундах = ДатаПлатежа - Выборка.ДатаПервойСделки;

					РазницаДней = Цел(РазницаДатВСекундах/(24 * 60 * 60));
					
					Если РазницаДней > ДопустимоеЧислоДнейЗадолженности Тогда
						ОбщегоНазначения.СообщитьОбОшибке("Превышено допустимое число дней задолженности по договору " +
							Платеж.ДоговорКонтрагента + Символы.ПС + Символы.Таб +
							" Допустимое число дней задолженности: " + ДопустимоеЧислоДнейЗадолженности + 
							", дата самой старой задолженности: " + Выборка.ДатаПервойСделки + 
							", превышение: " + РазницаДней + " дней", Отказ, Заголовок);
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // КонтрольОстатковПоТЧ()

Функция НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(ВидОперации = неопределено) Экспорт

	Если ЗначениеЗаполнено(ВидОперации) тогда

		ВозвратПоВидуОпераций = Новый Массив;

		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю);
		//Смартис Лиманчук начало 02.10.2012
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал);
		//Смартис Лиманчук окончание 02.10.2012
		
        ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком);
		//Смартис Лиманчук начало 05.11.2012
        ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал);
		//Смартис Лиманчук окончание 05.11.2012
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю);
			
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.ВозвратДенежныхСредствПокупателю);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком);
		
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю);

		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником);
		//Смартис Лиманчук начало 01.11.2012
		ВозвратПоВидуОпераций.Добавить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетникомНал);
		//Смартис Лиманчук окончание 01.11.2012
		
		Если ВозвратПоВидуОпераций.Найти(ВидОперации) = Неопределено Тогда
			Возврат Перечисления.РасчетыВозврат.Расчеты;
		Иначе
			Возврат Перечисления.РасчетыВозврат.Возврат;
		КонецЕсли;
		
	Иначе
		
		Возврат Перечисления.РасчетыВозврат.Расчеты;
		
	Конецесли;
		
КонецФункции

// Возвращает признак расчетов с контрагентами
//
Функция ЕстьРасчетыСКонтрагентами(ВидОперации=Неопределено) Экспорт
	
	Если ВидОперации=Неопределено Тогда 
		Возврат Ложь;
	Иначе
		Возврат ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику
		//Смартис Лиманчук начало 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщикуНал
		//Смартис Лиманчук окончание 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю
		//Смартис Лиманчук начало 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал
		//Смартис Лиманчук окончание 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами
		//Смартис Лиманчук начало 06.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентамиНал
		//Смартис Лиманчук окончание 06.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя
		//Смартис Лиманчук начало 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателяНал
		//Смартис Лиманчук окончание 02.10.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком
		//Смартис Лиманчук начало 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал
		//Смартис Лиманчук окончание 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами
		//Смартис Лиманчук начало 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентамиНал
		//Смартис Лиманчук окончание 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерСписание.ОплатаПоставщику
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерСписание.ВозвратДенежныхСредствПокупателю
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ОплатаПокупателя
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПрочиеРасчетыСКонтрагентами
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами
		
	КонецЕсли;
	
КонецФункции // ЕстьРасчетыСКонтрагентами()

// Возвращает признак расчетов с контрагентами
//
Функция ЕстьРасчетыПоКредитам(ВидОперации=Неопределено) Экспорт
	
	Если ВидОперации=Неопределено Тогда 
		Возврат Ложь;
	Иначе
		Возврат ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами
		//Смартис Лиманчук начало 06.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал
		//Смартис Лиманчук окончание 06.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами
		//Смартис Лиманчук начало 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал
		//Смартис Лиманчук окончание 05.11.2012
		ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоБанковскимКредитам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами		
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.РасчетыПоКредитамИЗаймам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоБанковскимКредитам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоПлатежнымКартам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.РасчетыПоКредитамИЗаймам
 		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерСписание.РасчетыПоКредитамИЗаймам
	
	КонецЕсли;
	
КонецФункции // ЕстьРасчетыПоКредитам()

// Определяет вид операции расчетного документа по виду операции заявки на расходование средств
// или планируемого поступления денежных средств
//
Процедура ОпределитьОперациюПоОснованиюУпр(ВидОперации,ВидОперацииОснование) Экспорт
	
	Если ВидОперацииОснование.Метаданные().Имя="ВидыОперацийЗаявкиНаРасходование" Тогда
		
		Если  ВидОперации.Метаданные().Имя="ВидыОперацийСписаниеБезналичныхДенежныхСредств" Тогда
			
			Если ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю Тогда
				ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику Тогда
				ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеНалога Тогда
			   ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
			   ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами;
			Иначе
				ВидОперации=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств;
			КонецЕсли;
			
		ИначеЕсли ВидОперации.Метаданные().Имя="ВидыОперацийППИсходящее" Тогда
			
			Если ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеНалога Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеЗП Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСРаботниками Тогда
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСРаботниками;
			ИначеЕсли ВидОперацииОснование = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
				ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику;
			Иначе
				ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств;
			КонецЕсли;
			
		ИначеЕсли ВидОперации.Метаданные().Имя="ВидыОперацийРКО" Тогда
			
			Если ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствКассеККМ Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
				//22082019 Верескул по требованию ФР
				ВидОперации=Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетникуНал;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеЗП Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСРаботниками Тогда
				ВидОперации=Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСРаботниками;
			Иначе
				ВидОперации=Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее;
			КонецЕсли;
			
		КонецЕсли;
			
	ИначеЕсли ВидОперацииОснование.Метаданные().Имя="ВидыОперацийПланируемоеПоступлениеДС" Тогда
		
		Если  ВидОперации.Метаданные().Имя="ВидыОперацийПоступлениеБезналичныхДенежныхСредств" Тогда
			
			Если ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком Тогда
				ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя Тогда
				ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам Тогда
				ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами;
			Иначе
				ВидОперации=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств
			КонецЕсли;
			
 		ИначеЕсли  ВидОперации.Метаданные().Имя="ВидыОперацийППВходящее" Тогда
			
 			Если ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком Тогда
 				ВидОперации=Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком;
 			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя Тогда
 				ВидОперации=Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя;
 			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам Тогда
 				ВидОперации=Перечисления.ВидыОперацийППВходящее.РасчетыПоКредитамИЗаймам;
 			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами Тогда
 				ВидОперации=Перечисления.ВидыОперацийППВходящее.ПрочиеРасчетыСКонтрагентами;
 			Иначе
 				ВидОперации=Перечисления.ВидыОперацийППВходящее.ПрочееПоступлениеБезналичныхДенежныхСредств
 			КонецЕсли;
		
		ИначеЕсли  ВидОперации.Метаданные().Имя="ВидыОперацийПКО" Тогда
			
			Если ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком Тогда
				ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя Тогда
				ВидОперации=Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами Тогда
				ВидОперации=Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам Тогда
				ВидОперации=Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами;
			ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПриходДенежныхСредствРозничнаяВыручка Тогда
				ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка;
			Иначе
				ВидОперации=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;			

КонецПроцедуры // ОпределитьОперациюПоОснованиюУпр()

Функция ОпределитьВидОперацииПлан(ВидОперацииДокумент) Экспорт;
	
	Если ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику ИЛИ
		//Смартис Лиманчук начало 03.10.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ОплатаПоставщикуНал ИЛИ
		//Смартис Лиманчук окончание 03.10.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ОплатаПоставщику Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю ИЛИ
		//Смартис Лиманчук начало 04.10.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал ИЛИ
		//Смартис Лиманчук окончание 04.10.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствКассеККМ;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику
		//Смартис Лиманчук начало 01.11.2012
		ИЛИ ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетникуНал
		//Смартис Лиманчук окончание 01.11.2012
		ИЛИ ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику 
		ИЛИ ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику;
				
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеНалога Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеНалога;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПеречислениеЗП;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСРаботниками ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСРаботниками Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСРаботниками;
				
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее ИЛИ 
		ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств Тогда	 
		
		ВидОперацииПлан=Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочийРасходДенежныхСредств;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами ИЛИ
		//Смартис Лиманчук начало 05.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентамиНал ИЛИ
		//Смартис Лиманчук окончание 05.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда	
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПриходДенежныхСредствРозничнаяВыручка;
	//Смартис Лиманчук начало 01.11.2012
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручкаНал Тогда	
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПриходДенежныхСредствРозничнаяВыручка;
	//Смартис Лиманчук окончание 01.11.2012
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам ИЛИ
	    //Смартис Лиманчук начало 05.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал Или
		//Смартис Лиманчук окончание 05.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам;
		
	ИначеЕсли ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств ИЛИ
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником ИЛИ
		//Смартис Лиманчук начало 01.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетникомНал ИЛИ
		//Смартис Лиманчук окончание 01.11.2012
		ВидОперацииДокумент=Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
		
		ВидОперацииПлан=Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочееПоступлениеДенежныхСредств;
		
	Иначе
		
		ВидОперацииПлан=Неопределено;
		
	КонецЕсли;
	
	Возврат ВидОперацииПлан;
	
КонецФункции // ОпределитьВидОперацииПлан()

Процедура УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж,ВидОперацииДокумент) Экспорт;
	
	//Смартис Лиманчук начало 31.07.2012
	//// Здесь нужно установить получение настройки пользователя.
	//Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств) Тогда
	//
	//	СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
	//
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ СтатьяДДС ИЗ РегистрСведений.СтатьиДДСпоУмолчанию
		|ГДЕ ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииДокумент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДДС;	
	КонецЕсли;
	//Смартис Лиманчук окончание 31.07.2012
	
КонецПроцедуры // УстановитьСтатьюДДСПоУмолчанию()

// Определяет вид операции документа поступления по документу расхода - основанию
//
Процедура ОпределитьВидОперацииПоПлатежномуДокументу(ВидОперацииОснование,ВидОперацииДокумент)
	
	Если  ВидОперацииДокумент.Метаданные().Имя="ВидыОперацийПоступлениеБезналичныхДенежныхСредств" Тогда
		
		Если ВидОперацииОснование=Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю ИЛИ 
			ВидОперацииОснование=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю Тогда
			
			ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком;
			
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику ИЛИ 
			ВидОперацииОснование=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику Тогда
			
			ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
			
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами ИЛИ 
			ВидОперацииОснование=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
			
			ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам;
			
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами ИЛИ 
			ВидОперацииОснование=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			
			ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами;
			
		Иначе
			
			ВидОперацииДокумент=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочееПоступлениеБезналичныхДенежныхСредств;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперацииДокумент.Метаданные().Имя="ВидыОперацийСписаниеБезналичныхДенежныхСредств" Тогда
		
		Если ВидОперацииОснование=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком Тогда
			ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю;
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя Тогда
			ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику;
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами;
		ИначеЕсли ВидОперацииОснование=Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда
			ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам;
		Иначе
			ВидОперацииДокумент=Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочееСписаниеБезналичныхДенежныхСредств;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьВидОперацииПоПлатежномуДокументу()

// Возаращает вид договора с контрагентом по виду операции
//
Функция ОпределитьВидДоговораСКонтрагентом(ВидОперации=Неопределено) Экспорт
	
	СПоставщиком  	= Новый СписокЗначений;
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СПоставщиком.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	
	СПокупателем  	= Новый СписокЗначений;
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	СПокупателем.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	
	Прочее  		= Новый СписокЗначений;
	Прочее.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Если ЗначениеЗаполнено(ВидОперации) тогда

		//Определение вида операции

		ВидДоговораПоВидуОпераций = Новый Соответствие();

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику,СПоставщиком);
		//Смартис Лиманчук начало 02.10.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщикуНал,СПоставщиком);
		//Смартис Лиманчук окончание 02.10.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		//Смартис Лиманчук начало 06.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал,Прочее);
		//Смартис Лиманчук окончание 06.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами,Прочее);
		//Смартис Лиманчук начало 06.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентамиНал,Прочее);
		//Смартис Лиманчук окончание 06.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю,СПокупателем);
		//Смартис Лиманчук начало 02.10.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал,СПокупателем);
		//Смартис Лиманчук окончание 02.10.2012

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя,СПокупателем);
		//Смартис Лиманчук начало 02.10.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателяНал,СПокупателем);
		//Смартис Лиманчук окончание 02.10.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		//Смартис Лиманчук начало 05.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал,Прочее);
		//Смартис Лиманчук окончание 05.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами,Прочее);
		//Смартис Лиманчук начало 05.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентамиНал,Прочее);
		//Смартис Лиманчук окончание 05.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		//Смартис Лиманчук начало 05.11.2012
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал,СПоставщиком);
		//Смартис Лиманчук окончание 05.11.2012

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю,СПокупателем);

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоБанковскимКредитам,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам,Прочее);
		
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.ОплатаПоставщику,СПоставщиком);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.РасчетыПоКредитамИЗаймам,Прочее);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.ВозвратДенежныхСредствПокупателю,СПокупателем);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ОплатаПокупателя,СПокупателем);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.РасчетыПоКредитамИЗаймам,Прочее);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком,СПоставщиком);

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю,СПокупателем);

 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя,СПокупателем);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.РасчетыПоКредитамИЗаймам,Прочее);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
 		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоБанковскимКредитам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоПлатежнымКартам,Прочее);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику,СПоставщиком);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю,СПокупателем);

		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.РасчетыПоКредитамИЗаймам,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ПрочиеРасчетыСКонтрагентами,Прочее);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком,СПоставщиком);
		
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя,СПокупателем);
		ВидДоговораПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю,СПокупателем);
		
		ВидДоговора=ВидДоговораПоВидуОпераций[ВидОперации];
		
		Если НЕ ВидДоговора = Неопределено Тогда
			
			Возврат ВидДоговора;
			
		Иначе
			
			Возврат Новый СписокЗначений;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Новый СписокЗначений;
		
	Конецесли;
	
КонецФункции // ОпределитьВидДоговораСКонтрагентом()

// Возвращает параметры для выбора сделки по виду операции.
//
Функция ОпределитьПараметрыВыбораСделки(ВидОперации=Неопределено) Экспорт
	
	ЗаказПокупателяПриход =  Новый Структура("ВидДвиженияРасчеты,ТипЗаказа","Расход","ЗаказПокупателя"); // Расход по регистру взаиморасчетов
    ЗаказПокупателяРасход =  Новый Структура("ВидДвиженияРасчеты,ТипЗаказа","Приход","ЗаказПокупателя"); // Приход по регистру взаиморасчетов
    ЗаказПоставщикуПриход =  Новый Структура("ВидДвиженияРасчеты,ТипЗаказа","Расход","ЗаказПоставщику"); // Расход по регистру взаиморасчетов
	ЗаказПоставщикуРасход =  Новый Структура("ВидДвиженияРасчеты,ТипЗаказа","Приход","ЗаказПоставщику"); // Приход по регистру взаиморасчетов
		
	Если ЗначениеЗаполнено(ВидОперации) тогда

		//Определение вида операции

		ПараметрыСделкиПоВидуОпераций = Новый Соответствие();

		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщику,ЗаказПоставщикуРасход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
		//Смартис Лиманчук начало 02.10.2012
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ОплатаПоставщикуНал,ЗаказПоставщикуРасход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал,ЗаказПокупателяРасход);
		//Смартис Лиманчук окончание 02.10.2012
		
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателя,ЗаказПокупателяПриход);
		//Смартис Лиманчук начало 02.10.2012
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ОплатаПокупателяНал,ЗаказПокупателяПриход);
		//Смартис Лиманчук окончание 02.10.2012
        ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком,ЗаказПоставщикуПриход);
		//Смартис Лиманчук начало 05.11.2012
        ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал,ЗаказПоставщикуПриход);
		//Смартис Лиманчук окончание 05.11.2012
		
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ОплатаПоставщику,ЗаказПоставщикуРасход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
		
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя,ЗаказПокупателяПриход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком,ЗаказПоставщикуПриход);
		
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.ОплатаПоставщику,ЗаказПоставщикуРасход);
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерСписание.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ОплатаПокупателя,ЗаказПокупателяПриход);
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком,ЗаказПоставщикуПриход);
			
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику,ЗаказПоставщикуРасход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
		
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ОплатаПокупателя,ЗаказПокупателяПриход);
 		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком,ЗаказПоставщикуПриход);
		
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику,ЗаказПоставщикуРасход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
				
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ОплатаПокупателя,ЗаказПокупателяПриход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийПланируемоеПоступлениеДС.ВозвратДенежныхСредствПоставщиком,ЗаказПоставщикуПриход);
		
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя,ЗаказПокупателяПриход);
		ПараметрыСделкиПоВидуОпераций.Вставить(Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю,ЗаказПокупателяРасход);
		
		Если Не ПараметрыСделкиПоВидуОпераций[ВидОперации]=Неопределено Тогда
			Возврат ПараметрыСделкиПоВидуОпераций[ВидОперации];
		Иначе
			Возврат Новый Структура("ВидДвиженияРасчеты,ТипЗаказа","Прочие","Прочие");
		КонецЕсли;
		
	Иначе
		
		Возврат ЗаказПокупателяПриход;
		
	Конецесли;
	
КонецФункции // ОпределитьПараметрыВыбораСделки()

// Для переданной организации получаем флаги отражения по умолчанию документов в бух. и налог. учете
// (для пустой организации все признаки имеют значение "Ложь")
//
// Параметры
//  Организация		– <СправочникСсылка.Организации> – организация, для которой нужно получить признаки отражения в БУ и НУ 
//  ФлагБУ			– <Булево> – возвращается флаг отражения в БУ по умолчанию
//  ФлагРеглУчет	– <Булево> – возвращается признак отражения организации в регл.учете (необязательный параметр)
//
Процедура ПолучитьПризнакиОтраженияВРеглУчете(Организация, ФлагБУ, ФлагРеглУчет = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ФлагРеглУчет    = Организация.ОтражатьВРегламентированномУчете;
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
		ФлагБУ = ФлагРеглУчет И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
		
	Иначе
		
		ФлагРеглУчет    = Ложь;
		ФлагБУ = Ложь;
		
	КонецЕсли;

КонецПроцедуры // ПолучитьПризнакиОтраженияВРеглУчете()

// Определяет счет учета денежных средств в бух.учете для банковского счета
//
// Параметры
//  <БанковскийСчет>	– <СправочникСсылка.БанковскиеСчета> – банковский счет, для которого нужно определить 
// 							соответствующий ему счет бух.учета. Для пустой ссылки возвращается счет 51.
//  <ВалютаРеглУчета> 	– <СправочникСсылка.Валюты> – валюта регламентированного учета
//  <РасчетыВВалюте>	– <Булево> – дополнительно возвращается признак учета денежных средств в валюте (необязательный параметр)
//
// Возвращаемое значение:
//   <ПланСчетовСсылка.Хозрасчетный>	– счет учета денежных средств, соответствующий банковскому счету
//
Функция ОпределитьСчетУчетаДенежныхСредств(БанковскийСчет, ВалютаРеглУчета, РасчетыВВалюте = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		РасчетыВВалюте = Ложь;
		Возврат ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
	КонецЕсли;
	
	ВидБанковскогоСчета    = БанковскийСчет.ВидСчета;
	ВалютаБанковскогоСчета = БанковскийСчет.ВалютаДенежныхСредств;
	
	РасчетыВВалюте = ЗначениеЗаполнено(ВалютаБанковскогоСчета) И ВалютаБанковскогоСчета <> ВалютаРеглУчета;
	
	Если ВидБанковскогоСчета = "Расчетный" Или ВидБанковскогоСчета = "Текущий" Тогда
		Если РасчетыВВалюте Тогда
			СчетБУ = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВИностраннойВалюте;
		Иначе
			СчетБУ = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
		КонецЕсли;
	Иначе
		Если РасчетыВВалюте Тогда
			СчетБУ = ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте;
		Иначе
			СчетБУ = ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СчетБУ;
	
КонецФункции // ОпределитьСчетУчетаДенежныхСредств()

// Устанавливает банковский счет по умолчанию. Возвращает состояние установлен/не установлен
//
// Параметры
//  Счет				-	Текущее значение счета
//  ВладелецСчета  		–	<СправочникСсылка.Контрагенты (.Организации)> 
//							Контрагент (организация), счет которого нужно получить
//  Валюта  			–	<СправочникСсылка.Валюты>
//							Валюта регламентированного учета
//  СовпадениеВалюты	–	<Булево>
//                          признак совпадения нужной вылюты с указанной, либо исключения ее из поиска
//							По умолчанию ищем счет с указанной валютой.
//
// Возвращаемое значение:
//   <СправочникСсылка.БанковскиеСчета> – найденный счет или пустая ссылка
//
Функция УстановитьБанковскийСчет(Счет,ВладелецСчета, Валюта, СовпадениеВалюты = Истина) Экспорт
	
	НовыйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	БанковскиеСчета.Ссылка,
	|	ВЫБОР
	|		КОГДА СправочникВладелец.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникВладелец
	|		ПО БанковскиеСчета.Владелец = СправочникВладелец.Ссылка
	|			И БанковскиеСчета.Ссылка = СправочникВладелец.ОсновнойБанковскийСчет
	|ГДЕ
	|	БанковскиеСчета.Владелец = &ВладелецСчета
	|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
	|	И (БанковскиеСчета.ВалютаДенежныхСредств = &Валюта
	|				И &СовпадениеВалюты = ИСТИНА
	|			ИЛИ (НЕ БанковскиеСчета.ВалютаДенежныхСредств = &Валюта)
	|				И &СовпадениеВалюты = ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ВладелецСчета",   ВладелецСчета);
	Запрос.УстановитьПараметр("Валюта", 		 Валюта);
	Запрос.УстановитьПараметр("СовпадениеВалюты",СовпадениеВалюты);
	
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Организации", "Справочник.Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат    = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НайденОсновнойСчет = Выборка.Приоритет = 1;
		НайденОдинСчет     = Выборка.Количество() = 1;
		
		Если НайденОсновнойСчет ИЛИ НайденОдинСчет Тогда
			НовыйСчет = Выборка.Ссылка;
		КонецЕсли;
	
	КонецЕсли;
	
	Если Счет <> НовыйСчет 
		И ((НЕ ЗначениеЗаполнено(Счет))
			ИЛИ (ТипЗнч(Счет) = Тип("СправочникСсылка.БанковскиеСчета") 
				И Счет.Владелец <> ВладелецСчета)) Тогда
		
		Счет = НовыйСчет;
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьБанковскийСчет()

////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДИАЛОГОВ РАСЧЕТНЫХ ДОКУМЕНТОВ

// Формирует надпись при частичной оплате расчетного документа.
// Параметры: Расчетный документ - документ, для которого формируется надпись
//            ИмяРегистра: регистр, по которому проверяются остатки.
//			  Измерение: имя измерения регистра (ДокументПолучения или ДокументСписания)
// Возвращаемое значение:
// 			  ТекстНадписи
//
Функция СформироватьТекстЧастичнаяОплата(РасчетныйДокумент, ИмяРегистра, Измерение) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ОперативноеДвижение.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления."+ИмяРегистра+".Остатки(, "+Измерение+" = &РасчетныйДокумент) КАК ОперативноеДвижение
	|ГДЕ
	|	ЕСТЬNULL(ОперативноеДвижение.СуммаОстаток, 0) <> 0";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ТекстНадписи = "Оплата произведена полностью.";
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТекстНадписи = "Частичная оплата. Остаток " + Формат(Выборка.СуммаОстаток,"ЧЦ=15; ЧДЦ=2; ЧН=Ноль")+".";
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьТекстЧастичнаяОплата()

// Пересчитывает сумму НДС
//
// Параметры:
//  Нет.
//
Процедура ПересчитатьСуммуНДС(СтрокаПлатеж) Экспорт
	
	ЗначениеСтавкиНДС = Ценообразование.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
	СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	
КонецПроцедуры // ПересчитатьСуммуНДС()

// Проставляет реквизиты, необходимые для проведения по регламентированному учету
// 
Процедура ЗаполнитьРеквизитыРеглУчета(ДокументОбъект,СтрокаПлатеж,НДСПоУмолчанию,ОтражатьВБухгалтерскомУчете=Истина) Экспорт;
	
	//Пересчитываем сумму НДС
	
	Если СтрокаПлатеж.СтавкаНДС.Пустая() Тогда
		СтрокаПлатеж.СтавкаНДС=НДСПоУмолчанию;
	КонецЕсли;				
	
	ПересчитатьСуммуНДС(СтрокаПлатеж);
			
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		ОпределитьСчетаУчетаПлатежаПоУмолчанию(ДокументОбъект,СтрокаПлатеж,Истина)
		
	КонецЕсли;
					
КонецПроцедуры // ЗаполнитьРеквизитыРеглУчета()

Процедура ОпределитьСчетаУчетаПлатежаПоУмолчанию(ДокументОбъект,СтрокаПлатеж,ПерезаписыватьЗначения)
	
	ВидОперации=ДокументОбъект.ВидОперации;	
	
	ПолученныйСчетРасчетов          = Неопределено;
	ПолученныйСчетРасчетовПоАвансам = Неопределено;

	Если НЕ ЕстьРасчетыПоКредитам(ВидОперации) Тогда
		
		СчетаУчета = БухгалтерскийУчетРасчетовСКонтрагентами.ПолучитьСчетаРасчетовСКонтрагентом(ДокументОбъект.Организация, ДокументОбъект.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		
		Если СтрокаПлатеж.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			ПолученныйСчетРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
			
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АккредитивПолученный") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
			Если ВидОперации = Перечисления.ВидыОперацийППВходящее.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеТребованиеВыставленное") Или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеТребованиеПоручениеВыставленное") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
			Если ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			//Смартис Лиманчук начало 05.11.2012
			ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			//Смартис Лиманчук окончание 05.11.2012
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АккредитивПереданный") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеТребованиеПолученное") Или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеТребованиеПоручениеПолученное") Тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПокупателю тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежныйОрдерСписаниеДенежныхСредств") Тогда
			Если ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерСписание.ВозвратДенежныхСредствПокупателю Тогда
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
			//Смартис Лиманчук начало 04.10.2012
			//Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю тогда
			Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал Тогда
			//Смартис Лиманчук окончание 04.10.2012
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
			Иначе
				ПолученныйСчетРасчетов          = СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОплатаОтПокупателяПлатежнойКартой") Тогда	
			Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком тогда
				ПолученныйСчетРасчетов 				= СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам     = СчетаУчета.СчетАвансов;
			//Смартис Лиманчук начало 05.11.2012
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал тогда
				ПолученныйСчетРасчетов 				= СчетаУчета.СчетРасчетов;
				ПолученныйСчетРасчетовПоАвансам     = СчетаУчета.СчетАвансов;
			//Смартис Лиманчук окончание 05.11.2012
			Иначе
				ПолученныйСчетРасчетов 				= СчетаУчета.СчетРасчетовПокупателя;
				ПолученныйСчетРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолученныйСчетРасчетов <> Неопределено Тогда
		Если (НЕ ЗначениеЗаполнено(СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом) ИЛИ ПерезаписыватьЗначения) Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПолученныйСчетРасчетов;
		КонецЕсли;
		Если (НЕ ЗначениеЗаполнено(СтрокаПлатеж.СчетУчетаРасчетовПоАвансам) ИЛИ ПерезаписыватьЗначения) Тогда
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам = ПолученныйСчетРасчетовПоАвансам;
		КонецЕсли;
	ИначеЕсли  ПерезаписыватьЗначения Тогда
		СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли; 	
	
КонецПроцедуры // 
	 
Процедура ОбработкаПодбораЗадолженностей(ДокументОбъект,СтрокаПлатеж,ЗначениеВыбора,
										ПлатежиСписком,ВалютаДокумента,КурсДокумента,КратностьДокумента, НДСПоУмолчанию="",ОтражатьВБухгалтерскомУчете=Неопределено) Экспорт									
										
	РасшифровкаПлатежа=ДокументОбъект.РасшифровкаПлатежа;									
										
	Если НЕ ЗначениеВыбора.ЕстьПодбор Тогда									
											
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("ДоговорКонтрагента",ЗначениеВыбора.ДоговорКонтрагента);
												
		Если Не ЗначениеВыбора.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтруктураОтбора.Вставить("Сделка",ЗначениеВыбора.Сделка);
		КонецЕсли;
												
		Если ЗначениеВыбора.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			СтруктураОтбора.Вставить("ДокументРасчетовСКонтрагентом",ЗначениеВыбора.ДокументРасчетовСКонтрагентом);
		КонецЕсли;
												
		МассивСтрок=РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
												
		Если Не МассивСтрок=Неопределено Тогда
			Для Каждого Строка Из МассивСтрок Цикл
				РасшифровкаПлатежа.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
												
		Если РасшифровкаПлатежа.Количество()>0 И НЕ ЗначениеЗаполнено(РасшифровкаПлатежа[0].ДоговорКонтрагента) Тогда
			РасшифровкаПлатежа.Удалить(РасшифровкаПлатежа[0]);
		КонецЕсли;
											
	КонецЕсли;
	
	Если (НЕ (РасшифровкаПлатежа.Количество()=1 И НЕ ПлатежиСписком)) ИЛИ РасшифровкаПлатежа.Количество()=0 Тогда
		СтрокаПлатеж=РасшифровкаПлатежа.Добавить();
	КонецЕсли;
	
	СтрокаПлатеж.ДоговорКонтрагента=ЗначениеВыбора.ДоговорКонтрагента;
	СтрокаПлатеж.Сделка=ЗначениеВыбора.Сделка;
	Попытка
		СтрокаПлатеж.ДокументРасчетовСКонтрагентом=ЗначениеВыбора.ДокументРасчетовСКонтрагентом;
	Исключение
	КонецПопытки;
	
	СтрокаПлатеж.СуммаПлатежа=ЗначениеВыбора.СуммаПлатежа;
	СтрокаПлатеж.КурсВзаиморасчетов=ЗначениеВыбора.КурсВзаиморасчетов;
	СтрокаПлатеж.КратностьВзаиморасчетов=ЗначениеВыбора.КратностьВзаиморасчетов;	
	СтрокаПлатеж.СуммаВзаиморасчетов=ЗначениеВыбора.СуммаВзаиморасчетов;
	СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = ЗначениеВыбора.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
	
	Если НЕ ОтражатьВБухгалтерскомУчете=Неопределено Тогда
		
		ЗаполнитьРеквизитыРеглУчета(ДокументОбъект,СтрокаПлатеж, НДСПоУмолчанию,ОтражатьВБухгалтерскомУчете);
		
	КонецЕсли;
	
	Если ЗначениеВыбора.Свойство("ДокументПланирования") Тогда
		
		СтрокаПлатеж.ДокументПланированияПлатежа=ЗначениеВыбора.ДокументПланирования;
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств=ЗначениеВыбора.СтатьяДвиженияДенежныхСредств;
		СтрокаПлатеж.Проект=ЗначениеВыбора.Проект;
		СтрокаПлатеж.КурсВзаиморасчетовПлан=ЗначениеВыбора.КурсВзаиморасчетовПлан;
		СтрокаПлатеж.СуммаПлатежаПлан=ЗначениеВыбора.СуммаПлатежаПлан;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПодбораЗадолженностей()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ИНТЕРФЕЙСОМ

Процедура ЗаполнитьСчетаУчетаПлатежейБУ(ДокументОбъект,ТекПользователь,ПерезаписыватьЗначения,СтруктураПараметров=Неопределено) Экспорт
	
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
		МетаданныеДокумента=СтруктураПараметров.МетаданныеДокумента;
		ЕстьРасчетыСКонтрагентами=СтруктураПараметров.ЕстьРасчетыСКонтрагентами;
		ЕстьРасчетыПоКредитам=СтруктураПараметров.ЕстьРасчетыПоКредитам;
		
	Иначе
		МетаданныеДокумента=ДокументОбъект.Метаданные();
		ЕстьРасчетыСКонтрагентами=ЕстьРасчетыСКонтрагентами(ДокументОбъект.ВидОперации);
		ЕстьРасчетыПоКредитам=ЕстьРасчетыПоКредитам(ДокументОбъект.ВидОперации);
	КонецЕсли;
	
	
	Для Каждого СтрокаПлатеж Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВБухгалтерскомУчете") <> Неопределено И ДокументОбъект.ОтражатьВБухгалтерскомУчете Тогда
			
			Если ЕстьРасчетыСКонтрагентами Тогда
				
				ОпределитьСчетаУчетаПлатежаПоУмолчанию(ДокументОбъект,СтрокаПлатеж,ПерезаписыватьЗначения);
								
			КонецЕсли;
			
		Иначе
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаРасчетовСКонтрагентом", МетаданныеДокумента, "РасшифровкаПлатежа") И 
				ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаРасчетовПоАвансам", МетаданныеДокумента, "РасшифровкаПлатежа") Тогда
				//По просьбе ФО вносим правильные счета
				//СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				//СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();	
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
				СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, "РасшифровкаПлатежа") 
			И (НЕ ЗначениеЗаполнено(СтрокаПлатеж.СтавкаНДС)) Тогда
			СтрокаПлатеж.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяСтавкаНДС");
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаБУ

// Заполняет реквизиты расчетного документа значениями по умолчанию
//
Процедура ЗаполнитьРеквизитыРасчетногоДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, 
											РасшифровкаПлатежа, ТипОперации = "", ПараметрОбъектКопирования = Неопределено) Экспорт

	Перем ТипЦен;

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	// Реквизиты, которые требуется заполнить значениями по умолчанию в том числе и при копировании

	Если МетаданныеДокумента.Реквизиты.Найти("Ответственный") <> Неопределено Тогда
		ДокументОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;

	Если НЕ ПараметрОбъектКопирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество()=0 Тогда
		СтрокаПлатеж=РасшифровкаПлатежа.Добавить()
	Иначе	
		СтрокаПлатеж=РасшифровкаПлатежа[0];
	КонецЕсли;
	
	ОтражатьВУправленческомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВУправленческомУчете");
	
	// Заполним флаги принадлежности к учету исходя из значений по умолчанию.
	Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВУправленческомУчете") <> Неопределено Тогда
		
		ДокументОбъект.ОтражатьВУправленческомУчете = ОтражатьВУправленческомУчете; 
		
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ОтраженоВОперУчете") <> Неопределено Тогда
		ДокументОбъект.ОтраженоВОперУчете = ОтражатьВУправленческомУчете;
	КонецЕсли;
	
	Если МетаданныеДокумента.Имя="ПриходныйКассовыйОрдер" ИЛИ МетаданныеДокумента.Имя="РасходныйКассовыйОрдер" Тогда
		ДокументОбъект.Оплачено = ОтражатьВУправленческомУчете;
	КонецЕсли;
	
	ЕстьВыплатаЗП=Ложь; // если документ на выплату ЗП из кассы, то обработку флагов учета в БУ и НУ не производим (устанавливаются при вводе на основании)
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВидОперации") <> Неопределено Тогда
		Если (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)) Тогда
			Если МетаданныеДокумента.Имя = "РасходныйКассовыйОрдер" И НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Группа1")) Тогда
				ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал;
			Иначе
				ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
			КонецЕсли;
		ИначеЕсли ДокументОбъект.ВидОперации=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
			ЕстьВыплатаЗП=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("АвтоРезервирование") <> Неопределено Тогда
		ДокументОбъект.АвтоРезервирование = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "АвтоРезервирование");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("АвтоРазмещение") <> Неопределено Тогда
		ДокументОбъект.АвтоРазмещение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "АвтоРазмещение");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВБухгалтерскомУчете") <> Неопределено И (Не ЕстьВыплатаЗП) Тогда

		ФлагОтражатьВБухгалтерскомУчете = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
		ДокументОбъект.ОтражатьВБухгалтерскомУчете  = ФлагОтражатьВБухгалтерскомУчете;

	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
	  	Если (НЕ ЗначениеЗаполнено(ДокументОбъект.Организация)) Тогда
		    СписокПолей = новый СписокЗначений;
			СписокПолей.Добавить("ОсновнойБанковскийСчет");
			СписокПолей.Добавить("ОсновнойБанковскийСчет.ВалютаДенежныхСредств", "ОсновнойБанковскийСчетВалютаДенежныхСредств");


		  	ДанныеОрганизация =  УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация", СписокПолей);

			ДокументОбъект.Организация = ДанныеОрганизация.Значение;
		Иначе
			ДанныеОрганизация = новый Структура("Значение, ОсновнойБанковскийСчет, ОсновнойБанковскийСчетВалютаДенежныхСредств", ДокументОбъект.Организация,
				ДокументОбъект.Организация.ОсновнойБанковскийСчет, ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств);
		КонецЕсли;
	
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("Подразделение") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение)) Тогда
		ДокументОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделение");
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВидВыдачиДенежныхСредств") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидВыдачиДенежныхСредств)) Тогда
		ДокументОбъект.ВидВыдачиДенежныхСредств = Перечисления.ВидВыдачиДенежныхСредств.КассеККМ;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ФормаОплаты") <> Неопределено 
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.ФормаОплаты) ИЛИ ДокументОбъект.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные) Тогда
		
		Если МетаданныеДокумента.Реквизиты.Найти("БанковскийСчетКасса") <> Неопределено
			И (НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетКасса)) Тогда
			СписокПолей = новый СписокЗначений;
			СписокПолей.Добавить("ВалютаДенежныхСредств");
			ДанныеКасса =  УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяКасса", СписокПолей);

			БанковскийСчетКасса = ДанныеКасса.Значение;
			
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) ИЛИ ДанныеКасса.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда		
				
				ДокументОбъект.БанковскийСчетКасса = ДанныеКасса.Значение;
				ДокументОбъект.ВалютаДокумента = ДанныеКасса.ВалютаДенежныхСредств;
				
			Иначе
				
				ДокументОбъект.БанковскийСчетКасса=Справочники.Кассы.ПустаяСсылка();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ФормаОплаты) Тогда
			ДокументОбъект.ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
		КонецЕсли;
		
	КонецЕсли;
	
		
	Если МетаданныеДокумента.Реквизиты.Найти("Касса") <> Неопределено
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.Касса))Тогда
		СписокПолей = новый СписокЗначений;
		СписокПолей.Добавить("ВалютаДенежныхСредств");
        ДанныеКасса =  УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяКасса", СписокПолей);

		КассаПоУмолчанию=ДанныеКасса.Значение;
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда	
			
			ДокументОбъект.Касса = КассаПоУмолчанию;
			ДокументОбъект.ВалютаДокумента = ДанныеКасса.ВалютаДенежныхСредств;
			
		ИначеЕсли КассаПоУмолчанию.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			
			ДокументОбъект.Касса = КассаПоУмолчанию;
			
		КонецЕсли;
		
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("КассаККМ") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КассаККМ)) Тогда
		ДокументОбъект.КассаККМ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКассаККМ");
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("СчетОрганизации") <> Неопределено
		И НЕ ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации)
		И (ЗначениеЗаполнено(ДокументОбъект.Организация)) Тогда
		
		СчетПоУмолчанию=ДанныеОрганизация.ОсновнойБанковскийСчет;
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда	
			
			ДокументОбъект.СчетОрганизации =  СчетПоУмолчанию;
			ДокументОбъект.ВалютаДокумента =  ДанныеОрганизация.ОсновнойБанковскийСчетВалютаДенежныхСредств;
			
			
		ИначеЕсли  СчетПоУмолчанию.ВалютаДенежныхСредств=ДокументОбъект.ВалютаДокумента Тогда
			
			ДокументОбъект.СчетОрганизации =  СчетПоУмолчанию;
			
		КонецЕсли;
		
	КонецЕсли;

	ПараметрДвижения=ОпределитьПараметрыВыбораСделки(ДокументОбъект.ВидОперации);
	ЕстьРасчетыСКонтрагентами=ЕстьРасчетыСКонтрагентами(ДокументОбъект.ВидОперации);
	ЕстьРасчетыПоКредитам=ЕстьРасчетыПоКредитам(ДокументОбъект.ВидОперации);
	
	ДокументОбъект.ЕстьРасчетыСКонтрагентами=ЕстьРасчетыСКонтрагентами;
	ДокументОбъект.ЕстьРасчетыПоКредитам=ЕстьРасчетыПоКредитам;
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		флВыполнитьЗаполнениеСтруктуры = ложь;

		СписокПолей = новый СписокЗначений;
		СписокПолей.Добавить("ОсновнойДоговорКонтрагента");
		СписокПолей.Добавить("ОсновнойБанковскийСчет");
		СписокПолей.Добавить("ОсновнойБанковскийСчет.ВалютаДенежныхСредств", "ОсновнойБанковскийСчетВалютаДенежныхСредств");
		СписокПолей.Добавить("ОсновнойДоговорКонтрагента.Организация", "ОсновнойДоговорКонтрагентаОрганизация");
		СписокПолей.Добавить("ОсновнойДоговорКонтрагента.ВидДоговора", "ОсновнойДоговорКонтрагентаВидДоговора");
		СписокПолей.Добавить("ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов", "ОсновнойДоговорКонтрагентаВалютаВзаиморасчетов");
		СписокПолей.Добавить("ОсновнойДоговорКонтрагента.ТипЦен", "ОсновнойДоговорКонтрагентаТипЦен");
		СписокПолей.Добавить("ОсновноеКонтактноеЛицо");

		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если ПараметрДвижения.ВидДвиженияРасчеты="Приход" Тогда  // Приход по регистру "ВзаиморасчетыСКонтрагентами"
				ДанныеКонтрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнойПоставщик", СписокПолей);
				ДокументОбъект.Контрагент = ДанныеКонтрагент.Значение;

			ИначеЕсли ПараметрДвижения.ВидДвиженияРасчеты="Расход" Тогда
				ДанныеКонтрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнойПокупатель", СписокПолей);
				ДокументОбъект.Контрагент = ДанныеКонтрагент.Значение;
			Иначе
				флВыполнитьЗаполнениеСтруктуры = истина;
				текКонтрагент =  Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
		Иначе
			флВыполнитьЗаполнениеСтруктуры = истина;
			текКонтрагент =  ДокументОбъект.Контрагент;
		КонецЕсли;
		Если флВыполнитьЗаполнениеСтруктуры Тогда
			ДанныеКонтрагент = новый Структура();
			ДанныеКонтрагент.Вставить("Значение", текКонтрагент);
			ДанныеКонтрагент.Вставить("ОсновнойДоговорКонтрагента", текКонтрагент.ОсновнойДоговорКонтрагента);
			ДанныеКонтрагент.Вставить("ОсновнойБанковскийСчет", текКонтрагент.ОсновнойБанковскийСчет);
			ДанныеКонтрагент.Вставить("ОсновнойБанковскийСчетВалютаДенежныхСредств", текКонтрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств);
			ДанныеКонтрагент.Вставить("ОсновнойДоговорКонтрагентаОрганизация", текКонтрагент.ОсновнойДоговорКонтрагента.Организация);
			ДанныеКонтрагент.Вставить("ОсновнойДоговорКонтрагентаВидДоговора",текКонтрагент.ОсновнойДоговорКонтрагента.ВидДоговора);
			ДанныеКонтрагент.Вставить("ОсновнойДоговорКонтрагентаВалютаВзаиморасчетов", текКонтрагент.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов);
			ДанныеКонтрагент.Вставить("ОсновнойДоговорКонтрагентаТипЦен",текКонтрагент.ОсновнойДоговорКонтрагента.ТипЦен); 
			ДанныеКонтрагент.Вставить("ОсновноеКонтактноеЛицо",текКонтрагент.ОсновноеКонтактноеЛицо);
		КонецЕсли;
		
		
		Если МетаданныеДокумента.Реквизиты.Найти("СчетКонтрагента") <> Неопределено
			И НЕ ЗначениеЗаполнено(ДокументОбъект.СчетКонтрагента)
			И ЗначениеЗаполнено(ДанныеКонтрагент.ОсновнойБанковскийСчет) 
			И ДанныеКонтрагент.ОсновнойБанковскийСчетВалютаДенежныхСредств=ДанныеОрганизация.ОсновнойБанковскийСчетВалютаДенежныхСредств Тогда
			ДокументОбъект.СчетКонтрагента          = ДанныеКонтрагент.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Для Каждого СтрокаПлатеж Из РасшифровкаПлатежа Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента)  Тогда 
					
					Если НЕ ОпределитьВидДоговораСКонтрагентом(ДокументОбъект.ВидОперации).НайтиПоЗначению(ДанныеКонтрагент.ОсновнойДоговорКонтрагентаВидДоговора)=Неопределено Тогда
						//требуется оптимизация: нет смысла для каждой строки документа определять пустая ли организация в документе
						Если ДокументОбъект.Организация.Пустая() Тогда
							СтрокаПлатеж.ДоговорКонтрагента = ДанныеКонтрагент.ОсновнойДоговорКонтрагента;
							Организация=ДанныеКонтрагент.ОсновнойДоговорКонтрагентаОрганизация;
						//если организация заполнена, проверяем соответствует ли она основному договору	
						ИначеЕсли ДанныеКонтрагент.ОсновнойДоговорКонтрагентаОрганизация.Пустая()
							ИЛИ ДанныеКонтрагент.ОсновнойДоговорКонтрагентаОрганизация=ДокументОбъект.Организация Тогда
							СтрокаПлатеж.ДоговорКонтрагента = ДанныеКонтрагент.ОсновнойДоговорКонтрагента;
						КонецЕсли;
						
					КонецЕсли;
					
					Если (ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента)) И СтрокаПлатеж.КурсВзаиморасчетов=0 Тогда
						
						СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ДанныеКонтрагент.ОсновнойДоговорКонтрагентаВалютаВзаиморасчетов, ТекущаяДата());
						СтрокаПлатеж.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;
						СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено
			И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) Тогда
			ДокументОбъект.ВалютаДокумента = ДанныеКонтрагент.ОсновнойДоговорКонтрагентаВалютаВзаиморасчетов;
		КонецЕсли;
		
	КонецЕсли; // Контрагент
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента) Тогда
	    СтруктураКурсаДокумента      = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;
		ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;	
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ДатаОплаты") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаОплаты)) Тогда
		ДокументОбъект.ДатаОплаты = ДокументОбъект.Дата;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ЧастичнаяОплата") <> Неопределено Тогда
		ДокументОбъект.ЧастичнаяОплата = Ложь;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ДатаРасхода") <> Неопределено И (НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаРасхода)) Тогда
		ДокументОбъект.ДатаРасхода = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ДатаПоступления") <> Неопределено И (НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаПоступления)) Тогда
		ДокументОбъект.ДатаПоступления =ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("Состояние") <> Неопределено И (НЕ ЗначениеЗаполнено(ДокументОбъект.Состояние))Тогда
		ДокументОбъект.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
	КонецЕсли;
	
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеДокумента",МетаданныеДокумента);
	СтруктураПараметров.Вставить("ЕстьРасчетыСКонтрагентами",ЕстьРасчетыСКонтрагентами);
	СтруктураПараметров.Вставить("ЕстьРасчетыПоКредитам",ЕстьРасчетыПоКредитам);
	
	ЗаполнитьСчетаУчетаПлатежейБУ(ДокументОбъект,ТекПользователь,ЛОЖЬ,СтруктураПараметров);
	
КонецПроцедуры // ЗаполнитьРеквизитыРасчетногоДокумента()

#Если Клиент Тогда

Процедура ЗаполнитьРасшифровкуПлатежей(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Контрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан контрагент.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект=Обработки.ПодборПараметровРасшифровкиПлатежа.Создать();
	ОбработкаОбъект.КурсДокумента				=СтруктураПараметров.КурсДокумента;
	ОбработкаОбъект.КратностьДокумента			=СтруктураПараметров.КратностьДокумента;
	ОбработкаОбъект.ТипЗадолженности			=СтруктураПараметров.ТипЗадолженности;
	ОбработкаОбъект.Контрагент					=СтруктураПараметров.Контрагент;
	ОбработкаОбъект.ФормаОплаты					=СтруктураПараметров.ФормаОплаты;
	ОбработкаОбъект.ИмяРегистраПлан				=СтруктураПараметров.ИмяРегистраПлан;
	ОбработкаОбъект.ВидОперацииПлан				=СтруктураПараметров.ВидОперацииПлан;
	ОбработкаОбъект.БанковскийСчетКасса			=СтруктураПараметров.БанковскийСчетКасса;
	ОбработкаОбъект.Организация					=СтруктураПараметров.Организация;
	ОбработкаОбъект.ВалютаДокумента				=СтруктураПараметров.ВалютаДокумента;
	ОбработкаОбъект.ДатаДок						=СтруктураПараметров.ДатаДок;
	ОбработкаОбъект.ВидОперацииДок				=СтруктураПараметров.ВидОперацииДок;
	ОбработкаОбъект.РасшифровкаПлатежаДок		=СтруктураПараметров.РасшифровкаПлатежа;
	ОбработкаОбъект.СуммаДляПодбора				=СтруктураПараметров.СуммаДокумента;
	ОбработкаОбъект.ПлатежПоСуммеВзаиморасчетов	=СтруктураПараметров.ПлатежПоСуммеВзаиморасчетов;
	СтруктураПараметров.Свойство("СсылкаНаДокумент", ОбработкаОбъект.ДокументСсылка);
	СтруктураПараметров.Свойство("ОтражатьВБухгалтерскомУчете", ОбработкаОбъект.ОтражатьВБухгалтерскомУчете);
	ОбработкаОбъект.ЕстьПодбор					=Ложь;
	
	Если СтруктураПараметров.Интерактивно Тогда
		
		ТекстВидОперации=СтруктураПараметров.ВидОперацииДок.Метаданные().Имя;
		
		Если ТекстВидОперации="ВидыОперацийЗаявкиНаРасходование"
			ИЛИ ТекстВидОперации="ВидыОперацийПланируемоеПоступлениеДС" Тогда
			ФормаНастройки=ОбработкаОбъект.ПолучитьФорму("ПараметрыЗаполненияПлан");
			
		Иначе	
			ФормаНастройки=ОбработкаОбъект.ПолучитьФорму("ПараметрыЗаполнения");
		КонецЕсли;
		
		ФормаНастройки.ОткрытьМодально();
		
	Иначе
		
		СтруктураПараметровАвто=СтруктураПараметров.СтруктураПараметровАвто;
		
		ОбработкаОбъект.УчитыватьФактическиеЗадолженности=СтруктураПараметровАвто.УчитыватьФактическиеЗадолженности;
		ОбработкаОбъект.УчитыватьОперативныеЗадолженности=СтруктураПараметровАвто.УчитыватьОперативныеЗадолженности;
		ОбработкаОбъект.ПодбиратьСумму=СтруктураПараметровАвто.ПодбиратьСумму;
		ОбработкаОбъект.СпособЗаполнения=СтруктураПараметровАвто.СпособЗаполнения;
		ОбработкаОбъект.СуммаДляПодбора=СтруктураПараметровАвто.СуммаДляПодбора;
		ОбработкаОбъект.ПоЗаявкам=СтруктураПараметровАвто.ПоЗаявкам;
		ОбработкаОбъект.ПодбиратьПланируемыеДвижения=СтруктураПараметровАвто.ПодбиратьПланируемыеДвижения;
		ОбработкаОбъект.НеПревышатьЗапланированныхЗначений=СтруктураПараметровАвто.НеПревышатьЗапланированныхЗначений;
		ОбработкаОбъект.ВключенныеВПлатежныйКалендарь=СтруктураПараметровАвто.ВключенныеВПлатежныйКалендарь;
		
		Если СтруктураПараметровАвто.Свойство("ОтборПоДоговорам") Тогда
			ОбработкаОбъект.ПостроительОтбораДоговоров.УстановитьНастройки(СтруктураПараметровАвто.ОтборПоДоговорам, Истина, Ложь, Ложь, Ложь, Ложь)
		КонецЕсли;
		
		Если СтруктураПараметровАвто.ПоЗаявкам Тогда
			ОбработкаОбъект.ЗаполнитьРасшифровкуПоПланам();
		Иначе
			ОбработкаОбъект.ЗаполнитьРасшифровкуПоДолгам(СтруктураПараметровАвто.ПодборПоСуммеПлатежа,Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодборЗадолженностей(СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Контрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан контрагент.");
		Возврат;
	КонецЕсли;
	
	// Открываем форму подбора.
	
	ОбработкаОбъект=Обработки.ПодборПараметровРасшифровкиПлатежа.Создать();
	ОбработкаОбъект.ДокументСсылка					=СтруктураПараметров.ДокументСсылка;
	ОбработкаОбъект.КурсДокумента					=СтруктураПараметров.КурсДокумента;
	ОбработкаОбъект.КратностьДокумента				=СтруктураПараметров.КратностьДокумента;
	ОбработкаОбъект.ТипЗадолженности				=СтруктураПараметров.ТипЗадолженности;
	ОбработкаОбъект.Контрагент						=СтруктураПараметров.Контрагент;
	ОбработкаОбъект.ФормаОплаты						=СтруктураПараметров.ФормаОплаты;
	ОбработкаОбъект.ИмяРегистраПлан					=СтруктураПараметров.ИмяРегистраПлан;
	ОбработкаОбъект.ВидОперацииПлан					=СтруктураПараметров.ВидОперацииПлан;
	ОбработкаОбъект.БанковскийСчетКасса				=СтруктураПараметров.БанковскийСчетКасса;
	ОбработкаОбъект.Проект							=СтруктураПараметров.Проект;
	ОбработкаОбъект.СтатьяДвиженияДенежныхСредств	=СтруктураПараметров.СтатьяДвиженияДенежныхСредств;
	ОбработкаОбъект.Организация						=СтруктураПараметров.Организация;
	ОбработкаОбъект.ВалютаДокумента					=СтруктураПараметров.ВалютаДокумента;
	ОбработкаОбъект.ДатаДок							=СтруктураПараметров.ДатаДок;
	ОбработкаОбъект.ВидОперацииДок					=СтруктураПараметров.ВидОперацииДок;
	ОбработкаОбъект.СуммаДляПодбора					=СтруктураПараметров.СуммаДокумента;
	ОбработкаОбъект.РасшифровкаПлатежаДок			=СтруктураПараметров.РасшифровкаПлатежаДок;
	ОбработкаОбъект.ПлатежПоСуммеВзаиморасчетов		=СтруктураПараметров.ПлатежПоСуммеВзаиморасчетов;
	ОбработкаОбъект.ОтражатьВБухгалтерскомУчете		=СтруктураПараметров.ОтражатьВБухгалтерскомУчете;
	ОбработкаОбъект.ЕстьПодбор						= НЕ СтруктураПараметров.ЗакрыватьПриВыборе;
	
	ФормаПодбора = ОбработкаОбъект.ПолучитьФорму("ФормаПодбораЗадолженностей", СтруктураПараметров.ФормаДокумента, "ФормаПодбораЗадолженностейДляПлатежа");
	
	ФормаПодбора.РежимВыбора=Истина;
	ФормаПодбора.ЗакрыватьПриВыборе=СтруктураПараметров.ЗакрыватьПриВыборе;
	
	ФормаПодбора.ОткрытьМодально();
	
КонецПроцедуры

Процедура ПодборДокументовПланирования(СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ФормаОплаты) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана форма оплаты.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ВалютаДокумента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана валюта документа.");
		Возврат;
	КонецЕсли;
	
	// Открываем форму подбора.
	
	ОбработкаОбъект=Обработки.ПодборПараметровРасшифровкиПлатежа.Создать();
	
	СтруктураПараметров.Свойство("ФормаОплаты",ОбработкаОбъект.ФормаОплаты);
	СтруктураПараметров.Свойство("ВалютаДокумента",ОбработкаОбъект.ВалютаДокумента);
	СтруктураПараметров.Свойство("КурсДокумента",ОбработкаОбъект.КурсДокумента);
    СтруктураПараметров.Свойство("КратностьДокумента",ОбработкаОбъект.КратностьДокумента);
    СтруктураПараметров.Свойство("ДатаДок",ОбработкаОбъект.ДатаДок);
	СтруктураПараметров.Свойство("ИмяРегистра",ОбработкаОбъект.ИмяРегистраПлан);
	СтруктураПараметров.Свойство("СуммаДокумента",ОбработкаОбъект.СуммаДляПодбора);
    СтруктураПараметров.Свойство("ВидОперации",ОбработкаОбъект.ВидОперацииПлан);
	СтруктураПараметров.Свойство("БанковскийСчетКасса",ОбработкаОбъект.БанковскийСчетКасса);
	СтруктураПараметров.Свойство("Организация",ОбработкаОбъект.Организация);
	СтруктураПараметров.Свойство("Проект",ОбработкаОбъект.Проект);
	СтруктураПараметров.Свойство("СтатьяДвиженияДенежныхСредств",ОбработкаОбъект.СтатьяДвиженияДенежныхСредств);
	СтруктураПараметров.Свойство("Контрагент",ОбработкаОбъект.Контрагент);
	СтруктураПараметров.Свойство("ДоговорКонтрагента",ОбработкаОбъект.ДоговорКонтрагента);
	СтруктураПараметров.Свойство("Сделка",ОбработкаОбъект.Сделка);
	СтруктураПараметров.Свойство("ДокументРасчетовСКонтрагентом",ОбработкаОбъект.ДокументРасчетовСКонтрагентом);
    СтруктураПараметров.Свойство("ПлатежПоСуммеВзаиморасчетов",ОбработкаОбъект.ПлатежПоСуммеВзаиморасчетов);
	СтруктураПараметров.Свойство("РасшифровкаПлатежаДок",ОбработкаОбъект.РасшифровкаПлатежаДок);
	СтруктураПараметров.Свойство("ОтражатьВБухгалтерскомУчете",ОбработкаОбъект.ОтражатьВБухгалтерскомУчете);
	СтруктураПараметров.Свойство("ВалютаДокумента",ОбработкаОбъект.ВалютаДокумента);
	СтруктураПараметров.Свойство("ДокументСсылка",ОбработкаОбъект.ДокументСсылка);	
	
	ОбработкаОбъект.ЕстьПодбор = НЕ СтруктураПараметров.ЗакрыватьПриВыборе;
	
	Если СтруктураПараметров.Свойство("МножественныйВыбор") Тогда
		МножественныйВыбор= СтруктураПараметров.МножественныйВыбор;
	Иначе
		МножественныйВыбор=Ложь;
	КонецЕсли;
	
	ОбработкаОбъект.МножественныйВыбор=МножественныйВыбор; 
	
	ФормаПодбора = ОбработкаОбъект.ПолучитьФорму("ФормаПодбораПланируемыхДвижений", СтруктураПараметров.ФормаДокумента, "ФормаПодбораПланируемыхПлатежей");
	
	ФормаПодбора.РежимВыбора=Истина;
	ФормаПодбора.ЗакрыватьПриВыборе=СтруктураПараметров.ЗакрыватьПриВыборе;
	
	ФормаПодбора.ОткрытьМодально();

КонецПроцедуры

Процедура ПроверкаРасшифровкиПлатежногоДокументаПередЗаписью(Документ, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если (РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение)
		И (Документ.ЕстьРасчетыСКонтрагентами ИЛИ Документ.ЕстьРасчетыПоКредитам)
		И НЕ Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа") = Документ.СуммаДокумента Тогда
		
		Ответ = Вопрос("Не совпадают сумма документа ("+Документ.СуммаДокумента+") и ее расшифровка ("+Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа")+"). Пересчитать сумму документа?",
				РежимДиалогаВопрос.ДаНет,
				,
				КодВозвратаДиалога.Да);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Документ.СуммаДокумента = Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	//Смартис Лиманчук начало 04.10.2012
	Если (НЕ РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение)
		ИЛИ (НЕ Документ.ЕстьРасчетыСКонтрагентами И НЕ Документ.ЕстьРасчетыПоКредитам)
		ИЛИ Документ.РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Документ.РасшифровкаПлатежа Цикл
		Если Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателяНал ИЛИ
			 Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщикомНал ИЛИ
			 Документ.ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал ИЛИ
			 Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентамиНал ИЛИ
			 Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателюНал ИЛИ
  			 //Смартис Лиманчук начало 06.11.2012
			 Документ.ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентамиНал ИЛИ
			 Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентамиНал ИЛИ
			 //Смартис Лиманчук окончание 06.11.2012
			 Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщикуНал Тогда
			Если Стр.ДоговорКонтрагента.ВидВзаиморасчетов <> Справочники.ВидыВзаиморасчетов.НаличныйРасчет Тогда
				Сообщить("Договор не соответствует выбранному виду операции!");
				Отказ = Истина;
			КонецЕсли;
		Иначе	
			Если Стр.ДоговорКонтрагента.ВидВзаиморасчетов = Справочники.ВидыВзаиморасчетов.НаличныйРасчет Тогда
				Сообщить("Договор не соответствует выбранному виду операции!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Смартис Лиманчук окончание 04.10.2012
	
КонецПроцедуры // ПроверкаРасшифровкиПлатежногоДокументаПередЗаписью(Документ, Отказ, РежимЗапси, РежимПроведения)

// Устанавливает текст надписи сделки на форме документа
//
// Параметры:
//  ДокументОбъект - объект документа, 
//  ФормаДокумента - форма документа.
// ЗаказПокупателя - признак заказа покупателю/поставщику
//
Процедура УстановитьНадписьСделкиПлатеж(СтрокаПлатеж, ФормаДокумента, ВидОперации) Экспорт

	НадписьСделка = "Сделка:";

	ДоговорКонтрагента = СтрокаПлатеж.ДоговорКонтрагента;
	ТипЗаказа=ОпределитьПараметрыВыбораСделки(ВидОперации).ТипЗаказа;

	Если Не (НЕ ЗначениеЗаполнено(ДоговорКонтрагента) ИЛИ ТипЗаказа="Прочие")  Тогда
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		      Или ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда

			НадписьСделка = "Заказ "+?(ТипЗаказа="ЗаказПокупателя","покупателя:", "поставщику:");

		ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам тогда

			НадписьСделка = "Счет "+?(ТипЗаказа="ЗаказПокупателя","покупателю:", "поставщика:");

		КонецЕсли;
		
	КонецЕсли;

	ФормаДокумента.ЭлементыФормы.НадписьСделка.Заголовок = НадписьСделка;

	
КонецПроцедуры // РаботаСДиалогами.УстановитьНадписьСделки()

// Стандартная отработка события изменения контрагента в платежных документах
//
// Параметры
//   ДокументОбъект – ДокументОбъект – Документ, у которого изменился контрагент
//
Процедура ПриИзмененииКонтрагентаВПлатежномДокументе(ДокументОбъект, СтрокаПлатеж) Экспорт

	ВосстанавливатьРеквизиты = (ДокументОбъект.РасшифровкаПлатежа.Количество() = 1);
	СтараяСтатьяДДС = СтрокаПлатеж.СтатьяДвиженияДенежныхСредств;
	СтараяСтавкаНДС = СтрокаПлатеж.СтавкаНДС;
	Проект = СтрокаПлатеж.Проект;
	
	ДокументОбъект.РасшифровкаПлатежа.Очистить();
	
	СтрокаПлатеж = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		СтрокаПлатеж.ДоговорКонтрагента = Неопределено;
	Иначе
		СписокДопустимыхВидовДоговоров          = ОпределитьВидДоговораСКонтрагентом(ДокументОбъект.ВидОперации);
		СтруктураПараметровДляПолученияДоговора = Новый Структура ("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
		//Смартис Лиманчук начало 03.10.2012
		//отбор по признаку наличного учета
		СтруктураПараметровДляПолученияДоговора.Вставить("ОтборНал",Прав(Строка(ДокументОбъект.ВидОперации),5) = "(нал)");
		//Смартис Лиманчук окончание 03.10.2012
		СтрокаПлатеж.ДоговорКонтрагента         = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(
			ДокументОбъект.Организация, ДокументОбъект.Контрагент, СтруктураПараметровДляПолученияДоговора);
	КонецЕсли;

	СтрокаПлатеж.СуммаПлатежа = ДокументОбъект.СуммаДокумента;

	Если ВосстанавливатьРеквизиты Тогда
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтараяСтатьяДДС;
		СтрокаПлатеж.СтавкаНДС = СтараяСтавкаНДС;
		СтрокаПлатеж.Проект = Проект;
		ПересчитатьСуммуНДС(СтрокаПлатеж);
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииКонтрагентаВПлатежномДокументе()

// Открытие списка файлов, присоединенных к документу
Процедура ОткрытьСписокФайловЗаявки(ДокСсылка, ФормаРодителя) Экспорт

	ФормаФайлов = Справочники.ХранилищеДополнительнойИнформации.ПолучитьФорму("ФормаСпискаФайловИИзображений", ФормаРодителя);
	
	ФормаФайлов.Изображения.Отбор.Объект.Использование                               = Истина;
	ФормаФайлов.Изображения.Отбор.Объект.Значение                                    = ДокСсылка;
	ФормаФайлов.ЭлементыФормы.Изображения.НастройкаОтбора.Объект.Доступность         = Ложь;
	ФормаФайлов.ЭлементыФормы.Изображения.Колонки.Объект.Видимость                   = Ложь;
	
	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Использование                       = Истина;
	ФормаФайлов.ДополнительныеФайлы.Отбор.Объект.Значение                            = ДокСсылка;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.НастройкаОтбора.Объект.Доступность = Ложь;
	ФормаФайлов.ЭлементыФормы.ДополнительныеФайлы.Колонки.Объект.Видимость           = Ложь;
	
	ОбязательныеОтборы = Новый Структура;
	ОбязательныеОтборы.Вставить("Объект",ДокСсылка);
	
	ФормаФайлов.ОбязательныеОтборы = ОбязательныеОтборы;
	
	ФормаФайлов.Открыть();

КонецПроцедуры // ОткрытьСписокФайловЗаявки(ДокСсылка)

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПРОВЕДЕНИЯ ДОКУМЕНТОВ ПОДСИСТЕМЫ ДЕНЕЖНЫХ СРЕДСТВ


Процедура ПровестиСписаниеДенежныхСредствУпр(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок) Экспорт
	
	РасчетыВозврат    = СтруктураПараметров.РасчетыВозврат;
	КоэффициентСторно = ?(РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат, -1, 1);
	
	РасчетыСКонтрагентами = СтруктураПараметров.ЕстьРасчетыСКонтрагентами ИЛИ СтруктураПараметров.ЕстьРасчетыПоКредитам;
	ОтраженоВОперУчете    = СтруктураШапкиДокумента.ОтраженоВОперУчете;
	Оплачено              = СтруктураШапкиДокумента.Оплачено;
	
	Дата         = СтруктураШапкиДокумента.Дата;
	ДатаДвижений = СтруктураПараметров.ДатаДвижений;
	
	Организация         = СтруктураШапкиДокумента.Организация;
	ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредств;
	СуммаДокумента      = СтруктураШапкиДокумента.СуммаДокумента;
	ВалютаДокумента     = СтруктураШапкиДокумента.ВалютаДокумента;
	Ссылка              = СтруктураШапкиДокумента.Ссылка;
	БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКасса;
	ВидОперации         = СтруктураШапкиДокумента.ВидОперации;
	Контрагент          = СтруктураШапкиДокумента.Контрагент;
	
	ВидОперацииИмя						= Строка(ВидОперации);
	Для каждого ЗначениеПеречисления Из ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = ВидОперацииИмя Тогда
			ВидОперацииИмя				= ЗначениеПеречисления.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоОбъявлениюНаВзносНаличными = СтруктураПараметров.Свойство("ПоОбъявлениюНаВзносНаличными") 
		И СтруктураПараметров.ПоОбъявлениюНаВзносНаличными;
	
	ПоРасчетномуДокументу = СтруктураПараметров.Свойство("ПоРасчетномуДокументу") 
		И СтруктураПараметров.ПоРасчетномуДокументу;

	ДвиженияПоСтатьям      = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоЗаявкам      = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоРезерву      = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоКонтрагентам = ТаблицаПлатежейУпр.Скопировать();
	
	ДвиженияПоЗаявкам.Свернуть("ДокументПланированияПлатежа,ВключатьВПлатежныйКалендарь,ДоговорКонтрагента,ВедениеВзаиморасчетов,ВестиПоДокументамРасчетовСКонтрагентом,Сделка,ДокументРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств,Проект,ЗаТару","СуммаПлатежа,СуммаВзаиморасчетов,СуммаПлатежаПлан,СуммаУпр");
	
	Если РасчетыСКонтрагентами Тогда
		ДвиженияПоКонтрагентам.Свернуть("ДоговорКонтрагента,ВедениеВзаиморасчетов,ВестиПоДокументамРасчетовСКонтрагентом,Сделка,ДокументРасчетовСКонтрагентом,ВидДоговора,Проект,ЗаТару","СуммаВзаиморасчетов,СуммаУпр,СуммаРегл,СуммаВзаиморасчетовОстаток,СуммаУпрОстаток");
	КонецЕсли;

	ДвиженияПоСтатьям.Свернуть("СтатьяДвиженияДенежныхСредств","СуммаПлатежа,СуммаУпр");
	ДвиженияПоРезерву.Свернуть("ДокументПланированияПлатежа","СуммаПлатежаПлан");
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РКОВыплатаЗаработнойПлаты.Ведомость,
		|	РКОВыплатаЗаработнойПлаты.СуммаПлатежа,
		|	РКОВыплатаЗаработнойПлаты.СтатьяДвиженияДенежныхСредств
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер.ВыплатаЗаработнойПлаты КАК РКОВыплатаЗаработнойПлаты
		|ГДЕ
		|	РКОВыплатаЗаработнойПлаты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ВыплатаЗаработнойПлаты = Запрос.Выполнить().Выгрузить();
		МассивВедомостей = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ВыплатаЗаработнойПлаты.ВыгрузитьКолонку("Ведомость"));
		
	КонецЕсли;
		
	Если Оплачено Тогда
		
		ТаблицаДенежныеСредства          = Движения.ДенежныеСредства.ВыгрузитьКолонки();
		ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();
		
		// По регистру "Денежные средства" - расход
		
		СтрокаКурсыВалют = ТаблицаПлатежейУпр[0];
		
		СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			СуммаДокумента, 
			ВалютаДокумента, глЗначениеПеременной("ВалютаУправленческогоУчета"), 
			СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, 
			СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета);
		
		СтрокаДвиженийОстатки = ТаблицаДенежныеСредства.Добавить();
		
		СтрокаДвиженийОстатки.БанковскийСчетКасса = БанковскийСчетКасса;
		СтрокаДвиженийОстатки.Организация 		  = Организация;
		СтрокаДвиженийОстатки.ВидДенежныхСредств  = ВидДенежныхСредств;
		СтрокаДвиженийОстатки.Сумма               = СуммаДокумента;
		СтрокаДвиженийОстатки.СуммаУпр            = СуммаУпр;
		
		// По регистру "Денежные средства к списанию" - расход
		
		Если НЕ ВидОперации=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
		
			Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
				
				СтрокаДвиженийСписание = ТаблицаДенежныеСредстваКСписанию.Добавить();
				
				СтрокаДвиженийСписание.БанковскийСчетКасса = БанковскийСчетКасса;
				СтрокаДвиженийСписание.Организация 		   = Организация;
				СтрокаДвиженийСписание.ВидДенежныхСредств  = ВидДенежныхСредств;
				СтрокаДвиженийСписание.Сумма               = СтрокаДвижение.СуммаПлатежа;
				Если ПоОбъявлениюНаВзносНаличными Тогда
					СтрокаДвиженийСписание.ДокументСписания = СтруктураШапкиДокумента.ОбъявлениеНаВзносНаличными;
				ИначеЕсли ПоРасчетномуДокументу Тогда
					СтрокаДвиженийСписание.ДокументСписания = СтруктураШапкиДокумента.РасчетныйДокумент;
				Иначе
					СтрокаДвиженийСписание.ДокументСписания = Ссылка;
				КонецЕсли;
				СтрокаДвиженийСписание.СтатьяДвиженияДенежныхСредств = СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;
			
		ИначеЕсли СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда 
			// Тип ведомостей упручета - "ЗарплатаКВыплате" - 
			// не входит в типы измерения ДокументСписания регистра ДенежныеСредстваКСписанию,
			// поэтому по таким ведомостям не может быть остатков
			
			Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
				СтруктураПараметровБлокировки = Новый Структура(
					"ИмяТаблицы, ИсточникДанных", 
					"ДенежныеСредстваКСписанию", ВыплатаЗаработнойПлаты);
				СтруктураЗначенийБлокировки   = Новый Структура(
					"ВидДенежныхСредств, Организация", 
					ВидДенежныхСредств, Организация);
				СтруктураИсточникаДанных      = Новый Структура(
					"ДокументСписания", "Ведомость");
				ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДенежныеСредстваКСписаниюОстатки.ДокументСписания,
			|	ДенежныеСредстваКСписаниюОстатки.СуммаОстаток КАК Остаток,
			|	ДенежныеСредстваКСписаниюОстатки.БанковскийСчетКасса,
			|	ДенежныеСредстваКСписаниюОстатки.СтатьяДвиженияДенежныхСредств
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваКСписанию.Остатки(, 
			|		ВидДенежныхСредств = &ВидДенежныхСредств 
			|			И Организация = &Организация 
			|			И ДокументСписания В (&МассивВедомостей)) КАК ДенежныеСредстваКСписаниюОстатки
			|
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрНакопления.ДенежныеСредстваКСписанию.Остатки";
			
			Запрос.УстановитьПараметр("ВидДенежныхСредств", ВидДенежныхСредств);
			Запрос.УстановитьПараметр("МассивВедомостей",   МассивВедомостей);
			Запрос.УстановитьПараметр("Организация", Организация);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТаблицаВедомости = ТаблицаДенежныеСредстваКСписанию.Скопировать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаДвижений = ТаблицаВедомости.Добавить();
				
				СтрокаДвижений.БанковскийСчетКасса  = Выборка.БанковскийСчетКасса;
				СтрокаДвижений.Организация 			= Организация;
				СтрокаДвижений.ВидДенежныхСредств   = ВидДенежныхСредств;
				СтрокаДвижений.Сумма                = Выборка.Остаток;
				СтрокаДвижений.ДокументСписания     = Выборка.ДокументСписания;
				СтрокаДвижений.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;
			
			Если НЕ ТаблицаВедомости.Количество() = ВыплатаЗаработнойПлаты.Количество() Тогда
				
				Для Каждого Ведомость ИЗ ВыплатаЗаработнойПлаты Цикл
					
					Если ТаблицаВедомости.Найти(Ведомость.Ведомость, "ДокументСписания") = Неопределено Тогда
						
						СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
						
						СтрокаДвижений.БанковскийСчетКасса  = БанковскийСчетКасса;
						СтрокаДвижений.Организация 			= Организация;
						СтрокаДвижений.ВидДенежныхСредств   = ВидДенежныхСредств;
						СтрокаДвижений.Сумма                = Ведомость.СуммаПлатежа;
						СтрокаДвижений.ДокументСписания     = Ведомость.Ведомость;
						СтрокаДвижений.СтатьяДвиженияДенежныхСредств = Ведомость.СтатьяДвиженияДенежныхСредств;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаВедомости, ТаблицаДенежныеСредстваКСписанию);
				
			Иначе
				ТаблицаДенежныеСредстваКСписанию = ТаблицаВедомости;
			КонецЕсли;
		
		КонецЕсли;
		
		Движения.ДенежныеСредства.мПериод          = ДатаДвижений;
		Движения.ДенежныеСредства.мТаблицаДвижений = ТаблицаДенежныеСредства;
		Движения.ДенежныеСредства.ВыполнитьРасход();
		
		Движения.ДенежныеСредстваКСписанию.мПериод          = ДатаДвижений;
		Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
		Движения.ДенежныеСредстваКСписанию.ВыполнитьРасход();
		
		Если ВидОперации=Перечисления.ВидыОперацийППИсходящее.ПокупкаПродажаВалюты Или ВидОперации=Перечисления.ВидыОперацийПлатежныйОрдерСписание.ПокупкаПродажаВалюты Тогда
			
			НаборДвижений			= Движения.ДенежныеСредстваВПути;
			ТаблицаДвижений			= НаборДвижений.Выгрузить();
			
			СтрокаДвижений 			= ТаблицаДвижений.Добавить();
			СтрокаДвижений.Банк     = Контрагент;
			СтрокаДвижений.Валюта   = Ссылка.СчетОрганизации.ВалютаДенежныхСредств;
			СтрокаДвижений.Сумма    = СуммаДокумента;
			СтрокаДвижений.СуммаУпр = СуммаУпр;
			
			НаборДвижений.мПериод              = ДатаДвижений;
			НаборДвижений.мТаблицаДвижений     = ТаблицаДвижений;
			Движения.ДенежныеСредстваВПути.ВыполнитьПриход();
			
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет 
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет
			//Смартис Лиманчук начало 03.10.2012
			//ИЛИ (ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк И НЕ ПоОбъявлениюНаВзносНаличными) Тогда
			ИЛИ ((ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанкНал) И НЕ ПоОбъявлениюНаВзносНаличными) Тогда
			//Смартис Лиманчук окончание 03.10.2012
			
			// По регистру "Денежные средства" - приход
			
			ТаблицаДенежныеСредства.Очистить();
			
			СтрокаДвиженийОстатки = ТаблицаДенежныеСредства.Добавить();
			
			СтрокаДвиженийОстатки.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаПолучатель;
			СтрокаДвиженийОстатки.Организация 		  = Организация;
			СтрокаДвиженийОстатки.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствПолучатель;
			СтрокаДвиженийОстатки.Сумма               = СуммаДокумента;
			СтрокаДвиженийОстатки.СуммаУпр            = СуммаУпр;
			
			Движения.ДенежныеСредства.мПериод          = ДатаДвижений;
			Движения.ДенежныеСредства.мТаблицаДвижений = ТаблицаДенежныеСредства;
			Движения.ДенежныеСредства.ВыполнитьПриход();
			
			// По регистру "Денежные средства к получению" - расход
			
			ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();
			
			Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
				
				СтрокаДвиженийПолучение = ТаблицаДенежныеСредстваКПолучению.Добавить();
				
				СтрокаДвиженийПолучение.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаПолучатель;
				СтрокаДвиженийПолучение.Организация 		= Организация;
				СтрокаДвиженийПолучение.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствПолучатель;
				СтрокаДвиженийПолучение.Сумма               = СтрокаДвижение.СуммаПлатежа;
				СтрокаДвиженийПолучение.СуммаУпр            = СтрокаДвижение.СуммаУпр;
				СтрокаДвиженийПолучение.ДокументПолучения   = Ссылка;
				СтрокаДвиженийПолучение.СтатьяДвиженияДенежныхСредств = СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;
			
			Движения.ДенежныеСредстваКПолучению.мПериод          = ДатаДвижений;
			Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
			Движения.ДенежныеСредстваКПолучению.ВыполнитьРасход();
			
		КонецЕсли;
		
	КонецЕсли;

	Если ОтраженоВОперУчете И НЕ ПоРасчетномуДокументу И НЕ ПоОбъявлениюНаВзносНаличными Тогда

		// По регистру "Денежные средства к списанию" - приход
		
		ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();
		
		Если НЕ ВидОперации=Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда

			Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
				
				СтрокаДвиженийДС = ТаблицаДенежныеСредстваКСписанию.Добавить();
				
				СтрокаДвиженийДС.БанковскийСчетКасса = БанковскийСчетКасса;
				СтрокаДвиженийДС.Организация 		 = Организация;
				СтрокаДвиженийДС.ВидДенежныхСредств  = ВидДенежныхСредств;
				СтрокаДвиженийДС.Сумма               = СтрокаДвижение.СуммаПлатежа;
				СтрокаДвиженийДС.ДокументСписания    = Ссылка;
				СтрокаДвиженийДС.СтатьяДвиженияДенежныхСредств = СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;

			Движения.ДенежныеСредстваКСписанию.мПериод          = ?(Оплачено, Мин(ДатаДвижений, Дата), Дата);
			Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
			Движения.ДенежныеСредстваКСписанию.ВыполнитьПриход();
			
		ИначеЕсли СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда 
			// Проверяем ведомости, которые не были ранее приняты к списанию.
			// Тип ведомостей упручета - "ЗарплатаКВыплате" - 
			// не входит в типы измерения ДокументСписания регистра ДенежныеСредстваКСписанию,
			// поэтому по таким ведомостям не может быть остатков
			Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
				СтруктураПараметровБлокировки = Новый Структура(
					"ИмяТаблицы, ИсточникДанных", 
					"ДенежныеСредстваКСписанию", ВыплатаЗаработнойПлаты);
				СтруктураЗначенийБлокировки   = Новый Структура(
					"ВидДенежныхСредств, Организация", 
					ВидДенежныхСредств, Организация);
				СтруктураИсточникаДанных      = Новый Структура(
					"ДокументСписания", "Ведомость");
				ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходныйКассовыйОрдерВыплатаЗаработнойПлаты.Ведомость КАК Ведомость,
			|	РасходныйКассовыйОрдерВыплатаЗаработнойПлаты.СуммаПлатежа КАК Сумма,
			|	ДенежныеСредстваКСписаниюОстатки.ДокументСписания,
			|	РасходныйКассовыйОрдерВыплатаЗаработнойПлаты.СтатьяДвиженияДенежныхСредств
			|ИЗ
			|	Документ.РасходныйКассовыйОрдер.ВыплатаЗаработнойПлаты КАК РасходныйКассовыйОрдерВыплатаЗаработнойПлаты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКСписанию.Остатки(,
			|			ВидДенежныхСредств = &ВидДенежныхСредств 
			|				И Организация = &Организация 
			|				И ДокументСписания В (&МассивВедомостей)) КАК ДенежныеСредстваКСписаниюОстатки
			|		ПО РасходныйКассовыйОрдерВыплатаЗаработнойПлаты.Ведомость = ДенежныеСредстваКСписаниюОстатки.ДокументСписания
			|ГДЕ
			|	РасходныйКассовыйОрдерВыплатаЗаработнойПлаты.Ссылка = &Ссылка
			|		И ДенежныеСредстваКСписаниюОстатки.ДокументСписания ЕСТЬ NULL
			|
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрНакопления.ДенежныеСредстваКСписанию.Остатки";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ВидДенежныхСредств", ВидДенежныхСредств);
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("МассивВедомостей", МассивВедомостей);
			Результат     = Запрос.Выполнить();
			ЕстьВедомости = НЕ Результат.Пустой();
			
			Если ЕстьВедомости Тогда
			
				Выборка = Результат.Выбрать();
			
				Пока Выборка.Следующий() Цикл
					
					СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
					СтрокаДвижений.БанковскийСчетКасса  = БанковскийСчетКасса;
					СтрокаДвижений.Организация 			= Организация;
					СтрокаДвижений.ВидДенежныхСредств   = ВидДенежныхСредств;
					СтрокаДвижений.Сумма                = Выборка.Сумма;
					СтрокаДвижений.ДокументСписания     = Выборка.Ведомость;
					СтрокаДвижений.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
					
				КонецЦикла;
				
				Движения.ДенежныеСредстваКСписанию.мПериод          = ?(Оплачено, Мин(ДатаДвижений, Дата), Дата);
				Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
				Движения.ДенежныеСредстваКСписанию.ВыполнитьПриход();
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет
			//Смартис Лиманчук начало 03.10.2012
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанкНал
			//Смартис Лиманчук окончание 03.10.2012
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
			
			// По регистру "Денежные средства к получению" - приход
			
			ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();
			
			Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
				
				СтрокаДвиженийДС = ТаблицаДенежныеСредстваКПолучению.Добавить();
				
				СтрокаДвиженийДС.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаПолучатель;
				СтрокаДвиженийДС.Организация 		 = Организация;
				СтрокаДвиженийДС.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствПолучатель;
				СтрокаДвиженийДС.Сумма               = СтрокаДвижение.СуммаПлатежа;
				СтрокаДвиженийДС.СуммаУпр            = СтрокаДвижение.СуммаУпр;
				СтрокаДвиженийДС.ДокументПолучения   = Ссылка;
				СтрокаДвиженийДС.СтатьяДвиженияДенежныхСредств=СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;
			
			Движения.ДенежныеСредстваКПолучению.мПериод          = ?(Оплачено, Мин(ДатаДвижений,Дата), Дата);
			Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
			Движения.ДенежныеСредстваКПолучению.ВыполнитьПриход();
			
		КонецЕсли;
		
		ЕстьРезерв     = Ложь;
		ЕстьРазмещение = Ложь;
		
		// По регистру "Денежные средства в резерве" - расход
		
		ТаблицаДенежныеСредстваВРезерве = Движения.ДенежныеСредстваВРезерве.ВыгрузитьКолонки();
		
		// По регистру "Размещение заявок на расходование средств" - расход
		ТаблицаРазмещениеЗаявокНаРасходованиеСредств = Движения.РазмещениеЗаявокНаРасходованиеСредств.ВыгрузитьКолонки();
		
		// По регистру "Заявки на расходование средств" - расход
		ТаблицаЗаявкиНаРасходованиеСредств = Движения.ЗаявкиНаРасходованиеСредств.ВыгрузитьКолонки();
		
		// Проверим необходимость списания суммы платежного поручения по заявкам из регистра "ДенежныеСредстваРезерв"
		Для Каждого СтрокаЗаявка Из ДвиженияПоРезерву Цикл
			
			Если НЕ СтрокаЗаявка.ДокументПланированияПлатежа.Пустая() Тогда
				
				Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
					СтруктураПараметровБлокировки = Новый Структура(
						"ИмяТаблицы", "ДенежныеСредстваВРезерве");
					СтруктураЗначенийБлокировки   = Новый Структура(
						"БанковскийСчетКасса, ВидДенежныхСредств, ДокументРезервирования, Организация", 
						БанковскийСчетКасса, ВидДенежныхСредств, СтрокаЗаявка.ДокументПланированияПлатежа, Организация);
					ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, , Отказ, Заголовок);
					
				КонецЕсли;
			
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("БанковскийСчетКасса", БанковскийСчетКасса);
				Запрос.УстановитьПараметр("ВидДенежныхСредств", ВидДенежныхСредств);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДокументРезервирования", СтрокаЗаявка.ДокументПланированияПлатежа);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДенежныеСредстваВРезервеОстатки.СуммаОстаток КАК СуммаОстаток
				|ИЗ
				|	РегистрНакопления.ДенежныеСредстваВРезерве.Остатки(
				|			,
				|			БанковскийСчетКасса = &БанковскийСчетКасса
				|				И ВидДенежныхСредств = &ВидДенежныхСредств
				|				И ДокументРезервирования = &ДокументРезервирования
				|				И Организация = &Организация) КАК ДенежныеСредстваВРезервеОстатки
				|ГДЕ
				|	ДенежныеСредстваВРезервеОстатки.СуммаОстаток ЕСТЬ НЕ NULL 
				|
				|ДЛЯ ИЗМЕНЕНИЯ
				|	РегистрНакопления.ДенежныеСредстваВРезерве.Остатки";
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					СтрокаДвижений = ТаблицаДенежныеСредстваВРезерве.Добавить();
					СтрокаДвижений.БанковскийСчетКасса = БанковскийСчетКасса;
					СтрокаДвижений.Организация 		   = Организация;
					СтрокаДвижений.ВидДенежныхСредств  = ВидДенежныхСредств;
					СтрокаДвижений.Сумма               = Мин(Выборка.СуммаОстаток, СтрокаЗаявка.СуммаПлатежаПлан);
					СтрокаДвижений.ДокументРезервирования = СтрокаЗаявка.ДокументПланированияПлатежа;
					
					ЕстьРезерв = Истина;
					
				КонецЕсли;
				
				// Ранжируем планируемые поступления для закрытия. Первыми закрываются размещения по планируемым поступлениям,
				// у которых совпадает счет, затем форма оплаты, затем организация.
				
				Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
					СтруктураПараметровБлокировки = Новый Структура(
						"ИмяТаблицы", "РазмещениеЗаявокНаРасходованиеСредств");
					СтруктураЗначенийБлокировки   = Новый Структура(
						"ДокументРезервирования", СтрокаЗаявка.ДокументПланированияПлатежа);
					ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, , Отказ, Заголовок);
					
				КонецЕсли;
			
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РазмещениеЗаявок.ДокументПланирования КАК ДокументПланирования,
				|	РазмещениеЗаявок.СуммаОстаток КАК СуммаОстаток,
				|	(ВЫБОР КОГДА РазмещениеЗаявок.ДокументПланирования.БанковскийСчетКасса = &БанковскийСчетКасса
				|		Тогда 4
				|	Иначе 0
				|	Конец
				|  + ВЫБОР КОГДА РазмещениеЗаявок.ДокументПланирования.ФормаОплаты = &ВидДенежныхСредств
				|		Тогда 2
				|	Иначе 0
				|	Конец
				|  + ВЫБОР КОГДА РазмещениеЗаявок.ДокументПланирования.Организация = &Организация
				|		Тогда 1
				|	Иначе 0
				|	Конец) КАК Релевантность,
				|	РазмещениеЗаявок.ДокументПланирования.ДатаПоступления КАК ДатаПоступления
				|ИЗ
				|	РегистрНакопления.РазмещениеЗаявокНаРасходованиеСредств.Остатки(, ДокументРезервирования = &ДокументРезервирования) КАК РазмещениеЗаявок
				|
				|ДЛЯ ИЗМЕНЕНИЯ
				|	РегистрНакопления.РазмещениеЗаявокНаРасходованиеСредств.Остатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	Релевантность Убыв,
				|	ДатаПоступления Возр";
				
				Запрос.УстановитьПараметр("БанковскийСчетКасса",    БанковскийСчетКасса);
				Запрос.УстановитьПараметр("ВидДенежныхСредств",     ВидДенежныхСредств);
				Запрос.УстановитьПараметр("Организация",            Организация);
				Запрос.УстановитьПараметр("ДокументРезервирования", СтрокаЗаявка.ДокументПланированияПлатежа);
				
				ТабРазмещение = Запрос.Выполнить().Выгрузить();
				
				СуммаКСписанию = СтрокаЗаявка.СуммаПлатежаПлан;
				
				Для Каждого Строка Из ТабРазмещение Цикл
					
					ЕстьРазмещение = Истина;
					
					СтрокаДвижение = ТаблицаРазмещениеЗаявокНаРасходованиеСредств.Добавить();
					СтрокаДвижение.ДокументПланирования   = Строка.ДокументПланирования;
					СтрокаДвижение.ДокументРезервирования = СтрокаЗаявка.ДокументПланированияПлатежа;
					
					Если Строка.СуммаОстаток >= СуммаКСписанию Тогда
						
						СтрокаДвижение.Сумма = СуммаКСписанию;
						Прервать;
						
					Иначе
						
						СтрокаДвижение.Сумма = Строка.СуммаОстаток;
						СуммаКСписанию       = СуммаКСписанию - Строка.СуммаОстаток;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьРезерв тогда
			
			Движения.ДенежныеСредстваВРезерве.мПериод          = Дата;
			Движения.ДенежныеСредстваВРезерве.мТаблицаДвижений = ТаблицаДенежныеСредстваВРезерве;	
			Движения.ДенежныеСредстваВРезерве.ВыполнитьРасход();
			
		КонецЕсли;
		
		Если ЕстьРазмещение Тогда
			
			Движения.РазмещениеЗаявокНаРасходованиеСредств.мПериод          = Дата;
			Движения.РазмещениеЗаявокНаРасходованиеСредств.мТаблицаДвижений = ТаблицаРазмещениеЗаявокНаРасходованиеСредств;	
			Движения.РазмещениеЗаявокНаРасходованиеСредств.ВыполнитьРасход();
			
		КонецЕсли;
		
		// По регистру ""Расчеты с контрагентами"" - расход при возврате, иначе приход
		
		ТаблицаРасчетыСКонтрагентами = Движения.РасчетыСКонтрагентами.ВыгрузитьКолонки();
		
		Для Каждого СтрокаПлатеж ИЗ ДвиженияПоЗаявкам Цикл
			
			ЕстьЗаявка  = Ложь;
			ЕстьРасчеты = Ложь;
			
			ТекущаяСделка = УправлениеВзаиморасчетами.ОпределитьСделку(СтрокаПлатеж, СтрокаПлатеж);
			
			Если НЕ СтрокаПлатеж.ДокументПланированияПлатежа.Пустая() Тогда
				
				СуммаПлатежа = СтрокаПлатеж.СуммаПлатежаПлан;
				
				СтрокаДвиженийЗаявки = ТаблицаЗаявкиНаРасходованиеСредств.Добавить();
				
				СтрокаДвиженийЗаявки.СуммаУпр						= СтрокаПлатеж.СуммаУпр;
				СтрокаДвиженийЗаявки.Сумма							= СтрокаПлатеж.СуммаПлатежаПлан;
				СтрокаДвиженийЗаявки.СуммаВзаиморасчетов			= СтрокаПлатеж.СуммаВзаиморасчетов;
				СтрокаДвиженийЗаявки.ЗаявкаНаРасходование			= СтрокаПлатеж.ДокументПланированияПлатежа;
				СтрокаДвиженийЗаявки.ДоговорКонтрагента				= СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвиженийЗаявки.СтатьяДвиженияДенежныхСредств	= СтрокаПлатеж.СтатьяДвиженияДенежныхСредств;
				СтрокаДвиженийЗаявки.Проект							= СтрокаПлатеж.Проект;
				СтрокаДвиженийЗаявки.Организация					= Организация;
				Если ВидОперации <> Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику 
					И ВидОперации <> Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику
					Тогда
					СтрокаДвиженийЗаявки.Контрагент	= Контрагент;
				КонецЕсли;
				СтрокаДвиженийЗаявки.Сделка = СтрокаПлатеж.Сделка;
				Если СтрокаПлатеж.ВестиПоДокументамРасчетовСКонтрагентом Тогда
					СтрокаДвиженийЗаявки.ДокументРасчетовСКонтрагентом = СтрокаПлатеж.ДокументРасчетовСКонтрагентом;
				КонецЕсли;
				
				ЕстьЗаявка = Истина;
				
				Если НЕ СтрокаПлатеж.ВключатьВПлатежныйКалендарь Тогда // Документ не был проведен по оперативным взаиморасчетам
					ЕстьРасчеты = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ((Не ЕстьЗаявка) ИЛИ ЕстьРасчеты) И РасчетыСКонтрагентами Тогда // Первое упоминание о планируемом платеже в системе
				
				Если СтрокаПлатеж.ЗаТару Тогда
					//Не отражаем в управленческом учете
					Продолжить;
				КонецЕсли;
				
				СтрокаДвиженийКонтрагенты = ТаблицаРасчетыСКонтрагентами.Добавить();
				
				СтрокаДвиженийКонтрагенты.ДоговорКонтрагента  = СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвиженийКонтрагенты.Контрагент  		  = Контрагент;
				СтрокаДвиженийКонтрагенты.Организация  	   	  = Организация;
				СтрокаДвиженийКонтрагенты.РасчетыВозврат      = РасчетыВозврат;
				СтрокаДвиженийКонтрагенты.Сделка              = УправлениеВзаиморасчетами.ОпределитьСделку(СтрокаПлатеж, СтрокаПлатеж, , Истина);
				СтрокаДвиженийКонтрагенты.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов * КоэффициентСторно;
				СтрокаДвиженийКонтрагенты.СуммаУпр            = СтрокаПлатеж.СуммаУпр * КоэффициентСторно;
				СтрокаДвиженийКонтрагенты.Период			  = Дата;
				СтрокаДвиженийКонтрагенты.ВидДвижения		  = ?(КоэффициентСторно = 1, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
				СтрокаДвиженийКонтрагенты.Активность		  = Истина;

				ЕстьРасчеты = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаЗаявкиНаРасходованиеСредств.Количество() > 0 Тогда
			
			Движения.ЗаявкиНаРасходованиеСредств.мПериод          = Дата;
			Движения.ЗаявкиНаРасходованиеСредств.мТаблицаДвижений = ТаблицаЗаявкиНаРасходованиеСредств;
			Движения.ЗаявкиНаРасходованиеСредств.ВыполнитьРасход();
			
		КонецЕсли;
		
		Если ТаблицаРасчетыСКонтрагентами.Количество() > 0 Тогда
			
			Движения.РасчетыСКонтрагентами.мТаблицаДвижений	= ТаблицаРасчетыСКонтрагентами;
			Движения.РасчетыСКонтрагентами.ВыполнитьДвижения();
			
		КонецЕсли;
		
	КонецЕсли;

	Если Оплачено И (ОтраженоВОперУчете ИЛИ ПоРасчетномуДокументу) Тогда  // Проводим по фактическим взаиморасчетам

		// По регистру "Движения денежных средств"
		
		ТаблицаДвиженияДенежныхСредств = Движения.ДвиженияДенежныхСредств.ВыгрузитьКолонки();
		
		ДвиженияДенежныхСредств = ТаблицаПлатежейУпр.Скопировать();
		
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
			
			ДвиженияДенежныхСредств.Свернуть("ДокументПланированияПлатежа,ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВестиПоДокументамРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств,Проект", "СуммаПлатежа,СуммаУпр");
			ДвиженияДенежныхСредств.Колонки["СуммаПлатежа"].Имя = "Сумма";
			
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств, Неопределено, ДатаДвижений, "ДенежныеСредстваСписание", Ссылка);
			
		Иначе
			
			ДвиженияДенежныхСредств.Свернуть("ДокументПланированияПлатежа,ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВестиПоДокументамРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств", "СуммаПлатежа,СуммаУпр");
			ДвиженияДенежныхСредств.Колонки["СуммаПлатежа"].Имя="Сумма";
			
			Для каждого СтрокаПлатеж Из ДвиженияДенежныхСредств Цикл
				
				УправлениеПроектами.ОпределитьРасчетныйДокумент(СтрокаПлатеж, Ссылка);
				
			КонецЦикла; 
			
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств);
			
		КонецЕсли;
		
		// Недостающие поля.
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(ВидДенежныхСредств, "ВидДенежныхСредств");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Перечисления.ВидыДвиженийПриходРасход.Расход, "ПриходРасход");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(БанковскийСчетКасса, "БанковскийСчетКасса");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация, "Организация");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Ссылка, "ДокументДвижения");
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет 
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет
			//Смартис Лиманчук начало 03.10.2012
			ИЛИ (ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанкНал И НЕ ПоОбъявлениюНаВзносНаличными) 
			//Смартис Лиманчук окончание 03.10.2012
			ИЛИ (ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк И НЕ ПоОбъявлениюНаВзносНаличными) 
			Тогда
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация, "Контрагент");
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику 
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику
			Тогда
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(СтруктураШапкиДокумента.ФизЛицо, "Контрагент");
		Иначе
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Контрагент, "Контрагент");
		КонецЕсли;
		
		Движения.ДвиженияДенежныхСредств.мПериод          = ДатаДвижений;
		Движения.ДвиженияДенежныхСредств.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
		//Смартис Лиманчук начало 03.08.2012
		//Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения();
		Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения(Отказ);
		//Смартис Лиманчук окончание 03.08.2012
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПереводНаДругойСчет
			//Смартис Лиманчук начало 03.10.2012
			//ИЛИ (ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк И НЕ ПоОбъявлениюНаВзносНаличными) 
			ИЛИ ((ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанкНал) И НЕ ПоОбъявлениюНаВзносНаличными) 
			//Смартис Лиманчук окончание 03.10.2012
			Тогда
			
			ТаблицаДвиженияДенежныхСредств.Очистить();
			
			// Заполним таблицу движений.
			Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
				УправлениеПроектами.ОтразитьДвиженияПоПроектам(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств, Неопределено, Дата, "ДенежныеСредства");
			Иначе
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств);
			КонецЕсли;
			
			// Недостающие поля.
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(СтруктураПараметров.ВидДенежныхСредствПолучатель,  "ВидДенежныхСредств");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Перечисления.ВидыДвиженийПриходРасход.Приход, "ПриходРасход");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(СтруктураПараметров.БанковскийСчетКассаПолучатель, "БанковскийСчетКасса");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация, "Организация");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Ссылка, "ДокументДвижения");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация, "Контрагент");
			
			Движения.ДвиженияДенежныхСредств.мПериод          = ДатаДвижений;
			Движения.ДвиженияДенежныхСредств.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
			
			//Смартис Лиманчук начало 03.08.2012
			//Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения();
			Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения(Отказ);
			//Смартис Лиманчук окончание 03.08.2012
			
		КонецЕсли;
	
		Если РасчетыСКонтрагентами Тогда

			// По регистру "ВзаиморасчетыСКонтрагентами" - расход при возврате, иначе приход
			
			ТаблицаВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами.ВыгрузитьКолонки();
			
			Для Каждого СтрокаПлатеж ИЗ ДвиженияПоКонтрагентам Цикл

				Если СтрокаПлатеж.ЗаТару Тогда
					//Не отражаем в управленческом учете
					Продолжить;
				КонецЕсли;
				
				ТекущаяСделка = УправлениеВзаиморасчетами.ОпределитьСделку(СтрокаПлатеж, СтрокаПлатеж);
				
				СтрокаДвижений = ТаблицаВзаиморасчетыСКонтрагентами.Добавить();
				
				СтрокаДвижений.ДоговорКонтрагента  = СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвижений.Контрагент  		   = Контрагент;
				СтрокаДвижений.Организация  	   = Организация;

				СтрокаДвижений.Сделка              = ТекущаяСделка;
				
				СтрокаДвижений.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов * КоэффициентСторно;
				СтрокаДвижений.СуммаУпр            = СтрокаПлатеж.СуммаУпр * КоэффициентСторно;
				
			КонецЦикла;

			Движения.ВзаиморасчетыСКонтрагентами.мПериод          = ДатаДвижений;
			Движения.ВзаиморасчетыСКонтрагентами.мТаблицаДвижений = ТаблицаВзаиморасчетыСКонтрагентами;
			Если КоэффициентСторно = 1 Тогда
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
			Иначе
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход();
			КонецЕсли;

		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику
			//Смартис Лиманчук начало 01.11.2012
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетникуНал
			//Смартис Лиманчук окончание 01.11.2012
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерСписание.ПеречислениеДенежныхСредствПодотчетнику
			ИЛИ ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику Тогда
			
			// По регистру "ВзаиморасчетыСПодотчетнымиЛицами" - приход
			
			СтрокаПлатеж = ТаблицаПлатежейУпр[0];
			
			ТаблицаВзаиморасчетыСПодотчетнымиЛицами = Движения.ВзаиморасчетыСПодотчетнымиЛицами.ВыгрузитьКолонки();
			
			СтрокаДвижений = ТаблицаВзаиморасчетыСПодотчетнымиЛицами.Добавить();
			
			СтрокаДвижений.Организация         	= Организация;
			СтрокаДвижений.ФизЛицо             	= СтруктураШапкиДокумента.ФизЛицо;
			РасчетныйДокументДвижения = ?(ВидОперации = Перечисления.ВидыОперацийСписаниеБезналичныхДенежныхСредств.ПеречислениеДенежныхСредствПодотчетнику, Ссылка.АвансовыйОтчет, Ссылка.РасчетныйДокумент);
			РасчетныйДокументДвижения = ?(ЗначениеЗаполнено(РасчетныйДокументДвижения), РасчетныйДокументДвижения, Ссылка);
			СтрокаДвижений.Валюта              	= СтруктураШапкиДокумента.ВалютаДокумента;
			СтрокаДвижений.РасчетныйДокумент 	= РасчетныйДокументДвижения;
			СтрокаДвижений.СуммаВзаиморасчетов 	= СтрокаПлатеж.СуммаПлатежа;
			СтрокаДвижений.СуммаУпр    		   	= СтрокаПлатеж.СуммаУпр;
			
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.мПериод          = Дата;
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.мТаблицаДвижений = ТаблицаВзаиморасчетыСПодотчетнымиЛицами;
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.ВыполнитьПриход();
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ Тогда
			
			// По регистру "Розничная выручка" - приход
			
			ТаблицаРозничнаяВыручка = Движения.РозничнаяВыручка.ВыгрузитьКолонки();
			
			СтрокаДвижений = ТаблицаРозничнаяВыручка.Добавить();
			
			СтрокаДвижений.РозничнаяТочка = Контрагент;
			СтрокаДвижений.Подразделение  = СтруктураШапкиДокумента.Подразделение;
			СтрокаДвижений.Сумма          = СуммаДокумента;
			
			Движения.РозничнаяВыручка.мПериод          = Дата;
			Движения.РозничнаяВыручка.мТаблицаДвижений = ТаблицаРозничнаяВыручка;
			Движения.РозничнаяВыручка.ВыполнитьПриход();
			
		КонецЕсли;

		//Смартис Лиманчук начало 06.11.2012
		//Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Тогда
		Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" ИЛИ ВидОперацииИмя = "РасходДенежныхСредствПрочееНал" Тогда
		//Смартис Лиманчук окончание 06.11.2012
			
			// Движения по затратным регистрам,
			Если СтруктураШапкиДокумента.ОтражатьПоЗатратам Тогда
				
				ТабЗатрат		= УправлениеЗатратами.СформироватьТаблицуЗатрат();
				СтрокаЗатрат	= ТабЗатрат.Добавить();
				
				СтрокаЗатрат.СтатьяЗатрат			= СтруктураШапкиДокумента.СтатьяЗатрат;
				СтрокаЗатрат.НоменклатурнаяГруппа	= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
				СтрокаЗатрат.Подразделение			= СтруктураШапкиДокумента.ПодразделениеЗатраты;
				СтрокаЗатрат.Заказ					= СтруктураШапкиДокумента.Заказ;
				
				СтрокаЗатрат.Проект					= ТаблицаПлатежейУпр[0].Проект;
				СтрокаЗатрат.Сумма					= ТаблицаПлатежейУпр[0].СуммаУпр;
				СтрокаЗатрат.СпособРаспределенияЗатратНаВыпуск = СтруктураШапкиДокумента.СпособРаспределенияЗатратНаВыпуск;
				
				УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
					СтруктураШапкиДокумента, 
					ТабЗатрат, 
					Перечисления.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете
				);
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры //ПровестиСписаниеДенежныхСредствУпр

Процедура ПровестиПоступлениеДенежныхСредствУпр(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок) Экспорт

	Если СтруктураШапкиДокумента.СуммаДокумента = 0 Тогда
		Возврат;
	КонецЕсли;
	РасчетыСКонтрагентами = СтруктураПараметров.ЕстьРасчетыСКонтрагентами ИЛИ СтруктураПараметров.ЕстьРасчетыПоКредитам;
	ОтраженоВОперУчете    = СтруктураШапкиДокумента.ОтраженоВОперУчете;
	Оплачено              = СтруктураШапкиДокумента.Оплачено;
	Дата         = СтруктураШапкиДокумента.Дата;
	ДатаДвижений = СтруктураПараметров.ДатаДвижений;
	
	Организация         = СтруктураШапкиДокумента.Организация;
	ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредств;
	СуммаДокумента      = СтруктураШапкиДокумента.СуммаДокумента;
	ВалютаДокумента     = СтруктураШапкиДокумента.ВалютаДокумента;
	
	Ссылка              = СтруктураШапкиДокумента.Ссылка;
	БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКасса;
	ВидОперации         = СтруктураШапкиДокумента.ВидОперации;
	Контрагент          = СтруктураШапкиДокумента.Контрагент;
	
	РасчетыВозврат    = УправлениеДенежнымиСредствами.НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(ВидОперации);
	КоэффициентСторно = ?(РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат, -1, 1);
	
	ПоДенежномуЧеку = СтруктураПараметров.Свойство("ПоДенежномуЧеку") 
		И СтруктураПараметров.ПоДенежномуЧеку;
		
	ПоРасчетномуДокументу = СтруктураПараметров.Свойство("ПоРасчетномуДокументу") 
		И СтруктураПараметров.ПоРасчетномуДокументу;

	ДвиженияПоСтатьям             = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоПланируемымПлатежам = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоРезерву             = ТаблицаПлатежейУпр.Скопировать();
	ДвиженияПоКонтрагентам        = ТаблицаПлатежейУпр.Скопировать();
	
	ДвиженияПоПланируемымПлатежам.Свернуть("ДокументПланированияПлатежа,ВключатьВПлатежныйКалендарь,ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВедениеВзаиморасчетов,ВестиПоДокументамРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств,Проект","СуммаПлатежа,СуммаВзаиморасчетов,СуммаПлатежаПлан,СуммаУпр");
	ДвиженияПоКонтрагентам.Свернуть("ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВидДоговора,ВедениеВзаиморасчетов,Проект","СуммаВзаиморасчетов,СуммаУпр,СуммаРегл,СуммаВзаиморасчетовОстаток,СуммаУпрОстаток");
	ДвиженияПоСтатьям.Свернуть("СтатьяДвиженияДенежныхСредств","СуммаПлатежа,СуммаУпр");
	ДвиженияПоРезерву.Свернуть("ДокументПланированияПлатежа","СуммаПлатежа");
	
	Если Оплачено Тогда
		
		// По регистру "Денежные средства в пути"
		Если ВидОперации = Перечисления.ВидыОперацийППВходящее.ПокупкаПродажаВалюты Или ВидОперации = Перечисления.ВидыОперацийПлатежныйОрдерПоступление.ПокупкаПродажаВалюты Тогда
			
			СтруктураГруппаВалют = Новый Структура;
			СтруктураГруппаВалют.Вставить("ВалютаУпрУчета",  глЗначениеПеременной("ВалютаУправленческогоУчета").Код);
			СтруктураГруппаВалют.Вставить("ВалютаДокумента", ВалютаДокумента.Код);
			СтруктураКурсыВалют = УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,?(ДатаДвижений='00010101',Дата,ДатаДвижений));
			
			СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, СтруктураКурсыВалют.ВалютаДокумента,
											 глЗначениеПеременной("ВалютаУправленческогоУчета"), 
			                                 СтруктураКурсыВалют.ВалютаДокументаКурс,
			                                 СтруктураКурсыВалют.ВалютаУпрУчетаКурс, 
			                                 СтруктураКурсыВалют.ВалютаДокументаКратность,
			                                 СтруктураКурсыВалют.ВалютаУпрУчетаКратность);
			
			НаборДвижений   = Движения.ДенежныеСредстваВПути;
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			СтрокаДвижений.Банк     = Контрагент;
			СтрокаДвижений.Валюта   = БанковскийСчетКасса.ВалютаДенежныхСредств;
			СтрокаДвижений.Сумма    = СуммаДокумента;
			СтрокаДвижений.СуммаУпр = СуммаУпр;
			
			НаборДвижений.мПериод              = ДатаДвижений;
			НаборДвижений.мТаблицаДвижений     = ТаблицаДвижений;
			Движения.ДенежныеСредстваВПути.ВыполнитьРасход();
			
		КонецЕсли;
	
		// По регистру "Денежные средства" - приход
		ТаблицаДенежныеСредства	= Движения.ДенежныеСредства.ВыгрузитьКолонки();
		
		СтрокаКурсыВалют=ТаблицаПлатежейУпр[0];
		
		СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			СуммаДокумента, 
			ВалютаДокумента, глЗначениеПеременной("ВалютаУправленческогоУчета"), 
			СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, 
			СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета);
		
		СтрокаДвиженийОстатки = ТаблицаДенежныеСредства.Добавить();
		
		СтрокаДвиженийОстатки.БанковскийСчетКасса = БанковскийСчетКасса;
		СтрокаДвиженийОстатки.Организация 		  = Организация;
		СтрокаДвиженийОстатки.ВидДенежныхСредств  = ВидДенежныхСредств;
		СтрокаДвиженийОстатки.Сумма               = СуммаДокумента;
		СтрокаДвиженийОстатки.СуммаУпр            = СуммаУпр;
		
		Движения.ДенежныеСредства.мПериод          = ДатаДвижений;
		Движения.ДенежныеСредства.мТаблицаДвижений = ТаблицаДенежныеСредства;
		Движения.ДенежныеСредства.ВыполнитьПриход();
		
		// По регистру "Денежные средства к получению" - расход
		
		ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();
		
		Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
			
			СтрокаДвиженийПолучение = ТаблицаДенежныеСредстваКПолучению.Добавить();
			СтрокаДвиженийПолучение.БанковскийСчетКасса = БанковскийСчетКасса;
			СтрокаДвиженийПолучение.Организация 		= Организация;
			СтрокаДвиженийПолучение.ВидДенежныхСредств  = ВидДенежныхСредств;
			Если ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеСредствОтФСС Тогда
				СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
					СуммаДокумента, 
					ВалютаДокумента, глЗначениеПеременной("ВалютаУправленческогоУчета"), 
					СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, 
					СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета);

				СтрокаДвиженийПолучение.Сумма               = СуммаДокумента;
				СтрокаДвиженийПолучение.СуммаУпр            = СуммаУпр;
			Иначе
				СтрокаДвиженийПолучение.Сумма               = СтрокаДвижение.СуммаПлатежа;
				СтрокаДвиженийПолучение.СуммаУпр            = СтрокаДвижение.СуммаУпр;
			КонецЕсли;
			
			Если ПоДенежномуЧеку Тогда
				СтрокаДвиженийПолучение.ДокументПолучения = ?(НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.ДенежныйЧек), Ссылка, СтруктураШапкиДокумента.ДенежныйЧек);
			Иначе
				Если Ссылка.Метаданные().Реквизиты.Найти("РасчетныйДокумент") <> Неопределено Тогда
					Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
						Если ЗначениеЗаполнено(Ссылка.РасчетныйДокумент) Тогда
							СтрокаДвиженийПолучение.ДокументПолучения = Ссылка.РасчетныйДокумент;
						Иначе
							СтрокаДвиженийПолучение.ДокументПолучения = Ссылка;
						КонецЕсли;
					Иначе
						СтрокаДвиженийПолучение.ДокументПолучения = Ссылка;
					КонецЕсли;
				Иначе
					СтрокаДвиженийПолучение.ДокументПолучения = Ссылка;
				КонецЕсли;
			КонецЕсли;
			СтрокаДвиженийПолучение.СтатьяДвиженияДенежныхСредств = СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
			
		КонецЦикла;
		
		Движения.ДенежныеСредстваКПолучению.мПериод          = ДатаДвижений;
		Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
		Движения.ДенежныеСредстваКПолучению.ВыполнитьРасход();
		
		//Смартис Лиманчук начало 06.11.2012
		//Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке И НЕ ПоДенежномуЧеку Тогда
		Если (ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанкеНал) И НЕ ПоДенежномуЧеку Тогда
		//Смартис Лиманчук окончание 06.11.2012
			
			// По регистру "Денежные средства" - расход
			
			ТаблицаДенежныеСредства = Движения.ДенежныеСредства.ВыгрузитьКолонки();
			
			СтрокаДвижений = ТаблицаДенежныеСредства.Добавить();
			
			СтрокаДвижений.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаОтправитель;
			СтрокаДвижений.Организация 		   = Организация;
			СтрокаДвижений.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствОтправитель;
			СтрокаДвижений.Сумма               = СуммаДокумента;
			СтрокаДвижений.СуммаУпр            = СуммаУпр;
			
			Движения.ДенежныеСредства.мПериод          = ДатаДвижений;
			Движения.ДенежныеСредства.мТаблицаДвижений = ТаблицаДенежныеСредства;
			Движения.ДенежныеСредства.ВыполнитьРасход();
			
			// По регистру "Денежные средства к списанию" - расход
			
			ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();
			
			СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
			
			СтрокаДвижений.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаОтправитель;
			СтрокаДвижений.Организация 		   = Организация;
			СтрокаДвижений.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствОтправитель;
			СтрокаДвижений.ДокументСписания    = Ссылка;
			СтрокаДвижений.СтатьяДвиженияДенежныхСредств = ДвиженияПоСтатьям[0].СтатьяДвиженияДенежныхСредств;

			СтрокаДвижений.Сумма               = СуммаДокумента;
			
			Движения.ДенежныеСредстваКСписанию.мПериод          = ДатаДвижений;
			Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
			Движения.ДенежныеСредстваКСписанию.ВыполнитьРасход();

		КонецЕсли;
		
		// Резервируем денежные средства, если приход планировался и по нему размещались заявки
		Для Каждого СтрокаРезерв ИЗ ДвиженияПоРезерву Цикл
			
			Если НЕ СтрокаРезерв.ДокументПланированияПлатежа.Пустая() Тогда
				
				Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
					СтруктураПараметровБлокировки = Новый Структура(
						"ИмяТаблицы", "РазмещениеЗаявокНаРасходованиеСредств");
					СтруктураЗначенийБлокировки   = Новый Структура(
						"ДокументПланирования", СтрокаРезерв.ДокументПланированияПлатежа);
					ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, , Отказ, Заголовок);
					
				КонецЕсли;
			
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	РазмещениеЗаявокНаРасходованиеСредствОстатки.ДокументРезервирования КАК Заявка,
				|	РазмещениеЗаявокНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаОстаток,
				|	РазмещениеЗаявокНаРасходованиеСредствОстатки.ДокументРезервирования.ДатаРасхода КАК ДокументРезервированияДатаРасхода
				|ИЗ
				|	РегистрНакопления.РазмещениеЗаявокНаРасходованиеСредств.Остатки(, 
				|		ДокументПланирования = &ДокументПланирования) КАК РазмещениеЗаявокНаРасходованиеСредствОстатки
				|
				|ДЛЯ ИЗМЕНЕНИЯ
				|	РегистрНакопления.РазмещениеЗаявокНаРасходованиеСредств.Остатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	ДокументРезервированияДатаРасхода";
				
				Запрос.УстановитьПараметр("ДокументПланирования", СтрокаРезерв.ДокументПланированияПлатежа);
				
				Результат = Запрос.Выполнить();
				
				Если НЕ Результат.Пустой() Тогда
					
					СуммаРезерв = СтрокаРезерв.СуммаПлатежа;	
					
					ТаблицаРазмещениеЗаявокНаРасходованиеСредств = Движения.РазмещениеЗаявокНаРасходованиеСредств.ВыгрузитьКолонки();
					
					ТаблицаДенежныеСредстваВРезерве = Движения.ДенежныеСредстваВРезерве.ВыгрузитьКолонки();
					
					Выборка=Результат.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если Выборка.СуммаОстаток >= СуммаРезерв Тогда
							
							СтрокаРазмещение = ТаблицаРазмещениеЗаявокНаРасходованиеСредств.Добавить();
							
							СтрокаРазмещение.ДокументПланирования   = СтрокаРезерв.ДокументПланированияПлатежа;
							СтрокаРазмещение.ДокументРезервирования = Выборка.Заявка;
							СтрокаРазмещение.Сумма = СуммаРезерв;
							
							СтрокаРезерв = ТаблицаДенежныеСредстваВРезерве.Добавить();
							
							СтрокаРезерв.БанковскийСчетКасса    = БанковскийСчетКасса;
							СтрокаРезерв.Организация            = Организация;
							СтрокаРезерв.ВидДенежныхСредств     = ВидДенежныхСредств;
							СтрокаРезерв.ДокументРезервирования = Выборка.Заявка;
							СтрокаРезерв.Сумма = СуммаРезерв;
							
							Прервать;
							
						Иначе
							
							СтрокаРазмещение = ТаблицаРазмещениеЗаявокНаРасходованиеСредств.Добавить();
							
							СтрокаРазмещение.ДокументПланирования   = СтрокаРезерв.ДокументПланированияПлатежа;
							СтрокаРазмещение.ДокументРезервирования = Выборка.Заявка;
							СтрокаРазмещение.Сумма = Выборка.СуммаОстаток;
							
							СтрокаРезерв = ТаблицаДенежныеСредстваВРезерве.Добавить();
							
							СтрокаРезерв.БанковскийСчетКасса    = БанковскийСчетКасса;
							СтрокаРезерв.Организация            = Организация;
							СтрокаРезерв.ВидДенежныхСредств     = ВидДенежныхСредств;
							СтрокаРезерв.ДокументРезервирования = Выборка.Заявка;
							СтрокаРезерв.Сумма = Выборка.СуммаОстаток;
							
							СуммаРезерв = СуммаРезерв - Выборка.СуммаОстаток;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Движения.РазмещениеЗаявокНаРасходованиеСредств.мПериод          = ДатаДвижений;
					Движения.РазмещениеЗаявокНаРасходованиеСредств.мТаблицаДвижений = ТаблицаРазмещениеЗаявокНаРасходованиеСредств;
					Движения.РазмещениеЗаявокНаРасходованиеСредств.ВыполнитьРасход();
					
					Движения.ДенежныеСредстваВРезерве.мПериод          = ДатаДвижений;
					Движения.ДенежныеСредстваВРезерве.мТаблицаДвижений = ТаблицаДенежныеСредстваВРезерве;
					Движения.ДенежныеСредстваВРезерве.ВыполнитьПриход();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтраженоВОперУчете И НЕ ПоРасчетномуДокументу Тогда 
		
		Если НЕ ПоДенежномуЧеку Тогда
			
			// По регистру "Денежные средства к получению" - приход
			ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();
			
			Для Каждого СтрокаДвижение Из ДвиженияПоСтатьям Цикл
				
				СтрокаДвиженийДС = ТаблицаДенежныеСредстваКПолучению.Добавить();
				
				СтрокаДвиженийДС.БанковскийСчетКасса = БанковскийСчетКасса;
				СтрокаДвиженийДС.Организация 		 = Организация;
				СтрокаДвиженийДС.ВидДенежныхСредств  = ВидДенежныхСредств;
				СтрокаДвиженийДС.Сумма               = СтрокаДвижение.СуммаПлатежа;
				СтрокаДвиженийДС.СуммаУпр            = СтрокаДвижение.СуммаУпр;
				СтрокаДвиженийДС.ДокументПолучения   = Ссылка;
				СтрокаДвиженийДС.СтатьяДвиженияДенежныхСредств = СтрокаДвижение.СтатьяДвиженияДенежныхСредств;
				
			КонецЦикла;
			
			Движения.ДенежныеСредстваКПолучению.мПериод          = ?(Оплачено, Мин(ДатаДвижений, Дата), Дата);
			Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
			Движения.ДенежныеСредстваКПолучению.ВыполнитьПриход();
			
			//Смартис Лиманчук начало 06.11.2012
			//Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке Тогда
			Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанкеНал Тогда
			//Смартис Лиманчук окончание 06.11.2012
			
				// По регистру "Денежные средства к списанию" - приход
				
				ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();
				
				СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
				
				СтрокаДвижений.БанковскийСчетКасса = СтруктураПараметров.БанковскийСчетКассаОтправитель;
				СтрокаДвижений.Организация 		   = Организация;
				СтрокаДвижений.ВидДенежныхСредств  = СтруктураПараметров.ВидДенежныхСредствОтправитель;
				СтрокаДвижений.ДокументСписания    = Ссылка;
				СтрокаДвижений.СтатьяДвиженияДенежныхСредств = ДвиженияПоСтатьям[0].СтатьяДвиженияДенежныхСредств;
				СтрокаДвижений.Сумма               = СуммаДокумента;
				
				Движения.ДенежныеСредстваКСписанию.мПериод          = Дата;
				Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
				Движения.ДенежныеСредстваКСписанию.ВыполнитьПриход();
				
			КонецЕсли;
			
		КонецЕсли;
				
		// По регистру "Планируемые поступления денежных средств" - расход
		
		ТаблицаПланируемыеПоступленияДенежныхСредств = Движения.ПланируемыеПоступленияДенежныхСредств.ВыгрузитьКолонки();
		
		// По регистру "Расчеты с контрагентами"
		ТаблицаРасчетыСКонтрагентами = Движения.РасчетыСКонтрагентами.ВыгрузитьКолонки();
		
		// По строкам табличной части
		Для Каждого СтрокаПлатеж ИЗ ДвиженияПоПланируемымПлатежам Цикл
			
			ЕстьПланПоступление = Ложь;
			ЕстьРасчеты         = Ложь;
			
			ТекущаяСделка = УправлениеВзаиморасчетами.ОпределитьСделку(СтрокаПлатеж, СтрокаПлатеж);
			
			Если НЕ СтрокаПлатеж.ДокументПланированияПлатежа.Пустая() Тогда
				
				СуммаПлатежа = СтрокаПлатеж.СуммаПлатежаПлан;
				
				СтрокаДвиженийЗаявки = ТаблицаПланируемыеПоступленияДенежныхСредств.Добавить();
				
				СтрокаДвиженийЗаявки.СуммаУпр            			= СтрокаПлатеж.СуммаУпр;
				СтрокаДвиженийЗаявки.Сумма                			= СтрокаПлатеж.СуммаПлатежаПлан;
				СтрокаДвиженийЗаявки.СуммаВзаиморасчетов  			= СтрокаПлатеж.СуммаВзаиморасчетов;
				СтрокаДвиженийЗаявки.ДокументПланирования 			= СтрокаПлатеж.ДокументПланированияПлатежа;
				СтрокаДвиженийЗаявки.СтатьяДвиженияДенежныхСредств 	= СтрокаПлатеж.СтатьяДвиженияДенежныхСредств;
				СтрокаДвиженийЗаявки.Проект						 	= СтрокаПлатеж.Проект;
				СтрокаДвиженийЗаявки.ДоговорКонтрагента				= СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвиженийЗаявки.Организация					= Организация;
				СтрокаДвиженийЗаявки.Контрагент						= Контрагент;
				СтрокаДвиженийЗаявки.Сделка							= СтрокаПлатеж.Сделка;
				Если СтрокаПлатеж.ВестиПоДокументамРасчетовСКонтрагентом Тогда
					СтрокаДвиженийЗаявки.ДокументРасчетовСКонтрагентом = ?(НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДокументРасчетовСКонтрагентом),
						Ссылка, СтрокаПлатеж.ДокументРасчетовСКонтрагентом);
				КонецЕсли;
				
				ЕстьПланПоступление = Истина;
				
				Если НЕ СтрокаПлатеж.ВключатьВПлатежныйКалендарь Тогда // Документ не был проведен по оперативным взаиморасчетам
					ЕстьРасчеты = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если (НЕ ЕстьПланПоступление ИЛИ ЕстьРасчеты) И РасчетыСКонтрагентами Тогда // Первое упоминание о планируемом платеже в системе
				
				// По регистру "Расчеты с контрагентами"
				
				СтрокаДвиженийКонтрагенты = ТаблицаРасчетыСКонтрагентами.Добавить();
				
				СтрокаДвиженийКонтрагенты.ДоговорКонтрагента  = СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвиженийКонтрагенты.Контрагент  		  = Контрагент;
				СтрокаДвиженийКонтрагенты.Организация  	   	  = Организация;
				СтрокаДвиженийКонтрагенты.РасчетыВозврат      = РасчетыВозврат;
				СтрокаДвиженийКонтрагенты.Сделка              = ?(НЕ ЗначениеЗаполнено(СтрокаПлатеж.Сделка), ТекущаяСделка,СтрокаПлатеж.Сделка);
				СтрокаДвиженийКонтрагенты.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов * КоэффициентСторно;
				СтрокаДвиженийКонтрагенты.СуммаУпр            = СтрокаПлатеж.СуммаУпр * КоэффициентСторно;
				СтрокаДвиженийКонтрагенты.Период			  = Дата;
				СтрокаДвиженийКонтрагенты.ВидДвижения		  = ?(КоэффициентСторно = 1, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
				СтрокаДвиженийКонтрагенты.Активность		  = Истина;
				
				ЕстьРасчеты = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам 
				ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоПлатежнымКартам
				ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоБанковскимКредитам
				ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоБанковскимКредитам)
			И СтруктураШапкиДокумента.СуммаУслуг <> 0 Тогда
			
			СуммаУпрУслуга = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
				СтруктураШапкиДокумента.СуммаУслуг, 
				ВалютаДокумента, глЗначениеПеременной("ВалютаУправленческогоУчета"), 
				СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, 
				СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета);
			
			СтрокаДвиженийКонтрагенты = ТаблицаРасчетыСКонтрагентами.Добавить();
			
			СтрокаДвиженийКонтрагенты.ВидДвижения		  = ВидДвиженияНакопления.Расход;
			СтрокаДвиженийКонтрагенты.Активность		  = Истина;
			СтрокаДвиженийКонтрагенты.Период			  = Дата;
			СтрокаДвиженийКонтрагенты.Организация         = Организация;
			СтрокаДвиженийКонтрагенты.Контрагент          = Контрагент;
			СтрокаДвиженийКонтрагенты.ДоговорКонтрагента  = ДвиженияПоКонтрагентам[0].ДоговорКонтрагента;
			СтрокаДвиженийКонтрагенты.РасчетыВозврат      = РасчетыВозврат;
			СтрокаДвиженийКонтрагенты.СуммаВзаиморасчетов = СтруктураШапкиДокумента.СуммаУслуг;
			СтрокаДвиженийКонтрагенты.СуммаУпр            = СуммаУпрУслуга;
					
		КонецЕсли;
		
		Если ТаблицаПланируемыеПоступленияДенежныхСредств.Количество() > 0 Тогда
			
			Движения.ПланируемыеПоступленияДенежныхСредств.мПериод          = Дата;
			Движения.ПланируемыеПоступленияДенежныхСредств.мТаблицаДвижений = ТаблицаПланируемыеПоступленияДенежныхСредств;
			Движения.ПланируемыеПоступленияДенежныхСредств.ВыполнитьРасход();
			
		КонецЕсли;
		
		Если ТаблицаРасчетыСКонтрагентами.Количество() > 0 Тогда
			
			Движения.РасчетыСКонтрагентами.мТаблицаДвижений	= ТаблицаРасчетыСКонтрагентами;
			Движения.РасчетыСКонтрагентами.ВыполнитьДвижения();
			
		КонецЕсли;
		
	КонецЕсли;

	Если Оплачено И ОтраженоВОперУчете Тогда  // Проводим по фактическим взаиморасчетам
			
		// По регистру "Движения денежных средств"
		ТаблицаДвиженияДенежныхСредств = Движения.ДвиженияДенежныхСредств.ВыгрузитьКолонки();
			
		ДвиженияДенежныхСредств = ТаблицаПлатежейУпр.Скопировать();
			
		Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
				
			ДвиженияДенежныхСредств.Свернуть("ДокументПланированияПлатежа,ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВестиПоДокументамРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств,Проект",
				"СуммаПлатежа,СуммаУпр");
			ДвиженияДенежныхСредств.Колонки["СуммаПлатежа"].Имя = "Сумма";
				
			УправлениеПроектами.ОтразитьДвиженияПоПроектам(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств, Неопределено, Дата, "ДенежныеСредстваПоступление", Ссылка);
				
		Иначе
				
			ДвиженияДенежныхСредств.Свернуть("ДокументПланированияПлатежа,ДоговорКонтрагента,Сделка,ДокументРасчетовСКонтрагентом,ВестиПоДокументамРасчетовСКонтрагентом,СтатьяДвиженияДенежныхСредств",
				"СуммаПлатежа,СуммаУпр");
			ДвиженияДенежныхСредств.Колонки["СуммаПлатежа"].Имя = "Сумма";
				
			Для каждого СтрокаПлатеж Из ДвиженияДенежныхСредств Цикл
				УправлениеПроектами.ОпределитьРасчетныйДокумент(СтрокаПлатеж,Ссылка);
			КонецЦикла; 
				
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств);
				
		КонецЕсли;
			
		// Недостающие поля.
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(ВидДенежныхСредств,  "ВидДенежныхСредств");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(БанковскийСчетКасса, "БанковскийСчетКасса");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация,         "Организация");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Ссылка,              "ДокументДвижения");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Контрагент,          "Контрагент");
		ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Перечисления.ВидыДвиженийПриходРасход.Приход, "ПриходРасход");
			
		Движения.ДвиженияДенежныхСредств.мПериод          = ДатаДвижений;
		Движения.ДвиженияДенежныхСредств.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
		//Смартис Лиманчук начало 03.08.2012
		//Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения();
		Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения(Отказ);
		//Смартис Лиманчук окончание 03.08.2012
		
		//Смартис Лиманчук начало 06.11.2012
		//Если ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке И НЕ ПоДенежномуЧеку Тогда
		Если (ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанкеНал) И НЕ ПоДенежномуЧеку Тогда
		//Смартис Лиманчук окончание 06.11.2012
				
			// По регистру "Движения денежных средств"
			
			ТаблицаДвиженияДенежныхСредств = Движения.ДвиженияДенежныхСредств.ВыгрузитьКолонки();
				
			// Заполним таблицу движений.
			Если СтруктураШапкиДокумента.ВедениеУчетаПоПроектам Тогда
				УправлениеПроектами.ОтразитьДвиженияПоПроектам(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств, Неопределено, Дата, "ДенежныеСредства");
			Иначе
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДвиженияДенежныхСредств, ТаблицаДвиженияДенежныхСредств);
			КонецЕсли;
				
			// Недостающие поля.
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(СтруктураПараметров.ВидДенежныхСредствОтправитель,  "ВидДенежныхСредств");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Перечисления.ВидыДвиженийПриходРасход.Расход,       "ПриходРасход");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(СтруктураПараметров.БанковскийСчетКассаОтправитель, "БанковскийСчетКасса");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Организация,                                        "Организация");
			ТаблицаДвиженияДенежныхСредств.ЗаполнитьЗначения(Ссылка,                                             "ДокументДвижения");
				
			Движения.ДвиженияДенежныхСредств.мПериод          = Дата;
			Движения.ДвиженияДенежныхСредств.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
			//Смартис Лиманчук начало 03.08.2012
			//Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения();
			Движения.ДвиженияДенежныхСредств.ВыполнитьДвижения(Отказ);
			//Смартис Лиманчук окончание 03.08.2012
				
		КонецЕсли;
			
		Если РасчетыСКонтрагентами Тогда
				
			// По регистру "Взаиморасчеты с контрагентами" - расход при возврате, иначе приход
			
			ТаблицаВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСКонтрагентами.ВыгрузитьКолонки();
			
			Для Каждого СтрокаПлатеж ИЗ ДвиженияПоКонтрагентам Цикл
					
				ТекущаяСделка = УправлениеВзаиморасчетами.ОпределитьСделку(СтрокаПлатеж, СтрокаПлатеж);
					
				СтрокаДвижений = ТаблицаВзаиморасчетыСКонтрагентами.Добавить();
				
				СтрокаДвижений.ДоговорКонтрагента  = СтрокаПлатеж.ДоговорКонтрагента;
				СтрокаДвижений.Контрагент  		   = Контрагент;
				СтрокаДвижений.Организация  	   = Организация;
				СтрокаДвижений.Сделка              = ТекущаяСделка;
				СтрокаДвижений.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов * КоэффициентСторно;
				СтрокаДвижений.СуммаУпр            = СтрокаПлатеж.СуммаУпр * КоэффициентСторно;
				
			КонецЦикла;
				
			Если (ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам 
					ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоПлатежнымКартам
					ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоБанковскимКредитам
					ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоБанковскимКредитам)
				И СтруктураШапкиДокумента.СуммаУслуг <> 0 Тогда
				
				СуммаУпрУслуга = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
					СтруктураШапкиДокумента.СуммаУслуг, 
					ВалютаДокумента, глЗначениеПеременной("ВалютаУправленческогоУчета"), 
					СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, 
					СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета);
				
				СтрокаДвижений = ТаблицаВзаиморасчетыСКонтрагентами.Добавить();
				
				СтрокаДвижений.ДоговорКонтрагента = ДвиженияПоКонтрагентам[0].ДоговорКонтрагента;
				СтрокаДвижений.Организация        = Организация;
				СтрокаДвижений.Контрагент         = Контрагент;
				
				СтрокаДвижений.СуммаВзаиморасчетов = СтруктураШапкиДокумента.СуммаУслуг;
				СтрокаДвижений.СуммаУпр            = СуммаУпрУслуга;
				
				
				Если ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам 
					ИЛИ ВидОперации = Перечисления.ВидыОперацийППВходящее.ПоступлениеОплатыПоПлатежнымКартам Тогда
				
					// Движения по затратным регистрам
					
					ХарактерЗатрат = СтруктураШапкиДокумента.СтатьяЗатрат.ХарактерЗатрат;
					
					Если ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы
					  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.РасходыНаСбыт
					  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы
					  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы
					  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.АдминистративныеРасходы 
					  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.Прочие Тогда
					  
					  Сообщить("При указании статьи затрат с характером затрат " + ХарактерЗатрат + " движения в регистре Затраты (упр. учет) не будут отражены", СтатусСообщения.Важное);
					  
					Иначе  
						
						ТабЗатрат		= УправлениеЗатратами.СформироватьТаблицуЗатрат();
						СтрокаЗатрат	= ТабЗатрат.Добавить();
						
						СтрокаЗатрат.СтатьяЗатрат			= СтруктураШапкиДокумента.СтатьяЗатрат;
						СтрокаЗатрат.НоменклатурнаяГруппа	= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
						СтрокаЗатрат.Подразделение			= СтруктураШапкиДокумента.ПодразделениеЗатраты;
						СтрокаЗатрат.Заказ					= СтруктураШапкиДокумента.Заказ;
						
						СтрокаЗатрат.Проект					= СтруктураШапкиДокумента.Проект;
						СтрокаЗатрат.Сумма					= СуммаУпрУслуга;
						
						УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
							СтруктураШапкиДокумента, 
							ТабЗатрат, 
							Перечисления.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете
						);
				
					КонецЕсли;	
				КонецЕсли;		
				
			КонецЕсли;
			
			Движения.ВзаиморасчетыСКонтрагентами.мПериод          = Дата;
			Движения.ВзаиморасчетыСКонтрагентами.мТаблицаДвижений = ТаблицаВзаиморасчетыСКонтрагентами;
			Если КоэффициентСторно = 1 Тогда
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход();
			Иначе
				Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
			КонецЕсли;
			
		//Смартис Лиманчук начало 01.11.2012
		//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
		ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетникомНал) Тогда
	    //Смартис Лиманчук окончание 01.11.2012
				
			СтрокаПлатеж=ДвиженияПоКонтрагентам[0];
				
			// По регистру "Взаиморасчеты с подотчетными лицами" - расход
			
			ТаблицаВзаиморасчетыСПодотчетнымиЛицами = Движения.ВзаиморасчетыСПодотчетнымиЛицами.Выгрузить();
				
			СтрокаДвижений = ТаблицаВзаиморасчетыСПодотчетнымиЛицами.Добавить();
			СтрокаДвижений.Организация         = Организация;
			СтрокаДвижений.ФизЛицо             = Контрагент;
			Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.РасчетныйДокумент) Тогда
				СтрокаДвижений.РасчетныйДокумент = Ссылка;
			Иначе
				СтрокаДвижений.РасчетныйДокумент = СтруктураШапкиДокумента.РасчетныйДокумент;
			КонецЕсли;
			СтрокаДвижений.Валюта              = СтруктураШапкиДокумента.ВалютаВзаиморасчетовПодотчетника;
			СтрокаДвижений.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаВзаиморасчетов;
			СтрокаДвижений.СуммаУпр            = СтрокаПлатеж.СуммаУпр;
				
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.мПериод          = Дата;
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.мТаблицаДвижений = ТаблицаВзаиморасчетыСПодотчетнымиЛицами;
			Движения.ВзаиморасчетыСПодотчетнымиЛицами.ВыполнитьРасход();
				
		ИначеЕсли ПоДенежномуЧеку И СтруктураШапкиДокумента.ДенежныйЧек.ВыплатаЗаработнойПлаты.Количество() > 0 Тогда
				
			// Резервируем наличные ДС для выплаты заработной платы
			// По регистру "Денежные средства к списанию"
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ПриходныйКассовыйОрдер.Организация              КАК Организация,
			|	ПриходныйКассовыйОрдер.Касса                    КАК БанковскийСчетКасса,
			|	ДенежныйЧекВыплатаЗаработнойПлаты.Ведомость     КАК ДокументСписания,
			|	ДенежныйЧекВыплатаЗаработнойПлаты.СуммаКВыплате КАК Сумма,
			|	ДенежныйЧекВыплатаЗаработнойПлаты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	&ВидДенежныхСредств                             КАК ВидДенежныхСредств
			|ИЗ
			|	Документ.ДенежныйЧек.ВыплатаЗаработнойПлаты КАК ДенежныйЧекВыплатаЗаработнойПлаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
			|		ПО ДенежныйЧекВыплатаЗаработнойПлаты.Ссылка = ПриходныйКассовыйОрдер.ДенежныйЧек
			|
			|ГДЕ
			|	ПриходныйКассовыйОрдер.Ссылка = &Ссылка";
				
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ВидДенежныхСредств", ВидДенежныхСредств);
				
			ТаблицаДенежныеСредстваКСписанию = Запрос.Выполнить().Выгрузить();
				
			Движения.ДенежныеСредстваКСписанию.мПериод          = Дата;
			Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
			Движения.ДенежныеСредстваКСписанию.ВыполнитьПриход();
			
		//Смартис Лиманчук начало 01.11.2012
		//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручкаНал Тогда
		//Смартис Лиманчук окончание 01.11.2012 
				
			// По регистру "Розничная выручка"
			
			ТаблицаРозничнаяВыручка = Движения.РозничнаяВыручка.Выгрузить();
				
			СтрокаДвижений = ТаблицаРозничнаяВыручка.Добавить();
			
			СтрокаДвижений.РозничнаяТочка  = Контрагент;
			СтрокаДвижений.Подразделение   = СтруктураШапкиДокумента.Подразделение;
			СтрокаДвижений.Сумма           = СуммаДокумента;
				
			Движения.РозничнаяВыручка.мПериод          = Дата;
			Движения.РозничнаяВыручка.мТаблицаДвижений = ТаблицаРозничнаяВыручка;
			Движения.РозничнаяВыручка.ВыполнитьРасход();
				
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймамСРаботниками Тогда
			
			СтруктураДолг = СтруктураПараметров.СтруктураДолг;
				
			Если СтруктураШапкиДокумента.РасчетныйДокумент.ОтражатьВБухгалтерскомУчете Тогда 
				
				// По регистру регламентированных расчетов с сотрудниками по займам - расход
					
				ТаблицаПогашениеЗаймовРаботникамиОрганизаций = Движения.ПогашениеЗаймовРаботникамиОрганизаций.Выгрузить();
					
				СтрокаДвижений = ТаблицаПогашениеЗаймовРаботникамиОрганизаций.Добавить();
				
				СтрокаДвижений.Организация  = Организация;
				СтрокаДвижений.Сотрудник    = Контрагент;
				СтрокаДвижений.ДоговорЗайма = СтруктураШапкиДокумента.РасчетныйДокумент;
					
				СуммаРасчетов = ДвиженияПоКонтрагентам[0].СуммаВзаиморасчетов;
					
				Если СтруктураДолг.Проценты < СуммаРасчетов Тогда
					СтрокаДвижений.Проценты     = СтруктураДолг.Проценты;
					СтрокаДвижений.ОсновнойДолг = СуммаРасчетов - СтруктураДолг.Проценты;
				Иначе
					СтрокаДвижений.Проценты     = СуммаРасчетов;
					СтрокаДвижений.ОсновнойДолг = 0;
				КонецЕсли;
					
				Движения.ПогашениеЗаймовРаботникамиОрганизаций.мПериод          = Дата;
				Движения.ПогашениеЗаймовРаботникамиОрганизаций.мТаблицаДвижений = ТаблицаПогашениеЗаймовРаботникамиОрганизаций;
				Движения.ПогашениеЗаймовРаботникамиОрганизаций.ВыполнитьРасход();
					
			Иначе 
				
				// По регистру управленческих расчетов с сотрудниками по займам - расход
					
				ТаблицаПогашениеЗаймовРаботниками = Движения.ПогашениеЗаймовРаботниками.Выгрузить();
					
				СтрокаДвижений = ТаблицаПогашениеЗаймовРаботниками.Добавить();
				
				СтрокаДвижений.ФизЛицо      = Контрагент;
				СтрокаДвижений.ДоговорЗайма = СтруктураШапкиДокумента.РасчетныйДокумент;
					
				СуммаРасчетов = ДвиженияПоКонтрагентам[0].СуммаВзаиморасчетов;
					
				Если СтруктураДолг.Проценты < СуммаРасчетов Тогда
					СтрокаДвижений.Проценты     = СтруктураДолг.Проценты;
					СтрокаДвижений.ОсновнойДолг = СуммаРасчетов - СтруктураДолг.Проценты;
				Иначе
					СтрокаДвижений.Проценты     = СуммаРасчетов;
					СтрокаДвижений.ОсновнойДолг = 0;
				КонецЕсли;
					
				Движения.ПогашениеЗаймовРаботниками.мПериод          = Дата;
				Движения.ПогашениеЗаймовРаботниками.мТаблицаДвижений = ТаблицаПогашениеЗаймовРаботниками;
				Движения.ПогашениеЗаймовРаботниками.ВыполнитьРасход();
					
			КонецЕсли;
			
		//Смартис Лиманчук начало 05.11.2012
		//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствРаботником Тогда
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствРаботником ИЛИ ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствРаботникомНал Тогда
	    //Смартис Лиманчук окончание 05.11.2012
			
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
				
				// Определяем, ведется ли учет задолженности в разрезе периодов её возникновения
				УчетЗадолженностиПоМесяцам = Истина;

				Если УчетЗадолженностиПоМесяцам Тогда
					
					Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
							
						СтруктураПараметровБлокировки = Новый Структура(
							"ИмяТаблицы", "ВзаиморасчетыСРаботникамиОрганизаций");
							
						СтруктураЗначенийБлокировки   = Новый Структура(
							"Период,Организация,Сотрудник", Дата, Организация, Контрагент);
							
						ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, , Отказ, Заголовок);
						
					КонецЕсли;
				
					Запрос = Новый Запрос;
					
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.ПериодВзаиморасчетов,
					|	-ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток КАК Остаток
					|ИЗ
					|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
					|			&Дата,
					|			Организация = &Организация
					|				И Сотрудник = &Сотрудник) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
					|ГДЕ
					|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток < 0
					|
					|ДЛЯ ИЗМЕНЕНИЯ
					|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки
					|
					|УПОРЯДОЧИТЬ ПО
					|	ПериодВзаиморасчетов";
				
					Запрос.УстановитьПараметр("Дата",        Дата);
					Запрос.УстановитьПараметр("Организация", Организация);
					Запрос.УстановитьПараметр("Сотрудник",     Контрагент);
				
					ВыборкаОстатков = Запрос.Выполнить().Выбрать();
				
	 				СуммаКПогашению = СуммаДокумента;
				
					Пока ВыборкаОстатков.СледующийПоЗначениюПоля("ПериодВзаиморасчетов") Цикл 
						
						СтрокаДвижений = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
						
						СтрокаДвижений.Период      = Дата;
						СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
						
						СтрокаДвижений.Сотрудник            = Контрагент;
						СтрокаДвижений.СчетУчета            = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
						СтрокаДвижений.Организация          = Организация;
						СтрокаДвижений.ПериодВзаиморасчетов = ВыборкаОстатков.ПериодВзаиморасчетов;
						СтрокаДвижений.СпособВыплаты        = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу; 
						
						СуммаВзаиморасчетов                = Мин(ВыборкаОстатков.Остаток, СуммаКПогашению);
						СтрокаДвижений.СуммаВзаиморасчетов = - СуммаВзаиморасчетов;
						
						СуммаКПогашению = СуммаКПогашению - СуммаВзаиморасчетов;
						
						Если СуммаКПогашению = 0 Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если СуммаКПогашению > 0 Тогда
						
						СтрокаДвижений = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
						
						СтрокаДвижений.Период      = Дата;
						СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
						
						СтрокаДвижений.Сотрудник            = Контрагент;
						СтрокаДвижений.СчетУчета            = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
						СтрокаДвижений.Организация          = Организация;
						СтрокаДвижений.ПериодВзаиморасчетов = НачалоМесяца(Дата);
						СтрокаДвижений.СпособВыплаты        = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу; 
						
						СтрокаДвижений.СуммаВзаиморасчетов = - СуммаКПогашению;
						
					КонецЕсли;
					
				ИначеЕсли СуммаДокумента > 0 Тогда 
					
					СтрокаДвижений = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
					
					СтрокаДвижений.Период      = Дата;
					СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
					
					СтрокаДвижений.Сотрудник     = Контрагент;
					СтрокаДвижений.СчетУчета     = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
					СтрокаДвижений.Организация   = Организация;
					СтрокаДвижений.СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу; 
					
					СтрокаДвижений.СуммаВзаиморасчетов = - СуммаДокумента;
					
				КонецЕсли;
				
			Иначе
				
				СтрокаДвижений = Движения.ВзаиморасчетыСРаботниками.Добавить();
				
				СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
				СтрокаДвижений.Период      = Дата;
				СтрокаДвижений.ФизЛицо 	   = Контрагент.ФизЛицо;
				СтрокаДвижений.СуммаУпр    = - ДвиженияПоКонтрагентам[0].СуммаВзаиморасчетов;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //ПровестиПоступлениеДенежныхСредствУпр

Функция ПолучитьВалРасчетныйСчетОрганизации(ДокументОбъект, мВалютаРегламентированногоУчета)
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено Тогда
		Если ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета И ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств <> ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	БанковскиеСчета.Ссылка КАК Счет
						   |ИЗ
						   |	Справочник.БанковскиеСчета КАК БанковскиеСчета
						   |ГДЕ
						   |	БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
						   |	И БанковскиеСчета.Владелец = &Организация
						   |
						   |СГРУППИРОВАТЬ ПО
						   |	БанковскиеСчета.Ссылка";
			
			Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
			Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Счет;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // ПолучитьВалРасчетныйСчетОрганизации()

// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)

	Ссылка = СтруктураШапкиДокумента.Ссылка;

	Если Ссылка.ОтражатьВБухгалтерскомУчете Тогда
		
		мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(КонецМесяца(Ссылка.Дата), Ссылка.Организация, Заголовок);
		
		Если НЕ Отказ Тогда
			СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль"             , мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
			СтруктураШапкиДокумента.Вставить("ЕстьНДС"                        , мУчетнаяПолитикаНУ.ЕстьНДС);
			СтруктураШапкиДокумента.Вставить("ЕстьЕдиныйНалог"                , мУчетнаяПолитикаНУ.ЕстьЕдиныйНалог);
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиРегл()

Процедура ПровестиСписаниеДенежныхСредствРегл(
	СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок) Экспорт
	
	Ссылка								= СтруктураШапкиДокумента.Ссылка;
	Организация							= СтруктураШапкиДокумента.Организация;
	Контрагент							= СтруктураШапкиДокумента.Контрагент;
	ВидОперации							= СтруктураШапкиДокумента.ВидОперации;
	
	ВидОперацииИмя						= Строка(ВидОперации);
	Для каждого ЗначениеПеречисления Из ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = ВидОперацииИмя Тогда
			ВидОперацииИмя				= ЗначениеПеречисления.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВалютаДокумента						= СтруктураШапкиДокумента.ВалютаДокумента;
	КурсДокумента						= СтруктураШапкиДокумента.КурсВалютыДокумента;
	КратностьДокумента					= СтруктураШапкиДокумента.КратностьВалютыДокумента;
	
	ЕстьРасчетыСКонтрагентами			= мСтруктураПараметровДенежныхСредств.ЕстьРасчетыСКонтрагентами;
	ЕстьРасчетыПоКредитам				= мСтруктураПараметровДенежныхСредств.ЕстьРасчетыПоКредитам;
	РежимПроведения						= мСтруктураПараметровДенежныхСредств.РежимПроведения;
	ДатаДвижений						= мСтруктураПараметровДенежныхСредств.ДатаДвижений;
	
	СтруктураШапкиДокумента.Вставить("ДатаДвижений",ДатаДвижений);

	ВалютаРег							= глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ДанныеОВалюте						= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРег, ДатаДвижений);
	
	СчетОрганизации						= мСтруктураПараметровДенежныхСредств.СчетОрганизации;
	СчетУчетаРасчетовСКонтрагентом		= Ссылка.СчетУчетаРасчетовСКонтрагентом;
	Оплачено							= мСтруктураПараметровДенежныхСредств.Оплачено;
	ЭтотОбъект							= Ссылка.ПолучитьОбъект();
	
	СуммаДокумента						= Ссылка.СуммаДокумента;
	РасшифровкаПлатежа					= Ссылка.РасшифровкаПлатежа;
	фКассоваяОперация					= мСтруктураПараметровДенежныхСредств.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	
	
	Если Не Оплачено Тогда
		Возврат;
	Конецесли;
	СтруктураДвижений 	   = Новый Структура();

	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если НЕ (Ссылка.ОтражатьВБухгалтерскомУчете И (Оплачено ИЛИ НЕ Ссылка.ОтраженоВОперУчете)) Тогда
		Если Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(КонецМесяца(ДатаДвижений), Организация, , Заголовок);
			Если мУчетнаяПолитикаБУ.ЕстьЕдиныйНалог Тогда	
				ДвиженияПоЕдиномуНалогуРегл(СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, СтруктураДвижений);
			КонецЕсли;
		КонецЕсли;		
		Возврат;
	КонецЕсли;
	//ИЗМЕНЕНО Верескул Игорь(Начало 12.04.2018
    //Если Не Ссылка.ОтраженоВОперУчете Тогда
    //	Возврат;
    //КонецЕсли;
    //Окончание)Верескул Игорь 
	//ИЗМЕНЕНО Верескул Игорь(Начало 14.12.2020
	Если Ссылка.Дата >= Дата("20210101") Тогда
		НаличнаяОрганизация = Константы.НПТ.Получить();
	Иначе
		НаличнаяОрганизация = Константы.КрафтКолор.Получить();
	КонецЕсли;
	
	// Бухгалтерские проводки документа
	Если Ссылка.ОтражатьВБухгалтерскомУчете И Оплачено Тогда
		
		СтруктураДвижений.Вставить("ПроводкиБУ", Движения.Хозрасчетный);
		
		ВалютаСчета = СчетОрганизации.ВалютаДенежныхСредств;
		
		Если ((ВалютаСчета = ВалютаРег) ИЛИ (НЕ ЗначениеЗаполнено(ВалютаСчета))) Тогда
			РасчетыВВалюте = Ложь;
		Иначе
			РасчетыВВалюте = Истина;
		КонецЕсли;
		
		Если фКассоваяОперация Тогда
			СчетУчетаДенежныхСредств = ?(РасчетыВВалюте, ПланыСчетов.Хозрасчетный.КассаВИностраннойВалюте, ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте);
		Иначе
			МетаданныеДокумента = Ссылка.Метаданные();
			Если МетаданныеДокумента.Реквизиты.Найти("СчетУчетаДенежныхСредств") <> Неопределено Тогда
				СчетУчетаДенежныхСредств = Ссылка.СчетУчетаДенежныхСредств;
			Иначе
				СчетУчетаДенежныхСредств = ОпределитьСчетУчетаДенежныхСредств(СчетОрганизации, ВалютаРег, РасчетыВВалюте);
			КонецЕсли;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеЗП Тогда
			
			СпособОплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
			ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.Выплачено;
			ПроведениеРасчетов.ВыполнитьДвиженияПоЗарплате(Ссылка, Движения, СтруктураДвижений.ПроводкиБУ, СчетУчетаДенежныхСредств, СпособОплаты, ВыплаченностьЗарплаты, СчетОрганизации, , ?(ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям, Неопределено, Контрагент), ?(фКассоваяОперация, СчетОрганизации, Неопределено));
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Или ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаДепонентов Тогда
			
			СпособОплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу;
			ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.Выплачено;
			ПроведениеРасчетов.ВыполнитьДвиженияПоЗарплате(Ссылка, Движения, СтруктураДвижений.ПроводкиБУ, СчетУчетаДенежныхСредств, СпособОплаты, ВыплаченностьЗарплаты, СчетОрганизации, , Неопределено, СчетОрганизации);
			
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику Тогда
			
			СпособОплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу;
			ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.Выплачено;
			ПроведениеРасчетов.ВыполнитьДвиженияПоЗарплате(Ссылка, Движения, СтруктураДвижений.ПроводкиБУ, СчетУчетаДенежныхСредств, СпособОплаты, ВыплаченностьЗарплаты, СчетОрганизации, Контрагент, Контрагент, СчетОрганизации);
			
		ИначеЕсли ЕстьРасчетыСКонтрагентами Тогда
			
			СтруктураПараметровДДС = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаСтруктурыПараметровДляДвиженияДенег(Ссылка, ВалютаРег, Заголовок, СчетУчетаДенежныхСредств, , СтруктураШапкиДокумента);
			
			СтруктураДвижений.Вставить("ПроводкиБУ", СтруктураДвижений.ПроводкиБУ);
			СтруктураДвижений.Вставить("ПриобретенияНалоговыйУчет", Движения.ПриобретенияНалоговыйУчет);
			СтруктураДвижений.Вставить("ПродажиНалоговыйУчет", Движения.ПродажиНалоговыйУчет);
			
			Если Не (СтруктураПараметровДДС = Ложь) тогда
				БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(СтруктураПараметровДДС,СтруктураДвижений,ВалютаРег,РежимПроведения,ЭтотОбъект, Отказ, Ложь);
				Если РасчетыВВалюте тогда
					БухгалтерскийУчетРасчетовСКонтрагентами.ВзаиморасчетыВВалютеОплата(СтруктураПараметровДДС,ВалютаРег,РежимПроведения,СтруктураДвижений,ЭтотОбъект,Отказ);
				КонецЕсли;
			Иначе
				БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенегПрочийРасход(ЭтотОбъект, РасчетыВВалюте, СчетУчетаДенежныхСредств, КурсДокумента, КратностьДокумента, СтруктураДвижений);
			Конецесли;
			
		ИначеЕсли ВидОперацииИмя = "ПеречислениеДенежныхСредствПодотчетнику" 
			Или   ВидОперацииИмя = "ВыдачаДенежныхСредствПодотчетнику" 
			//Смартис Лиманчук начало 01.11.2012
			Или   ВидОперацииИмя = "ВыдачаДенежныхСредствПодотчетникуНал" 
			//Смартис Лиманчук окончание 01.11.2012
			Или   ВидОперацииИмя = "РасходДенежныхСредствПрочее" 
			//Смартис Лиманчук начало 06.11.2012
			Или   ВидОперацииИмя = "РасходДенежныхСредствПрочееНал" 
			//Смартис Лиманчук окончание 06.11.2012
			Или   ВидОперацииИмя = "ВзносНаличнымиВБанк"
			Или   ВидОперацииИмя = "ВыдачаДенежныхСредствКассеККМ"
			Или   ВидОперацииИмя = "РасчетыПоКредитамИЗаймам" 
			Или   ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентами"
			//Смартис Лиманчук начало 05.11.2012
			Или   ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентамиНал"
			//Смартис Лиманчук окончание 05.11.2012
			Или   ВидОперацииИмя = "ПереводНаДругойСчет"
			Или   ВидОперацииИмя = "ПокупкаПродажаВалюты"
			Или   ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств"
			Или   ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСРаботниками" Тогда
			
			Проводка 				 = СтруктураДвижений.ПроводкиБУ.Добавить();
			Проводка.Период			 = ДатаДвижений;
			Проводка.Организация	 = Организация;
			Если ДатаДвижений >= Дата("20210101") Тогда
				НаличнаяОрганизация = Константы.НПТ.Получить();
			Иначе
				НаличнаяОрганизация = Константы.КрафтКолор.Получить();
			КонецЕсли;

			Если ВидОперацииИмя = "ПеречислениеДенежныхСредствПодотчетнику" Тогда
				Проводка.Содержание	 = "Перечисление денежных средств подотчетнику";
				
				Если РасчетыВВалюте Тогда
					Проводка.СчетДт  = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте;
				Иначе
					Проводка.СчетДт  = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте;
				КонецЕсли;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.ФизЛицо);
			ИначеЕсли ВидОперацииИмя = "ВыдачаДенежныхСредствПодотчетнику" Тогда
				Проводка.Содержание = "Выдача средств подотчетнику";
				Проводка.СчетДт     = СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
			//Смартис Лиманчук начало 01.11.2012
			ИначеЕсли ВидОперацииИмя = "ВыдачаДенежныхСредствПодотчетникуНал" Тогда
			    Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание = "Выдача средств подотчетнику";
				Проводка.СчетДт     = СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
			//Смартис Лиманчук окончание 01.11.2012
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентами" Или ВидОперацииИмя = "РасчетыПоКредитамИЗаймам" Тогда
				Проводка.Содержание	 = "Расчеты по кредитам и займам";
				
				Проводка.СчетДт		 = РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].ДоговорКонтрагента);
			//Смартис Лиманчук начало 06.11.2012
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентамиНал" Тогда
			    Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание	 = "Расчеты по кредитам и займам";
				
				Проводка.СчетДт		 = РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].ДоговорКонтрагента);
			//Смартис Лиманчук окончание 06.11.2012
			ИначеЕсли ВидОперацииИмя = "ПереводНаДругойСчет" Тогда
				Проводка.Содержание  = "Перевод на другой cчет";
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.СчетКонтрагента);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			ИначеЕсли ВидОперацииИмя = "ПокупкаПродажаВалюты" Тогда
				Проводка.Содержание  = ?(СчетУчетаДенежныхСредств.Валютный, "Продажа валюты", "Покупка валюты");
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Ссылка.СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Ссылка.СубконтоДт3);
				
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
			ИначеЕсли ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Тогда
				
				Проводка.Содержание  = "Прочее списание денежных средств";
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Ссылка.СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Ссылка.СубконтоДт3);
				
			//Смартис Лиманчук начало 06.11.2012
			ИначеЕсли ВидОперацииИмя = "РасходДенежныхСредствПрочееНал" Тогда
				
				Если СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы Тогда
					//две проводки
					
					Проводка.Содержание  = "Прочее списание денежных средств";
					Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.СубконтоДт1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Ссылка.СубконтоДт2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Ссылка.СубконтоДт3);
					
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ВнутренниеРасчеты;
					Проводка.Сумма  = СуммаДокумента;
					Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат; 
					Проводка.СуммаНУДт = НалоговыйУчет.ОпределитьСтоимостьНУ(Проводка.НалоговоеНазначениеДт, Проводка.Сумма);
					
					Проводка 				 = СтруктураДвижений.ПроводкиБУ.Добавить();
					Проводка.Период			 = ДатаДвижений;
					Проводка.Организация	 = НаличнаяОрганизация;
					
					Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ВнутренниеРасчеты;
					
				Иначе
				
					Проводка.Организация = НаличнаяОрганизация;
					Проводка.Содержание  = "Прочее списание денежных средств";
					Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.СубконтоДт1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Ссылка.СубконтоДт2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Ссылка.СубконтоДт3);
				
				КонецЕсли;
				
			//Смартис Лиманчук окончание 06.11.2012
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСРаботниками" Тогда
				Проводка.Содержание  = "Расчеты по кредитам и займам с работниками";
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Ссылка.ФизЛицо);
				Иначе
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
				КонецЕсли;
			ИначеЕсли ВидОперацииИмя = "ВзносНаличнымиВБанк" Тогда
				Проводка.Содержание = "Взнос наличными в банк";
				Проводка.СчетДт     = СчетУчетаРасчетовСКонтрагентом;
				Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
				Проводка.СубконтоДт.БанковскиеСчета = СтруктураШапкиДокумента.СчетОрганизации;
			ИначеЕсли ВидОперацииИмя = "ВыдачаДенежныхСредствКассеККМ" Тогда
				Проводка.Содержание = "Выдача разменной монеты";
				Если Ссылка.ВидВыдачиДенежныхСредств = Перечисления.ВидВыдачиДенежныхСредств.НТТ Тогда
				    //НТТ
					Проводка.СчетДт     = ПланыСчетов.Хозрасчетный.РозничнаяВыручкаПринятаяИзНТТ;
				Иначе           
					Проводка.СчетДт     = ПланыСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ;
				КонецЕсли;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Контрагент);
			КонецЕсли;
			
			Проводка.СчетКт			= СчетУчетаДенежныхСредств;
			Если фКассоваяОперация Тогда
				Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Иначе
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СчетОрганизации);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			КонецЕсли;
			
			Если РасчетыВВалюте Тогда
				
				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаДт = СуммаДокумента;
				КонецЕсли;
				
				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаКт = СуммаДокумента;
				КонецЕсли;
				
				Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, ВалютаДокумента, ВалютаРег,
				КурсДокумента,      ДанныеОВалюте.Курс, 
				КратностьДокумента, ДанныеОВалюте.Кратность);
				
				Проводка.ВалютаКт        = ВалютаДокумента;
				Проводка.ВалютнаяСуммаКт = СуммаДокумента;
				
			Иначе
				Проводка.Сумма  = СуммаДокумента;
			КонецЕсли;
			
			//Смартис Лиманчук начало 06.11.2012
			//Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Тогда
			Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Или ВидОперацииИмя = "РасходДенежныхСредствПрочееНал" Тогда
			//Смартис Лиманчук окончание 06.11.2012
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУДт = НалоговыйУчет.ОпределитьСтоимостьНУ(Проводка.НалоговоеНазначениеДт, Проводка.Сумма);
			
			КонецЕсли;
			
		//Смартис Лиманчук начало 08.10.2012
		ИначеЕсли ВидОперацииИмя = "ВзносНаличнымиВБанкНал" Тогда
			
			Проводка 				 = СтруктураДвижений.ПроводкиБУ.Добавить();
			Проводка.Период			 = ДатаДвижений;
			Проводка.Организация     = НаличнаяОрганизация;
			
			Проводка.Содержание = "Перемещение денег";
			Проводка.СчетДт     = СчетУчетаРасчетовСКонтрагентом;
			Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Проводка.СубконтоДт.БанковскиеСчета = СтруктураШапкиДокумента.СчетОрганизации;
			
			Проводка.СчетКт			= СчетУчетаДенежныхСредств;
			Если фКассоваяОперация Тогда
				Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Иначе
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СчетОрганизации);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			КонецЕсли;
			
			Проводка.Сумма  = СуммаДокумента;
			
			Проводка 				 = СтруктураДвижений.ПроводкиБУ.Добавить();
			Проводка.Период			 = ДатаДвижений;
			Проводка.Организация     = НаличнаяОрганизация;
			
			Проводка.Содержание = "Оплата";
			Проводка.СчетДт     = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
			Проводка.СубконтоДт.Контрагенты = СтруктураШапкиДокумента.Организация.ДоговорКрафтПокупаетУОрганизации.Владелец;
			Проводка.СубконтоДт.Договоры = СтруктураШапкиДокумента.Организация.ДоговорКрафтПокупаетУОрганизации;
			
			Проводка.СчетКт			= СчетУчетаРасчетовСКонтрагентом;
			Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Проводка.СубконтоКт.БанковскиеСчета = СтруктураШапкиДокумента.СчетОрганизации;
			
			Проводка.Сумма  = СуммаДокумента;
			
			Проводка 				 = СтруктураДвижений.ПроводкиБУ.Добавить();
			Проводка.Период			 = ДатаДвижений;
			Проводка.Организация     = СтруктураШапкиДокумента.Организация;
			
			Проводка.Содержание = "Оплата";
			Проводка.СчетДт     = СчетУчетаРасчетовСКонтрагентом;
			Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			Проводка.СубконтоДт.БанковскиеСчета = СтруктураШапкиДокумента.СчетОрганизации;
			
			Проводка.СчетКт			= ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
			Проводка.СубконтоКт.Контрагенты = СтруктураШапкиДокумента.Организация.ДоговорОрганизацияПродаетКрафту.Владелец;
			Проводка.СубконтоКт.Договоры = СтруктураШапкиДокумента.Организация.ДоговорОрганизацияПродаетКрафту;
			
			Проводка.Сумма  = СуммаДокумента;
			
		//Смартис Лиманчук окончание 08.10.2012	
		ИначеЕсли ВидОперацииИмя = "ПеречислениеНалога" Тогда
			
			СтруктураДвижений.Вставить("ВзаиморасчетыПоВзносамВФонды", ОбщегоНазначения.ПолучитьНаборЗаписейПоСсылке(Ссылка, РегистрыНакопления.ВзаиморасчетыПоВзносамВФонды));
			Для каждого ТекущаяСтрока Из Ссылка.ПеречислениеНалогов Цикл
				
				Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();
				
				Проводка.Период      = ДатаДвижений;
				Проводка.Организация = Организация;
				
				Проводка.Содержание  = "Перечисление налога";
				
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ТекущаяСтрока.СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, ТекущаяСтрока.СубконтоДт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, ТекущаяСтрока.СубконтоДт3);
				
				Проводка.СчетКт      = СчетУчетаДенежныхСредств;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СчетОрганизации);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
				
				// суммы в валюте быть не могут, это налоги
				Проводка.Сумма = ТекущаяСтрока.Сумма;
				
				Если СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоПенсионномуОбеспечению 
					ИЛИ СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию
					ИЛИ СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюНаСлучайБезработицы
					ИЛИ СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев
					Тогда
					
					мСтатьяНалоговойДекларации = "";
					Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт1; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт2; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="СтатьиНалоговыхДеклараций" Тогда
						мСтатьяНалоговойДекларации = ТекущаяСтрока.СубконтоДт3; 
					КонецЕсли;
					мНалог = "";
					Если ТекущаяСтрока.СубконтоДт1.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт1; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт2.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт2; 
					ИначеЕсли ТекущаяСтрока.СубконтоДт3.Метаданные().Имя ="Налоги" Тогда
						мНалог = ТекущаяСтрока.СубконтоДт3; 
					КонецЕсли;
					ДвиженияПоВзаиморасчетыПоВзносамВФонды(СтруктураШапкиДокумента, ТекущаяСтрока.Ведомость, мСтатьяНалоговойДекларации, мНалог, мСтруктураПараметровДенежныхСредств, СтруктураДвижений);
				КонецЕсли; 	
				
			КонецЦикла; 
			
			Если СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ Тогда
				ДвиженияПоВзаиморасчетыПоНДФЛ(СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, СтруктураДвижений);
			КонецЕсли; 	
			
		КонецЕсли; 

		УчетнаяПолитикаНеЗадана = Ложь;
		мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДатаДвижений, УчетнаяПолитикаНеЗадана, Организация, "Бух");
		БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
		КассыОбособленныхПодразделений = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);
		Если НЕ УчетнаяПолитикаНеЗадана И фКассоваяОперация И КассыОбособленныхПодразделений Тогда
			Если мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
				ОбособленноеПодразделение = СчетОрганизации.ОбособленноеПодразделение;
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
					Для каждого Проводка Из СтруктураДвижений.ПроводкиБУ Цикл
						Проводка.СубконтоКт.ОбособленныеПодразделенияБезОбразованияЮрЛица = ОбособленноеПодразделение;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Смартис Лиманчук начало 06.11.2012
		//Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Тогда
		Если ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "РасходДенежныхСредствПрочее" Или ВидОперацииИмя = "РасходДенежныхСредствПрочееНал" Тогда
		//Смартис Лиманчук окончание 06.11.2012
			
			// Движения по затратным регистрам
			Если СтруктураШапкиДокумента.ОтражатьПоЗатратам Тогда
				
				ТабЗатрат = УправлениеЗатратами.СформироватьТаблицуЗатрат();
				
				СтрокаЗатрат = ТабЗатрат.Добавить();
				
				СтрокаЗатрат.СтатьяЗатрат						= СтруктураШапкиДокумента.СтатьяЗатрат;
				СтрокаЗатрат.НоменклатурнаяГруппа				= СтруктураШапкиДокумента.НоменклатурнаяГруппа;
				СтрокаЗатрат.ПодразделениеОрганизации			= СтруктураШапкиДокумента.ПодразделениеОрганизацииЗатраты;
				
				СтрокаЗатрат.Заказ								= СтруктураШапкиДокумента.Заказ;
				
				СтрокаЗатрат.СуммаРегл							= ТаблицаПлатежейУпр[0].СуммаРегл; 
				СтрокаЗатрат.СуммаБух						    = ТаблицаПлатежейУпр[0].СуммаРегл; 
				СтрокаЗатрат.СтоимостьНУ						= НалоговыйУчет.ОпределитьСтоимостьНУ(СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат, ТаблицаПлатежейУпр[0].СуммаРегл); 
				
				СтрокаЗатрат.СчетЗатрат							= СчетУчетаРасчетовСКонтрагентом;
				СтрокаЗатрат.Субконто1							= СтруктураШапкиДокумента.СубконтоДт1;
				СтрокаЗатрат.Субконто2							= СтруктураШапкиДокумента.СубконтоДт2;
				СтрокаЗатрат.Субконто3							= СтруктураШапкиДокумента.СубконтоДт3;
				
				СтрокаЗатрат.СпособРаспределенияЗатратНаВыпуск	= СтруктураШапкиДокумента.СпособРаспределенияЗатратНаВыпуск;
				СтрокаЗатрат.НалоговоеНазначениеДоходовИЗатрат  = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
				
				УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
					СтруктураШапкиДокумента, 
					ТабЗатрат, 
					Перечисления.ВидыОтраженияВУчете.ОтражатьВРегламентированномУчете 
				);
				
			КонецЕсли;
			
		КонецЕсли;	
		//Учет курсовых разниц
		Если (ВалютаДокумента <> ВалютаРег) тогда
			
			СтруктураПараметровКР = БухгалтерскийУчет.ПодготовкаСтруктурыПараметровДляПереоценкиСчета(Ссылка,Заголовок);
			СтруктураДвижений.ПроводкиБУ.Записать(Ложь);
			БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(СтруктураПараметровКР,СтруктураДвижений.ПроводкиБУ,ВалютаРег,Истина);
		КонецЕсли;
		
	КонецЕсли; // Бухгалтерские проводки документа
	
	Если Ссылка.ОтражатьВБухгалтерскомУчете И (Оплачено ИЛИ НЕ Ссылка.ОтражатьВУправленческомУчете) Тогда
		
		ДвиженияПоЕдиномуНалогуРегл(СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, СтруктураДвижений);
		
		Если    СтруктураШапкиДокумента.ЕстьНДС 
			ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Если ЕстьРасчетыСКонтрагентами И СтруктураПараметровДДС <> Ложь Тогда
				НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаОплата(СтруктураПараметровДДС,СтруктураДвижений,ВалютаРег,РежимПроведения,ЭтотОбъект,Отказ);
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Для каждого КлючСтруктуры из СтруктураДвижений Цикл
				ДвижениеКЗаписи = СтруктураДвижений[КлючСтруктуры.Ключ];
				ДвижениеКЗаписи.Записать(Ложь);
			КонецЦикла;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	Для Каждого КлючСтруктуры из СтруктураДвижений Цикл
		ДвижениеКЗаписи = СтруктураДвижений[КлючСтруктуры.Ключ];
		ДвижениеКЗаписи.Записать(Ложь);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ДвиженияПоВзаиморасчетыПоНДФЛ(СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, СтруктураДвижений)
	
	Ссылка							= СтруктураШапкиДокумента.Ссылка;
	НаименованиеДокумента			= Ссылка.Метаданные().Имя;
	НаборДвижений					= ОбщегоНазначения.ПолучитьНаборЗаписейПоСсылке(Ссылка, РегистрыНакопления.ВзаиморасчетыПоНДФЛ);
	ЗаписыватьДвижения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ                                          
	|	Основной.Сотрудник				КАК Сотрудник,
	|	Основной.ДоходНДФЛ				КАК ДоходНДФЛ,
	|	Основной.ВидСтавки				КАК ВидСтавки,
	|	Основной.ПериодВзаиморасчетов	КАК ПериодВзаиморасчетов,
	|	Основной.Льгота					КАК Льгота,
	|	Основной.КоличествоЛьгот		КАК КоличествоЛьгот,
	|	Основной.НалоговыйПериод	КАК НалоговыйПериод,
	|	Основной.Налог		КАК Налог,
	|	Основной.Доход		КАК Доход
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + НаименованиеДокумента + ".ПеречислениеНалогов  КАК НалогиПлатежки
	|ПО НалогиПлатежки.Ссылка = &Ссылка
	|	И НалогиПлатежки.Ведомость = Основной.Ссылка
	|
	|ГДЕ	Основной.Налог <> 0
	|";
	
	КодОперацииВыплата = Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписыватьДвижения = Истина;
		Движение = НаборДвижений.Добавить();
		
		Движение.Регистратор		 		= Ссылка;
		Движение.Период      			= СтруктураШапкиДокумента.ДатаДвижений;
		Движение.ВидДвижения 			= ВидДвиженияНакопления.Расход;;
		
		Движение.Организация 			= СтруктураШапкиДокумента.Организация;
		Движение.Сотрудник 				= Выборка.Сотрудник;
		Движение.ВидСтавки				= Выборка.ВидСтавки;
		
		Движение.ДоходНДФЛ 				= Выборка.ДоходНДФЛ;
		Движение.ПериодВзаиморасчетов	= Выборка.ПериодВзаиморасчетов;
		Движение.Льгота 				= Выборка.Льгота;
		
		Движение.Налог 					= Выборка.Налог;	
		Движение.Доход 					= Выборка.Доход;	
		Движение.КоличествоЛьгот		= Выборка.КоличествоЛьгот;
		Движение.НалоговыйПериод		= Выборка.НалоговыйПериод;
	КонецЦикла;
	
	СтруктураДвижений.Вставить("ВзаиморасчетыПоНДФЛ", НаборДвижений);
	
КонецПроцедуры // ДвиженияПоВзаиморасчетыПоНДФЛ()

Процедура ДвиженияПоВзаиморасчетыПоВзносамВФонды(СтруктураШапкиДокумента, Ведомость, СтатьяНалоговойДекларации, Налог, мСтруктураПараметровДенежныхСредств, СтруктураДвижений)
	
	Ссылка							= СтруктураШапкиДокумента.Ссылка;
	НаименованиеДокумента 			= Ссылка.Метаданные().Имя;
	НаборДвижений					= СтруктураДвижений.ВзаиморасчетыПоВзносамВФонды;
	ЗаписыватьДвижения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("СтатьяНалоговойДекларации", СтатьяНалоговойДекларации);
	Запрос.УстановитьПараметр("Налог", Налог);
	
	Запрос.Текст =
	"ВЫБРАТЬ                                          
	|	Основной.ПериодВзаиморасчетов	КАК ПериодВзаиморасчетов,
	|	СУММА(Основной.База)			КАК База,
	|	СУММА(Основной.БазаВзноса)		КАК БазаВзноса,
	|	СУММА(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Основной
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + НаименованиеДокумента + ".ПеречислениеНалогов  КАК НалогиПлатежки
	|ПО НалогиПлатежки.Ссылка = &Ссылка
	|	И НалогиПлатежки.Ведомость = Основной.Ссылка
	|
	|ГДЕ	
	|		НалогиПлатежки.СубконтоДт1 = &Налог
	|	И	НалогиПлатежки.СубконтоДт2 = &СтатьяНалоговойДекларации
	|	И   Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0 ИЛИ	Основной.БазаВзноса <> 0 ИЛИ	Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.ПериодВзаиморасчетов
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ                                          
	|	Основной.ПериодВзаиморасчетов	КАК ПериодВзаиморасчетов,
	|	Сумма(Основной.База)			КАК База,
	|	Сумма(Основной.БазаВзноса)		КАК БазаВзноса,
	|	Сумма(Основной.Результат)		КАК Результат
	|ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Основной   
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + НаименованиеДокумента + ".ПеречислениеНалогов  КАК НалогиПлатежки
	|ПО НалогиПлатежки.Ссылка = &Ссылка
	|	И НалогиПлатежки.Ведомость = Основной.Ссылка
	|
	|ГДЕ
	|		НалогиПлатежки.СубконтоДт1 = &Налог
	|	И	НалогиПлатежки.СубконтоДт2 = &СтатьяНалоговойДекларации
	|	И	Основной.Ссылка = &Ведомость
	|	И	Основной.Налог =  &Налог
	|	И	Основной.СтатьяНалоговойДекларации =  &СтатьяНалоговойДекларации
	|	И	(Основной.База <> 0 ИЛИ	Основной.БазаВзноса <> 0 ИЛИ	Основной.Результат <> 0)
	|СГРУППИРОВАТЬ ПО                                          
	|	Основной.ПериодВзаиморасчетов
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписыватьДвижения = Истина;
		Движение = НаборДвижений.Добавить();
		
		Движение.Регистратор		 		= Ссылка;
		Движение.Период						= СтруктураШапкиДокумента.ДатаДвижений;
		Движение.ВидДвижения 				= ВидДвиженияНакопления.Расход;
		Движение.Организация 				= СтруктураШапкиДокумента.Организация;
		
		Движение.СтатьяНалоговойДекларации	= СтатьяНалоговойДекларации;
		Движение.Налог						= Налог;
		Движение.ПериодВзаиморасчетов		= Выборка.ПериодВзаиморасчетов;
		
		Движение.База 						= Выборка.База;
		Движение.БазаВзноса 				= Выборка.БазаВзноса;	
		Движение.Результат 					= Выборка.Результат;	
		
	КонецЦикла;
	
	
КонецПроцедуры // ДвиженияПоВзаиморасчетыПоВзносамВФонды()

Процедура ДвиженияПоЕдиномуНалогуРегл(СтруктураШапкиДокумента, мСтруктураПараметровДенежныхСредств, СтруктураДвижений = Неопределено)
	
	Если НЕ (СтруктураШапкиДокумента.ЕстьЕдиныйНалог И СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка							= СтруктураШапкиДокумента.Ссылка;
	ВидОперации						= СтруктураШапкиДокумента.ВидОперации;
	ДатаДвижений					= мСтруктураПараметровДенежныхСредств.ДатаДвижений;
	ВалютаРег						= глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	ВидОперацииИмя					= Строка(ВидОперации);
	Для каждого ЗначениеПеречисления Из ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = ВидОперацииИмя Тогда
			ВидОперацииИмя				= ЗначениеПеречисления.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СчетОрганизации					= Ссылка.СчетОрганизации;
	
	МетаданныеДокумента = Ссылка.Метаданные();
	Если	  МетаданныеДокумента.Реквизиты.Найти("НомерПоручения")<> Неопределено Тогда
		Номер						= Ссылка.НомерПоручения;
	ИначеЕсли МетаданныеДокумента.Реквизиты.Найти("НомерОрдера")	<> Неопределено Тогда
		Номер						= Ссылка.НомерОрдера;
	Иначе
		Номер						= Ссылка.Номер;
	КонецЕсли;
	
	ЕстьРасчетыСКонтрагентами		= мСтруктураПараметровДенежныхСредств.ЕстьРасчетыСКонтрагентами;
	ЭтоВозврат						= УправлениеДенежнымиСредствами.НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(СтруктураШапкиДокумента.ВидОперации) = Перечисления.РасчетыВозврат.Возврат;
	ДанныеОВалюте					= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРег, ДатаДвижений);
	
	Если МетаданныеДокумента.Имя = "АвансовыйОтчет" Тогда
						  		 ТаблицаПлатежей = Ссылка.Товары.			Выгрузить().Свернуть("СтатьяДекларацииПоЕдиномуНалогу","Сумма");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Ссылка.ОплатаПоставщикам.Выгрузить().Свернуть("СтатьяДекларацииПоЕдиномуНалогу","Сумма"), ТаблицаПлатежей);
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Ссылка.Прочее.			Выгрузить().Свернуть("СтатьяДекларацииПоЕдиномуНалогу","Сумма"), ТаблицаПлатежей);
		
		ТаблицаПлатежей.Свернуть("СтатьяДекларацииПоЕдиномуНалогу","Сумма");
		ТаблицаПлатежей.Колонки.Найти("Сумма").Имя = "СуммаПлатежа";
		ТаблицаПлатежей.Колонки.Добавить("ОстаточнаяСтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ИначеЕсли ЕстьРасчетыСКонтрагентами Или ВидОперацииИмя = "ПрочееСписаниеБезналичныхДенежныхСредств" Тогда
		Если НЕ Ссылка.Оплачено Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаПлатежей = Ссылка.РасшифровкаПлатежа.Выгрузить();
		Если ТаблицаПлатежей.Колонки.Найти("ОстаточнаяСтоимостьОС") = Неопределено Тогда
			ТаблицаПлатежей.Свернуть("СтатьяДекларацииПоЕдиномуНалогу","СуммаПлатежа");
			ТаблицаПлатежей.Колонки.Добавить("ОстаточнаяСтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		Иначе
			ТаблицаПлатежей.Свернуть("СтатьяДекларацииПоЕдиномуНалогу","СуммаПлатежа,ОстаточнаяСтоимостьОС");
		КонецЕсли;
	Иначе
		Если НЕ Ссылка.Оплачено Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаПлатежей = Новый ТаблицаЗначений;
		ТаблицаПлатежей.Колонки.Добавить("СтатьяДекларацииПоЕдиномуНалогу");
		ТаблицаПлатежей.Колонки.Добавить("СуммаПлатежа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		ТаблицаПлатежей.Колонки.Добавить("ОстаточнаяСтоимостьОС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
		
		СтрокаТаблицыПлатежей = ТаблицаПлатежей.Добавить();
		СтрокаТаблицыПлатежей.СтатьяДекларацииПоЕдиномуНалогу	= Ссылка.РасшифровкаПлатежа[0].СтатьяДекларацииПоЕдиномуНалогу;
		СтрокаТаблицыПлатежей.СуммаПлатежа						= Ссылка.СуммаДокумента;
	КонецЕсли;
	
	НаборДвижений			= ОбщегоНазначения.ПолучитьНаборЗаписейПоСсылке(Ссылка, РегистрыНакопления.КнигаДоходовРасходовПоЕдиномуНалогу);

	Для Каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.СтатьяДекларацииПоЕдиномуНалогу) Тогда
			Продолжить;
		КонецЕсли;

		Строка				= НаборДвижений.Добавить();
		Строка.Период		= ДатаДвижений;
		Строка.Организация	= СтруктураШапкиДокумента.Организация;
		Строка.Статья		= СтрокаПлатеж.СтатьяДекларацииПоЕдиномуНалогу;
		
		Если СчетОрганизации.ВалютаДенежныхСредств <> ВалютаРег Тогда
			Строка.Сумма	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, СтруктураШапкиДокумента.ВалютаДокумента, ВалютаРег,
									СтруктураШапкиДокумента.КурсДокумента, ДанныеОВалюте.Курс, 
									СтруктураШапкиДокумента.КратностьДокумента, ДанныеОВалюте.Кратность);	
		Иначе
			Строка.Сумма	= СтрокаПлатеж.СуммаПлатежа;
		КонецЕсли;
		Строка.Сумма		= Макс(0, Строка.Сумма - СтрокаПлатеж.ОстаточнаяСтоимостьОС);
		Если ЭтоВозврат Тогда
			Строка.Сумма	=-Строка.Сумма;
		КонецЕсли;	
		
		СинонимИмениДокумента = МетаданныеДокумента.Синоним;
		Строка.НомерПлатежногоДокумента = АббревиатураИмениДокумента(СинонимИмениДокумента) + " " + Номер;
		Строка.Регистратор  = Ссылка;
				
	КонецЦикла;
	
	Если НаборДвижений.Количество() > 0 Тогда
		Если СтруктураДвижений = Неопределено Тогда
			НаборДвижений.Записать(Ложь);
		Иначе
			СтруктураДвижений.Вставить("КнигаДоходовРасходовПоЕдиномуНалогу", НаборДвижений);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Функция АббревиатураИмениДокумента(Имя)
	
	Результат = Лев(Имя, 1);
	ПозицияПробела = Найти(Имя, " ");
	
	Пока ПозицияПробела <> 0 Цикл
		
		Имя = Сред(Имя, ПозицияПробела+1);
		Результат = Результат + ВРег(Лев(Имя, 1));
		ПозицияПробела = Найти(Имя, " ");
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПровестиПоступлениеДенежныхСредствРегл(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаПлатежейУпр, Движения, Отказ, Заголовок) Экспорт

	Ссылка								= СтруктураШапкиДокумента.Ссылка;
	Организация							= СтруктураШапкиДокумента.Организация;
	Контрагент							= СтруктураШапкиДокумента.Контрагент;
	ВидОперации							= СтруктураШапкиДокумента.ВидОперации;
	
	ВидОперацииИмя						= Строка(ВидОперации);
	Для каждого ЗначениеПеречисления Из ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = ВидОперацииИмя Тогда
			ВидОперацииИмя				= ЗначениеПеречисления.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВалютаДокумента						= СтруктураШапкиДокумента.ВалютаДокумента;
	КурсДокумента						= СтруктураШапкиДокумента.КурсВалютыДокумента;
	КратностьДокумента					= СтруктураШапкиДокумента.КратностьВалютыДокумента;
	
	ЕстьРасчетыСКонтрагентами			= СтруктураПараметров.ЕстьРасчетыСКонтрагентами;
	ЕстьРасчетыПоКредитам				= СтруктураПараметров.ЕстьРасчетыПоКредитам;
	РежимПроведения						= СтруктураПараметров.РежимПроведения;
	ДатаДвижений						= СтруктураПараметров.ДатаДвижений;
	
	ВалютаРег							= глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ДанныеОВалюте						= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРег, ДатаДвижений);
	
	СчетОрганизации						= СтруктураПараметров.СчетОрганизации;
	СчетУчетаРасчетовСКонтрагентом		= Ссылка.СчетУчетаРасчетовСКонтрагентом;
	Оплачено							= СтруктураПараметров.Оплачено;
	ЭтотОбъект							= Ссылка.ПолучитьОбъект();
	фКассоваяОперация					= СтруктураПараметров.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
	
	
	СуммаДокумента						= Ссылка.СуммаДокумента;
	РасшифровкаПлатежа					= Ссылка.РасшифровкаПлатежа;
	
	
	СтруктураДвижений 	   = Новый Структура();
	
	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не(Ссылка.ОтражатьВБухгалтерскомУчете И Оплачено) Тогда
		Если Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			//Для физлиц плательщиков единого налога разрешено проведение по налоговому
			//при выключеном бухгалтерском.		
			ДвиженияПоЕдиномуНалогуРегл(СтруктураШапкиДокумента, СтруктураПараметров, СтруктураДвижений);
		КонецЕсли;		
		Возврат;
	Конецесли;

	ВалютаСчета = СчетОрганизации.ВалютаДенежныхСредств;
	
	СтруктураДвижений.Вставить("ПроводкиБУ", Движения.Хозрасчетный);
		
	Если ((ВалютаСчета = ВалютаРег) ИЛИ (НЕ ЗначениеЗаполнено(ВалютаСчета))) Тогда
		РасчетыВВалюте = Ложь;
	Иначе
		РасчетыВВалюте = Истина;
	КонецЕсли;
	
	ОбособленноеПодразделение = Неопределено;
	УчетнаяПолитикаНеЗадана = Ложь;
	мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДатаДвижений, УчетнаяПолитикаНеЗадана, Организация, "Бух");
	БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
	КассыОбособленныхПодразделений = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);
	Если НЕ УчетнаяПолитикаНеЗадана И фКассоваяОперация И КассыОбособленныхПодразделений Тогда
		Если мУчетнаяПолитикаБУ.ВестиУчетДенежныхСредствПоОбособленнымПодразделениям Тогда
			ОбособленноеПодразделение = СчетОрганизации.ОбособленноеПодразделение;
		КонецЕсли;
	КонецЕсли;

	Если фКассоваяОперация Тогда
		СчетДт = ?(РасчетыВВалюте, ПланыСчетов.Хозрасчетный.КассаВИностраннойВалюте, ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте);
	Иначе
		МетаданныеДокумента = Ссылка.Метаданные();
		Если МетаданныеДокумента.Реквизиты.Найти("СчетУчетаДенежныхСредств") <> Неопределено Тогда
			СчетДт = Ссылка.СчетУчетаДенежныхСредств;
		Иначе
			СчетДт = ОпределитьСчетУчетаДенежныхСредств(СчетОрганизации, ВалютаРег, РасчетыВВалюте);
		КонецЕсли;
	КонецЕсли;
	//ИЗМЕНЕНО Верескул Игорь(Начало 14.12.2020		
	Если ДатаДвижений >= Дата("20210101") Тогда
		НаличнаяОрганизация = Константы.НПТ.Получить();
	Иначе
		НаличнаяОрганизация = Константы.КрафтКолор.Получить();
	КонецЕсли;

	Если Ссылка.ОтражатьВБухгалтерскомУчете И (Оплачено ИЛИ НЕ Ссылка.ОтражатьВУправленческомУчете) Тогда
		
		Если ВидОперацииИмя = "ПрочееПоступлениеБезналичныхДенежныхСредств" Или
			 ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетником" Или
			 //Смартис Лиманчук начало 01.11.2012
			 ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетникомНал" Или
			 //Смартис Лиманчук окончание 01.11.2012
			 ВидОперацииИмя = "ВозвратДенежныхСредствРаботником" Или
			 //Смартис Лиманчук начало 05.11.2012
			 ВидОперацииИмя = "ВозвратДенежныхСредствРаботникомНал" Или
			 //Смартис Лиманчук окончание 05.11.2012
			 ВидОперацииИмя = "ПриходДенежныхСредствПрочее" Или
			 //Смартис Лиманчук начало 05.11.2012
			 ВидОперацииИмя = "ПриходДенежныхСредствПрочееНал" Или
			 //Смартис Лиманчук окончание 05.11.2012
			 ВидОперацииИмя = "ПолучениеНаличныхДенежныхСредствВБанке" Или
			 ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентами" Или
			 //Смартис Лиманчук начало 05.11.2012
			 ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентамиНал" Или
			 //Смартис Лиманчук окончание 05.11.2012
			 ВидОперацииИмя = "ПокупкаПродажаВалюты" Или
			 ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСРаботниками" Или
			 ВидОперацииИмя = "РасчетыПоКредитамИЗаймам" Тогда

			Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = Организация;
			Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом;
			
			Проводка.СчетДт      = СчетДт;
			Если фКассоваяОперация Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
				КонецЕсли;
			Иначе
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СчетОрганизации);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
			КонецЕсли;
			
			Если ВидОперацииИмя = "ПрочееПоступлениеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "ПриходДенежныхСредствПрочее" Тогда
				Проводка.Содержание = "Прочее поступление денежных средств";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Ссылка.СубконтоКт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Ссылка.СубконтоКт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Ссылка.СубконтоКт3);
			//Смартис Лиманчук начало 05.11.2012
			ИначеЕсли ВидОперацииИмя = "ПриходДенежныхСредствПрочееНал" Тогда
			    Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание = "Прочее поступление денежных средств";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Ссылка.СубконтоКт1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Ссылка.СубконтоКт2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Ссылка.СубконтоКт3);
			//Смартис Лиманчук окончание 05.11.2012 
			ИначеЕсли ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетником" Тогда
				Проводка.Содержание = "Возврат средств от подотчетника";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент);
			//Смартис Лиманчук начало 01.11.2012
			ИначеЕсли ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетникомНал" Тогда
			    Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание = "Возврат средств от подотчетника";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент);
			//Смартис Лиманчук окончание 01.11.2012
			ИначеЕсли ВидОперацииИмя = "ВозвратДенежныхСредствРаботником" Тогда
				Проводка.Содержание = "Возврат средств от работника";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент.Физлицо);
			//Смартис Лиманчук начало 05.11.2012
			ИначеЕсли ВидОперацииИмя = "ВозвратДенежныхСредствРаботникомНал" Тогда
				Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание = "Возврат средств от работника";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент.Физлицо);
			//Смартис Лиманчук окончание 05.11.2012
			ИначеЕсли ВидОперацииИмя = "ПолучениеНаличныхДенежныхСредствВБанке" Тогда
				Если СчетОрганизации.ВалютаДенежныхСредств <> ВалютаРег Тогда
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВИностраннойВалюте;
				Иначе
					Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
				КонецЕсли;
				
				Проводка.Содержание = "Получение наличных в банке";
				Проводка.СубконтоКт.БанковскиеСчета = Ссылка.СчетОрганизации;
				Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств;
			ИначеЕсли ВидОперацииИмя = "ПокупкаПродажаВалюты" Тогда
				Проводка.Содержание  = ?(СчетДт.Валютный, "Покупка валюты", "Продажа валюты");
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент);
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСРаботниками" Тогда
				Проводка.Содержание = "Расчеты по кредитам и займам с Работниками";
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент.Физлицо);
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймам" Или ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентами" Тогда
				Проводка.Содержание = "Расчеты по кредитам и займам";
				Проводка.СчетКт     = РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].ДоговорКонтрагента);
			//Смартис Лиманчук начало 05.11.2012
			ИначеЕсли ВидОперацииИмя = "РасчетыПоКредитамИЗаймамСКонтрагентамиНал" Тогда
				Проводка.Организация = НаличнаяОрганизация;
				Проводка.Содержание = "Расчеты по кредитам и займам";
				Проводка.СчетКт     = РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, РасшифровкаПлатежа[0].ДоговорКонтрагента);
			//Смартис Лиманчук окончание 05.11.2012
	        КонецЕсли;
				
			Если РасчетыВВалюте Тогда

				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаДт = СуммаДокумента;
				КонецЕсли;

				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаКт = СуммаДокумента;
				КонецЕсли;

				Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, ВалютаДокумента, ВалютаРег,
															 КурсДокумента,      ДанныеОВалюте.Курс, 
															 КратностьДокумента, ДанныеОВалюте.Кратность);
			Иначе
				Проводка.Сумма = СуммаДокумента;
			КонецЕсли;
			
			//Смартис Лиманчук начало 05.11.2012
			//Если ВидОперацииИмя = "ПрочееПоступлениеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "ПриходДенежныхСредствПрочее" Тогда
			Если ВидОперацииИмя = "ПрочееПоступлениеБезналичныхДенежныхСредств" Или ВидОперацииИмя = "ПриходДенежныхСредствПрочее" Или ВидОперацииИмя = "ПриходДенежныхСредствПрочееНал" Тогда
			//Смартис Лиманчук окончание 05.11.2012
				Проводка.НалоговоеНазначениеКт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУКт = НалоговыйУчет.ОпределитьСтоимостьНУ(Проводка.НалоговоеНазначениеКт, Проводка.Сумма);
			КонецЕсли;	
			
		//Смартис Лиманчук начало 06.11.2012
		ИначеЕсли ВидОперацииИмя = "ПолучениеНаличныхДенежныхСредствВБанкеНал" Тогда

			//1
			
			Договор = СтруктураШапкиДокумента.Организация.ДоговорОрганизацияПродаетКрафту;
			Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = Организация;
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", Договор.Владелец);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", Договор);
			
			Если СчетОрганизации.ВалютаДенежныхСредств <> ВалютаРег Тогда
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВИностраннойВалюте;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ТекущиеСчетаВНациональнойВалюте;
			КонецЕсли;
			
			Проводка.Содержание = "Получение наличных в банке";
			Проводка.СубконтоКт.БанковскиеСчета = Ссылка.СчетОрганизации;
			Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
			
			Если РасчетыВВалюте Тогда

				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаДт = СуммаДокумента;
				КонецЕсли;

				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаКт = СуммаДокумента;
				КонецЕсли;

				Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, ВалютаДокумента, ВалютаРег,
															 КурсДокумента,      ДанныеОВалюте.Курс, 
															 КратностьДокумента, ДанныеОВалюте.Кратность);
			Иначе
				Проводка.Сумма = СуммаДокумента;
			КонецЕсли;
			
			//2
			
			Договор = Организация.ДоговорКрафтПокупаетУОрганизации;
			Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

			Проводка.Период      = ДатаДвижений;
			Проводка.Организация = Договор.Организация;
			
			Проводка.СчетДт      = СчетДт;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиДвиженияДенежныхСредств", РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
			КонецЕсли;
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Договор.Владелец);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", Договор);
			
			Проводка.Содержание = "Получение наличных в банке";
			
			Если РасчетыВВалюте Тогда

				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаДт = СуммаДокумента;
				КонецЕсли;

				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт        = ВалютаДокумента;
					Проводка.ВалютнаяСуммаКт = СуммаДокумента;
				КонецЕсли;

				Проводка.Сумма  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента, ВалютаДокумента, ВалютаРег,
															 КурсДокумента,      ДанныеОВалюте.Курс, 
															 КратностьДокумента, ДанныеОВалюте.Кратность);
			Иначе
				Проводка.Сумма = СуммаДокумента;
			КонецЕсли;
			
		//Смартис Лиманчук окончание 06.11.2012
			
		ИначеЕсли ВидОперацииИмя = "ПоступлениеСредствОтФСС" Тогда
			    Объект = Ссылка.ПолучитьОбъект();
				ВыборкаДляПроводок = Объект.СформироватьЗапросДляПроводокЗаявки().Выбрать();
				Пока ВыборкаДляПроводок.Следующий() Цикл
					Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();
					Проводка.Период      = ДатаДвижений;
					Проводка.Организация = Организация;
					Проводка.Содержание = "Поступление денежных средств от ФСС";

					Проводка.СчетДт      = СчетДт;
                    БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СчетОрганизации);
                    БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
					
					Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом;
					Если Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию Тогда
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , Справочники.Налоги.Соцстрах);
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
					ИначеЕсли Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоСтрахованиюОтНесчастныхСлучаев Тогда
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1 , Справочники.Налоги.СоцстрахНесчФОТ);
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
					Иначе	
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ВыборкаДляПроводок.СтатьяРасчетовСФСС);
					КонецЕсли;	
					Проводка.Сумма = ВыборкаДляПроводок.Результат;
				КонецЦикла;
				
		//Смартис Лиманчук начало 01.11.2012				
		//ИначеЕсли ВидОперацииИмя = "ПриходДенежныхСредствРозничнаяВыручка" Тогда
		ИначеЕсли ВидОперацииИмя = "ПриходДенежныхСредствРозничнаяВыручка" ИЛИ ВидОперацииИмя = "ПриходДенежныхСредствРозничнаяВыручкаНал" Тогда
		//Смартис Лиманчук окончание 01.11.2012

			СчетУчетаРозничнойВыручки		= ?(Ссылка.ВидПриемаРозничнойВыручки = Перечисления.ВидПриемаРозничнойВыручки.ИзНТТ,
												ПланыСчетов.Хозрасчетный.РозничнаяВыручкаПринятаяИзНТТ,
												ПланыСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ);
			СуммаРазменнойМонеты 			= Ссылка.СуммаРазменнойМонеты;
			СуммаПродаж						= Ссылка.СуммаПродаж;
			СуммаОплатыПлатежнымиКартами	= Ссылка.СуммаОплатыПлатежнымиКартами;
			СуммаОплатыБанковскимиКредитами = Ссылка.СуммаОплатыБанковскимиКредитами;
			СуммаВозврата					= Ссылка.СуммаВозврата;
			СтатьяДоходов					= Ссылка.СтатьяДоходов;
			ПриемРозничнойВыручки			= Ссылка.ПриемРозничнойВыручки;
			
			//Проводки: Разменная монета
			Если СуммаРазменнойМонеты > 0 Тогда
				Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

				Проводка.Период      = ДатаДвижений;
				Проводка.Активность  = Истина;
				//Смартис Лиманчук начало 01.11.2012
				//Проводка.Организация = Организация;
				Если ВидОперацииИмя = "ПриходДенежныхСредствРозничнаяВыручка" Тогда
					Проводка.Организация = Организация;
				Иначе
					Проводка.Организация = НаличнаяОрганизация;
				КонецЕсли;
				//Смартис Лиманчук окончание 01.11.2012
				Проводка.Содержание  = "Возврат разменной монеты";
				Проводка.Сумма       = СуммаРазменнойМонеты;

				Проводка.СчетДт      = СчетДт;
				Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
				КонецЕсли;
				
				Проводка.СчетКт      = СчетУчетаРозничнойВыручки;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
			КонецЕсли;	

			СуммаПроводки = СуммаПродаж - Макс(0,СуммаОплатыПлатежнымиКартами) - Макс(0,СуммаОплатыБанковскимиКредитами);
			Если (НЕ НалоговыйУчет.НоваяСхемаНДС(ДатаДвижений) ИЛИ СуммаПродаж > 0) И (СуммаПроводки <> 0) Тогда
				//Проводки: розничная выручка: продажа
				Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

				Проводка.Период      = ДатаДвижений;
				Проводка.Активность  = Истина;
				//Смартис Лиманчук начало 01.11.2012
				//Проводка.Организация = Организация;
				Если ВидОперацииИмя = "ПриходДенежныхСредствРозничнаяВыручка" Тогда
					Проводка.Организация = Организация;
				Иначе
					Проводка.Организация = НаличнаяОрганизация;
				КонецЕсли;
				//Смартис Лиманчук окончание 01.11.2012
				Проводка.Содержание  = "Приход выручки из розницы: продажи";
				Если НалоговыйУчет.НоваяСхемаНДС(ДатаДвижений) Тогда
					Проводка.Сумма       = СуммаПроводки;
				Иначе
					Проводка.Сумма       = СуммаДокумента;	
				КонецЕсли;

				Проводка.СчетДт      = СчетДт;
				Проводка.СубконтоДт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
					
				КонецЕсли;
					
				Если НалоговыйУчет.НоваяСхемаНДС(ДатаДвижений) Тогда
					Проводка.СчетКт      = СчетУчетаРозничнойВыручки;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);
				Иначе
					Проводка.СчетКт      = СчетУчетаРасчетовСКонтрагентом;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СтатьяДоходов);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,Контрагент);
				КонецЕсли;
			
			КонецЕсли;
			
			//Проводки: розничная выручка: возврат
			СуммаПроводкаи = СуммаВозврата - Мин(0,СуммаОплатыПлатежнымиКартами) - Мин(0,СуммаОплатыБанковскимиКредитами);
			Если (НалоговыйУчет.НоваяСхемаНДС(ДатаДвижений) И СуммаВозврата > 0) И (СуммаПроводкаи <> 0) Тогда
				
				Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

				Проводка.Период      = ДатаДвижений;
				Проводка.Активность  = Истина;
				Проводка.Организация = Организация;
				Проводка.Содержание  = "Приход выручки из розницы: возвраты покупателям";
				Проводка.Сумма       = СуммаПроводкаи;
                // счет кассы
				Проводка.СчетКт      = СчетДт;
				Проводка.СубконтоКт.СтатьиДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", ОбособленноеПодразделение);
				КонецЕсли;
					
				Проводка.СчетДт      = СчетУчетаРозничнойВыручки;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,Контрагент);
				
			КонецЕсли;
			
			//Проводки: НДС
			Если НалоговыйУчет.НоваяСхемаНДС(ДатаДвижений) Тогда
				
				ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
				ТаблицаВыручки.Свернуть("Возврат,СчетУчетаНДС","СуммаНДС");

				Для Каждого СтрокаНДС из ТаблицаВыручки Цикл
					
					Если СтрокаНДС.СуммаНДС = 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

					Проводка.Период      = ДатаДвижений;
					Проводка.Активность  = Истина;
					Проводка.Организация = Организация;
					Если СтрокаНДС.Возврат = Истина Тогда
						Проводка.Содержание  = "НДС розничной выручки (возврат)";
						Проводка.Сумма       = - СтрокаНДС.СуммаНДС;
						Проводка.СчетДт      = Ссылка.СчетВычетаИзДоходовРозничныхПродаж;
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтатьяДоходов);
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,Контрагент);
					Иначе
						Проводка.Содержание  = "НДС розничной выручки";
						Проводка.Сумма       = СтрокаНДС.СуммаНДС;
						Проводка.СчетДт      = Ссылка.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтатьяДоходов);
						БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,Контрагент);
					КонецЕсли;
					
					Проводка.СчетКт      = СтрокаНДС.СчетУчетаНДС;
					
				КонецЦикла;
				
			Иначе
				
				ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
				ТаблицаВыручки.Свернуть("СчетУчетаНДС","Сумма,СуммаНДС");

				Для Каждого СтрокаНДС из ТаблицаВыручки Цикл
					
					Если СтрокаНДС.СуммаНДС = 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();

					Проводка.Период      = ДатаДвижений;
					Проводка.Активность  = Истина;
					Проводка.Организация = Организация;
					Проводка.Содержание  = "НДС розничной выручки";
					Проводка.Сумма       = СтрокаНДС.СуммаНДС;

					Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтатьяДоходов);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,Контрагент);
					
					Проводка.СчетКт      = СтрокаНДС.СчетУчетаНДС;
					
				КонецЦикла;
			КонецЕсли;
			
			//Двжижения по регистру РозничнаяВыручкаОрганизаций
			СтруктураДвижений.Вставить("РозничнаяВыручкаОрганизаций", Движения.РозничнаяВыручкаОрганизаций);
			НаборДвижений   = СтруктураДвижений.РозничнаяВыручкаОрганизаций;
			
			ТаблицаДвижений = НаборДвижений.Выгрузить();
			ТаблицаВыручки = ПриемРозничнойВыручки.Выгрузить();
			ТаблицаВыручки.Свернуть("Возврат,СтавкаНДС","Сумма,СуммаНДС");
            Для Каждого СтрокаНДС из ТаблицаВыручки Цикл
				Если СтрокаНДС.Сумма = 0 И СтрокаНДС.СуммаНДС = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				СтрокаДвижений.Организация     = Организация;
				СтрокаДвижений.РозничнаяТочка  = Контрагент;
				СтрокаДвижений.СтавкаНДС       = СтрокаНДС.СтавкаНДС;
				Если СтрокаНДС.Возврат = Истина Тогда
					
					СтрокаДвижений.ВидРозничнойВыручки 	= Перечисления.РасчетыВозврат.Возврат;
					СтрокаДвижений.Сумма           = -СтрокаНДС.Сумма;
					СтрокаДвижений.СуммаНДС        = -СтрокаНДС.СуммаНДС;
					
				Иначе	
					
					СтрокаДвижений.ВидРозничнойВыручки 	= Перечисления.РасчетыВозврат.Расчеты;
					СтрокаДвижений.Сумма           = СтрокаНДС.Сумма;
					СтрокаДвижений.СуммаНДС        = СтрокаНДС.СуммаНДС;
				
				КонецЕсли; 
			КонецЦикла;	
          	НаборДвижений.мПериод          = ДатаДвижений;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
          	Движения.РозничнаяВыручкаОрганизаций.ВыполнитьРасход();
			
		Иначе
			СтруктураПараметровДДС = БухгалтерскийУчетРасчетовСКонтрагентами.ПодготовкаСтруктурыПараметровДляДвиженияДенег(Ссылка, ВалютаРег, Заголовок, СчетДт, , СтруктураШапкиДокумента);
			СтруктураДвижений.Вставить("ПроводкиБУ", СтруктураДвижений.ПроводкиБУ);
			СтруктураДвижений.Вставить("ПриобретенияНалоговыйУчет", Движения.ПриобретенияНалоговыйУчет);
			СтруктураДвижений.Вставить("ПродажиНалоговыйУчет", Движения.ПродажиНалоговыйУчет);
			
			Если Не (СтруктураПараметровДДС = Ложь) тогда
				БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенег(СтруктураПараметровДДС,СтруктураДвижений,ВалютаРег,РежимПроведения,ЭтотОбъект,Отказ,Ложь);
				Если РасчетыВВалюте тогда
					БухгалтерскийУчетРасчетовСКонтрагентами.ВзаиморасчетыВВалютеОплата(СтруктураПараметровДДС,ВалютаРег,РежимПроведения,СтруктураДвижений,ЭтотОбъект,Отказ);
				КонецЕсли;
			Иначе
				БухгалтерскийУчетРасчетовСКонтрагентами.ДвижениеДенегПрочийПриход(ЭтотОбъект, РасчетыВВалюте, СчетДт, КурсДокумента, КратностьДокумента, СтруктураДвижений);
			Конецесли;
		КонецЕсли;
		
		Если ВидОперацииИмя = "ПоступлениеОплатыПоПлатежнымКартам" Тогда
			Если СтруктураШапкиДокумента.СуммаУслуг <> 0 Тогда
				
				СуммаУслугРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтруктураШапкиДокумента.СуммаУслуг, СтруктураШапкиДокумента.ВалютаДокумента, ВалютаРег,
								КурсДокумента,      ДанныеОВалюте.Курс, 
								КратностьДокумента, ДанныеОВалюте.Кратность);
				
				
				ХарактерЗатрат = УправлениеЗатратами.ПолучитьХарактерЗатратПоСчетуЗатрат(СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом, СтруктураШапкиДокумента.СтатьяЗатрат);
				
				Если ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы
				  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.РасходыНаСбыт
				  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы
				  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы
				  И ХарактерЗатрат <> Перечисления.ХарактерЗатрат.АдминистративныеРасходы Тогда
					  
					 Сообщить("При указании счета затрат " + СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом + " с характером затрат " + ХарактерЗатрат + " движения в регистре Затраты (бух. учет) не будут отражены", СтатусСообщения.Важное);
					  
				Иначе  
				
					// Подготовим структуру таблицы для отражения затрат.
					ТаблицаЗатрат = УправлениеЗатратами.СформироватьТаблицуЗатрат();
					
					// Добавим строку в таблицу затрат.
					НоваяСтрока = ТаблицаЗатрат.Добавить();
					
					НоваяСтрока.ПодразделениеОрганизации = СтруктураШапкиДокумента.ПодразделениеОрганизацииЗатраты;
					НоваяСтрока.СтатьяЗатрат			 = СтруктураШапкиДокумента.СтатьяЗатрат;
					НоваяСтрока.НоменклатурнаяГруппа	 = СтруктураШапкиДокумента.НоменклатурнаяГруппа;
					НоваяСтрока.СчетЗатрат				 = СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом;
					
					НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат;
					
					НоваяСтрока.Заказ					 = СтруктураШапкиДокумента.Заказ;
					НоваяСтрока.СуммаРегл 				 = СуммаУслугРегл;
					НоваяСтрока.СуммаБух				 = СуммаУслугРегл; 
					НоваяСтрока.СтоимостьНУ				 = НалоговыйУчет.ОпределитьСтоимостьНУ(СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат, СуммаУслугРегл); 
					
					УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
						СтруктураШапкиДокумента, 
						ТаблицаЗатрат, 
						Перечисления.ВидыОтраженияВУчете.ОтражатьВРегламентированномУчете
					);
					
				КонецЕсли;
				
				// Сформируем проводку по бухгалтерскому учету.
				ПроизводственныеРасходы = УправлениеЗатратами.ПроверитьСчетЗатратНаПроизводственныеРасходы(СтруктураШапкиДокумента.СчетУчетаРасчетовСКонтрагентом);
				
				//Оплата посреднических услуг БУ
				Проводка = СтруктураДвижений.ПроводкиБУ.Добавить();
				
				Проводка.Период      = ДатаДвижений;
				Проводка.Организация = Организация;
				
				Проводка.СчетДт      = СчетУчетаРасчетовСКонтрагентом;
				
				Если ПроизводственныеРасходы Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Подразделения",        СтруктураШапкиДокумента.ПодразделениеОрганизацииЗатраты);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", СтруктураШапкиДокумента.НоменклатурнаяГруппа);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиЗатрат",         СтруктураШапкиДокумента.СтатьяЗатрат);
				Иначе
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоКт1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоКт2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоКт3);
				КонецЕсли;
				
				Проводка.СчетКт      = РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтруктураШапкиДокумента.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", РасшифровкаПлатежа[0].ДоговорКонтрагента);
				
				Проводка.Сумма       = СуммаУслугРегл;
				
				Проводка.НалоговоеНазначениеДт = СтруктураШапкиДокумента.НалоговоеНазначениеДоходовИЗатрат; 
				Проводка.СуммаНУДт = НалоговыйУчет.ОпределитьСтоимостьНУ(Проводка.НалоговоеНазначениеДт, Проводка.Сумма);
				
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Учет курсовых разниц
	Если (ВалютаДокумента <> ВалютаРег) тогда
		СтруктураПараметровКР = БухгалтерскийУчет.ПодготовкаСтруктурыПараметровДляПереоценкиСчета(Ссылка,Заголовок);
		
		Если ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетником"
			//Смартис Лиманчук начало 01.11.2012
			ИЛИ ВидОперацииИмя = "ВозвратДенежныхСредствПодотчетникомНал"
			//Смартис Лиманчук окончание 01.11.2012
			//Смартис Лиманчук начало 05.11.2012
			ИЛИ ВидОперацииИмя = "ВозвратДенежныхСредствРаботникомНал" 
			//Смартис Лиманчук окончание 05.11.2012
			ИЛИ ВидОперацииИмя = "ВозвратДенежныхСредствРаботником" Тогда
			// Отдельно переоценим счет взаиморасчетов с подотчетником на сумму возврата
			// Переоценка должна происходить до записи проводок документа
			СчетПереоценки = Новый Структура("Счет,Субконто1,ВалютныйОстаток", СчетУчетаРасчетовСКонтрагентом, Контрагент, СуммаДокумента);
			БухгалтерскийУчет.ПереоценкаСчетаРегл(СтруктураПараметровКР, СтруктураДвижений.ПроводкиБУ, СчетПереоценки, ВалютаРег, Истина, Истина, Истина);
		КонецЕсли;	
		
		СтруктураДвижений.ПроводкиБУ.Записать(Ложь);
		БухгалтерскийУчет.ПереоценкаСчетовДокументаРегл(СтруктураПараметровКР, СтруктураДвижений.ПроводкиБУ, ВалютаРег, Истина);

	КонецЕсли; // Учет курсовых разниц
	
	Если Ссылка.ОтражатьВБухгалтерскомУчете И (Оплачено ИЛИ НЕ Ссылка.ОтражатьВУправленческомУчете) Тогда
		
		ДвиженияПоЕдиномуНалогуРегл(СтруктураШапкиДокумента, СтруктураПараметров, СтруктураДвижений);
		
		Если    СтруктураШапкиДокумента.ЕстьНДС
			ИЛИ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Если ЕстьРасчетыСКонтрагентами и СтруктураПараметровДДС <> Ложь Тогда
				НалоговыйУчет.ДвиженияПоРегистрамНалоговогоУчетаОплата(СтруктураПараметровДДС,СтруктураДвижений,ВалютаРег,РежимПроведения,ЭтотОбъект,Отказ);
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			Для каждого КлючСтруктуры из СтруктураДвижений Цикл
				ДвижениеКЗаписи = СтруктураДвижений[КлючСтруктуры.Ключ];
				ДвижениеКЗаписи.Записать(Ложь);
			КонецЦикла;
			Возврат;
		КонецЕсли;
			
	КонецЕсли;	
	
	Для Каждого КлючСтруктуры из СтруктураДвижений Цикл
		ДвижениеКЗаписи = СтруктураДвижений[КлючСтруктуры.Ключ];
		ДвижениеКЗаписи.Записать(Ложь);
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ СОГЛАСОВАНИЯ ЗАЯВОК НА РАСХОД ДЕНЕЖНЫХ СРЕДСТВ

//Функция определяет маршрут согласования заявки на расходование средств по подразделению
Функция ОпределитьМаршрутСогласования(Подразделение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутСогласования,
	|	ВЫБОР КОГДА 
	|		Подразделение = &ТекПодразделение
	|		ТОГДА 0
	|	КОГДА Подразделение = &ПустоеПодразделение 
	|		ТОГДА 1
	|	КОНЕЦ КАК Приоритет
	|ИЗ РегистрСведений.НастройкиНачалаМаршрутовСогласования
	|ГДЕ
	|	(Подразделение = &ТекПодразделение) ИЛИ
	|	(Подразделение = &ПустоеПодразделение) 
	|УПОРЯДОЧИТЬ ПО Приоритет ВОЗР";
	Запрос.УстановитьПараметр("ТекПодразделение", Подразделение);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.Подразделения.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
КонецФункции

//Функция определяет, используется ли функционал согласования заявок по указанной организации на указанную дату
Функция ИспользуетсяСогласованиеЗаявок(ТекОрганизация, ТекДата) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекОрганизация) ИЛИ НЕ ЗначениеЗаполнено(ТекДата) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организация
	|ИЗ РегистрСведений.НастройкиСогласованияЗаявокНаРасходованиеДС.СрезПоследних(&ТекДата, Организация = &ТекОрганизация)
	|";
	Запрос.УстановитьПараметр("текОрганизация", ТекОрганизация);
	Запрос.УстановитьПараметр("текДата", ТекДата);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

//Функция проверяет, прошла ли заявка на расходование средств все этапы согласования
//	Вызывается при вводе на основании и проведении документов, оформляющих выплату ДС по заявке
//	Параметры: ПроверяемыеЗаявки (Ссылка на заявку либо массив со ссылками на документы ЗаявкаНаРасходованиеСредств)
//			Отказ - булево, признак отказа
//			Заголовок - строка, заголовок для вывода сообщений об ошибках
//	Возвращаемое значение: булево
Функция ПроверитьСогласованиеЗаявок(ПроверяемыеЗаявки, Отказ = Ложь, Заголовок = "") Экспорт
	Перем МассивЗаявок;
	
	МассивЗаявок = Новый Массив;
	Если ТипЗнч(ПроверяемыеЗаявки) = Тип("Массив") Тогда
		//включим в список только те заявки, для которых используется согласование
		Для Каждого ТекЗаявка ИЗ ПроверяемыеЗаявки Цикл
			Если НЕ ЗначениеЗаполнено(ТекЗаявка) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(ТекЗаявка.Организация, ТекЗаявка.Дата) Тогда
				Продолжить;
			КонецЕсли;
			МассивЗаявок.Добавить(ТекЗаявка);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПроверяемыеЗаявки) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(ПроверяемыеЗаявки.Организация, ПроверяемыеЗаявки.Дата) Тогда
			МассивЗаявок.Добавить(ПроверяемыеЗаявки);
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	Если МассивЗаявок.Количество() = 0 Тогда
		//нет заявок для которых используется согласование
		Возврат Истина;
	КонецЕсли;
	
	ЗаявкаСогласована = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|Заявка,
	|Уровень,
	|Состояние
	|ИЗ РегистрСведений.СостоянияСогласованияЗаявок.СрезПоследних(,Заявка В (&СписокЗаявок)) КАК СостоянияСогласованияЗаявок";
	
	Запрос.УстановитьПараметр("СписокЗаявок", МассивЗаявок);

	РезультатЗапроса = Запрос.Выполнить();
	Для Каждого ТекЗаявка ИЗ МассивЗаявок Цикл
		Выборка = РезультатЗапроса.Выбрать();
		Если НЕ Выборка.НайтиСледующий(Новый Структура("Заявка", ТекЗаявка)) Тогда
			ЗаявкаСогласована = Ложь;
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = '""" + СокрЛП(ТекЗаявка) + """ не утверждена. Ввод платежа по заявке невозможен'"), Отказ, Заголовок);
			Продолжить;
		КонецЕсли;
		Если Выборка.Состояние <> Перечисления.СостоянияОбъектов.Утвержден Тогда
			ЗаявкаСогласована = Ложь;
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = '""" + СокрЛП(ТекЗаявка) + """ не утверждена. Ввод платежа по заявке невозможен'"), Отказ, Заголовок);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗаявкаСогласована;
КонецФункции

//Функция проверяет разрешено ли изменение заявки с учетом ее состояния согласования
Функция РазрешеноИзменениеЗаявки(ДокументСсылка, ТекстСообщенияПользователю = "") Экспорт
	Если НЕ ИспользуетсяСогласованиеЗаявок(ДокументСсылка.Организация, ДокументСсылка.Дата) Тогда
		Возврат Истина;
	КонецЕсли;
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	//Получим маршруты согласования, в которых текущий пользователь назначен основным
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Ссылка КАК МаршрутСогласования
	|ПОМЕСТИТЬ МаршрутыТекущегоПользователя
	|ИЗ Справочник.МаршрутыСогласования.СогласующиеЛица
	|ГДЕ Пользователь = &ТекПользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|СостоянияСогласования.Состояние,
	|СостоянияСогласования.Этап,
	|СостоянияСогласования.Пользователь,
	|СостоянияСогласования.Уровень,
	|СогласующиеЛица.Пользователь 			КАК СледующийСогласующий,
	|ВЫБОР КОГДА 
	|		СостоянияСогласования.Этап В ИЕРАРХИИ 
	|			(ВЫБРАТЬ МаршрутСогласования ИЗ МаршрутыТекущегоПользователя)
	|		И СостоянияСогласования.Этап НЕ В 
	|			(ВЫБРАТЬ МаршрутСогласования ИЗ МаршрутыТекущегоПользователя)
	|ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ 			КАК НижестоящийЭтапСогласования
	|ИЗ РегистрСведений.СостоянияСогласованияЗаявок.СрезПоследних(,Заявка = &ТекущаяЗаявка) КАК СостоянияСогласования
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.МаршрутыСогласования.СогласующиеЛица КАК СогласующиеЛица
	|	ПО СогласующиеЛица.Ссылка = СостоянияСогласования.Этап.Родитель
	|";
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяЗаявка", ДокументСсылка);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапросов[1].Выбрать();
	//Маршрут согласования заявки не определен
    //ИЗМЕНЕНО Верескул Игорь(Начало 05.03.2018
	Если НЕ Выборка.Следующий() ИЛИ РольДоступна("ПолныеПрава")  Тогда
		Возврат Истина;
	КонецЕсли;
	//Заявка еще не начала проходить по маршруту согласования
	Если НЕ ЗначениеЗаполнено(Выборка.Состояние) ИЛИ Выборка.Состояние = Перечисления.СостоянияОбъектов.Подготовлен Тогда
		Возврат Истина;
	//Заявка уже согласована к оплате
	
	ИначеЕсли Выборка.Состояние = Перечисления.СостоянияОбъектов.Утвержден И НЕ РольДоступна("ПолныеПрава") Тогда
	//Окончание)Верескул Игорь 
		ТекстСообщенияПользователю = НСтр("ru = 'Утвержденная заявка не может быть изменена.'");
		Возврат Ложь;
	Иначе
		//Заявка проходит по маршруту согласования. 
		//	Возможность изменения зависит от пользователя, который пытается изменить заявку
		//Заявка в процессе согласования у текущего пользователя (в состоянии Отложен или Отклонен)
		Если Выборка.Пользователь = ТекущийПользователь И 
			(Выборка.Состояние = Перечисления.СостоянияОбъектов.Отклонен ИЛИ
			Выборка.Состояние = Перечисления.СостоянияОбъектов.Отложен) Тогда
			Возврат Истина;
		//Заявка перешла на согласование текущему пользователю
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияОбъектов.Согласован И 
			(Выборка.СледующийСогласующий = ТекущийПользователь) Тогда
			Возврат Истина;
		//Заявка находится на согласовании у "нижестоящих" этапов согласования
		ИначеЕсли Выборка.НижестоящийЭтапСогласования Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	ТекстСообщенияПользователю = НСтр("ru = 'Заявка в процессе согласования, не может быть изменена.'");
	Возврат Ложь;
КонецФункции

//Процедура обработчик подписки на событие "ПриПроведенииПлатежногоДокументаНаОснованииЗаявки"
//	Выполняет проверку: согласованы ли заявки на расходование денежных средств, указанные в платежном документе
Процедура ПриПроведенииПлатежногоДокументаНаОснованииЗаявки(Источник, Отказ, РежимПроведения) Экспорт
	Если НЕ ИспользуетсяСогласованиеЗаявок(Источник.Организация, Источник.Дата) Тогда
		Возврат;
	КонецЕсли;
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Источник);
	МассивЗаявокНаРасходДенежныхСредств = Источник.РасшифровкаПлатежа.ВыгрузитьКолонку("ДокументПланированияПлатежа");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивЗаявокНаРасходДенежныхСредств);
	ПроверитьСогласованиеЗаявок(МассивЗаявокНаРасходДенежныхСредств, Отказ, Заголовок);
КонецПроцедуры


