
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкВидыЗаданий.Ссылка
	|ИЗ
	|	Справочник.кпкВидыЗаданий КАК кпкВидыЗаданий
	|ГДЕ
	|	кпкВидыЗаданий.Наименование = &Наименование
	|	И кпкВидыЗаданий.Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", 	  ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В справочнике уже есть элемент с таким наименованием! Задайте другое наименование!");
		Отка = Истина;
	КонецЕсли;
	
КонецПроцедуры
