
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаИРазмещение") Тогда
		// Заполнение шапки
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
		ПоставщикПолучатель = ДанныеЗаполнения.Поставщик;
		Склад = ДанныеЗаполнения.Склад;
		//	Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаРазмещение из ДанныеЗаполнения.Размещение Цикл
			НоваяСтрока = Задание.Добавить();
			НоваяСтрока.ВидЯчейки = ТекСтрокаРазмещение.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаРазмещение.ЕдиницаИзмерения;
			НоваяСтрока.Зона = ТекСтрокаРазмещение.Зона;
			НоваяСтрока.Количество = ТекСтрокаРазмещение.Количество;
			НоваяСтрока.КоличествоФакт = ТекСтрокаРазмещение.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаРазмещение.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекСтрокаРазмещение.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекСтрокаРазмещение.ЯчейкаПлан;
			НоваяСтрока.КоличествоФакт  = ТекСтрокаРазмещение.Количество;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтборИОтгрузка") Тогда
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
		ПоставщикПолучатель = ДанныеЗаполнения.Получатель;
		Склад = ДанныеЗаполнения.Склад;
		//Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаОтбор из ДанныеЗаполнения.Отбор Цикл
			
			НоваяСтрока = Задание.Добавить();
			НоваяСтрока.ВидЯчейки = ТекстрокаОтбор.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекстрокаОтбор.ЕдиницаИзмерения;
			НоваяСтрока.Зона = ТекстрокаОтбор.Зона;
			НоваяСтрока.Количество = ТекстрокаОтбор.Количество;
			НоваяСтрока.КоличествоФакт = ТекстрокаОтбор.Количество;
			НоваяСтрока.Номенклатура = ТекстрокаОтбор.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекстрокаОтбор.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекстрокаОтбор.ЯчейкаПлан;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеПоСкладу") Тогда
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Перемещение;//Приемка;
		//ДокументЗаданиеНаРаботу.ПоставщикПолучатель = Поставщик;
		Склад = ДанныеЗаполнения.Склад;
		//Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаПеремещение из ДанныеЗаполнения.Перемещение Цикл
			НоваяСтрока = Задание.Добавить();
			//НоваяСтрока.ВидЯчейки = ТекстрокаПеремещение.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекстрокаПеремещение.ЕдиницаХраненияОстатков;
			//				НоваяСтрока.Зона = ТекстрокаПеремещение.Зона;
			НоваяСтрока.Количество = ТекстрокаПеремещение.КоличествоКПеремещению;
			НоваяСтрока.КоличествоФакт = ТекстрокаПеремещение.КоличествоФактическиПеремещенное;
			НоваяСтрока.Номенклатура = ТекстрокаПеремещение.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекстрокаПеремещение.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекстрокаПеремещение.ЯчейкаПланКуда;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
Процедура ЗаполнениеШапкиДокумента(Основание, ТекИсполнитель)
    Организация = Основание.Организация;
    ДокументОснование = Основание.Ссылка;
    Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемкаИРазмещение") Тогда
        ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
        ПоставщикПолучатель = Основание.Поставщик;
        Склад = Основание.Склад;
        Исполнитель = ТекИсполнитель;
    КонецЕсли; 
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Если ЗначениеЗаполнено(ВремяОкончанияОбработки) Тогда
        Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеПоСкладу") Тогда
            ДокПеремещение = ДокументОснование.ПолучитьОбъект();
            ДокПеремещение.Статус =Перечисления.СтатусыСкладскихПеремещений.Завершено;
            ДокПеремещение.Записать(РежимЗаписиДокумента.Проведение);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

