// Возвращает структуру параметров, необходимых для инициализации
// конфигурации на клиенте.
// 
Функция ПараметрыРаботыКлиента() Экспорт
	
	Параметры = Новый Структура();
	
	ПользователюРазрешенЗапускКонфигурации = УправлениеПользователямиСервер.ПользователюРазрешенЗапускКонфигурации();
	Параметры.Вставить("ПользователюРазрешенЗапускКонфигурации", ПользователюРазрешенЗапускКонфигурации);
	
	Если НЕ ПользователюРазрешенЗапускКонфигурации Тогда
		// Дальше нет необходимости выполнения, т.к. могут быть ошибки нарушения прав
		Возврат Параметры;
	КонецЕсли; 
		
	// СтандартныеПодсистемы
	Параметры.Вставить("НеобходимоОбновлениеИнформационнойБазы", 
		НЕ ПустаяСтрока(Метаданные.Версия) 
		И Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия);
		
	Параметры.Вставить("ТекущийПользователь", Строка(ПараметрыСеанса.ТекущийПользователь));
	Параметры.Вставить("ЗаголовокПриложения", СокрЛП(Константы.ЗаголовокСистемы.Получить()));
		
	// Конец СтандартныеПодсистемы

	Возврат Параметры;
	
КонецФункции	