////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

Процедура АвтозаполнениеСписаниеДепонента() Экспорт 
	
	// Заполнение ТЧ Зарплата и Работники
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамДата",	Дата);
	Запрос.УстановитьПараметр("парамНачало", СписаниеДепонентаНаДату);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Взаиморасчеты.Сотрудник			КАК Сотрудник,
	|	Взаиморасчеты.Ведомость			КАК Ведомость,
	|	Взаиморасчеты.СуммаОстаток		КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки( &парамДата,
	|			Организация = &парамОрганизация	И	Ведомость.ПериодРегистрации <= &парамНачало
	|    ) КАК Взаиморасчеты
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Работники.Загрузить( Запрос.Выполнить().Выгрузить() );
	
КонецПроцедуры // Автозаполнение_ОсновнаяВыплата()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("Задепонировано", Перечисления.ВыплаченностьЗарплаты.Задепонировано);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Депонирование.Дата,
	|	Депонирование.Ссылка,
	|	Депонирование.Организация,
	|	ВЫБОР
	|		КОГДА Депонирование.Организация.ГоловнаяОрганизация = &ПустаяОрганизация
	|			ТОГДА Депонирование.Организация
	|		ИНАЧЕ Депонирование.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация
	|ИЗ
	|	Документ.СписаниеДепонентовВДоходыОрганизаций КАК Депонирование
	|ГДЕ
	|	Депонирование.Ссылка = &ДокументСсылка";

	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура выполняет движение по регистру ВзаиморасчетыСДепонентамиОрганизаций  и проводки по Бухгалтерскому учету
//
Процедура ВыполнитьДвиженияПоСписаниюЗарплаты()

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Депоненты.Ссылка.Организация	КАК Организация,
	|	Депоненты.Ссылка.Дата			КАК Период,
	|	Депоненты.Сотрудник				КАК Сотрудник,
	|	Депоненты.Ведомость				КАК Ведомость,
	|	Депоненты.Сумма					КАК Сумма
	|        
	|ИЗ	Документ.СписаниеДепонентовВДоходыОрганизаций.Работники КАК Депоненты
	|
	|ГДЕ Депоненты.Ссылка = &Ссылка
	|
	|";
	
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// 1. ВзаиморасчетыСДепонентамиОрганизаций
		НоваяСтрока = Движения.ВзаиморасчетыСДепонентамиОрганизаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Расход;
		
		
		Если  ОтражатьВБухгалтерскомУчете Тогда
			// 2. проводки, надо закрыть 662 счет
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период      = Дата;
			Проводка.Активность  = Истина;
			Проводка.Организация = Организация;
			Проводка.Содержание  = "Списние депонентов на доходы";
			Проводка.Сумма       = Выборка.Сумма;
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РасчетыПоДепонентам;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизации", Выборка.Сотрудник.ФизЛицо);
			
			Проводка.СчетКт      = СчетУчетаРасходов;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Субконто3);
			
			Проводка.НалоговоеНазначениеКт = НалоговоеНазначениеДоходовИЗатрат;
			Проводка.СуммаНУКт = НалоговыйУчет.ОпределитьСтоимостьНУ(Проводка.НалоговоеНазначениеКт, Выборка.Сумма); 
			
			
		КонецЕсли;
		
			
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьДвиженияПоСписаниюЗарплаты()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = Работники.Итог("Сумма");
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Работники,, "Сотрудник");
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(Работники);

КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, Режим)

	ПроводкиБУ = Движения.Хозрасчетный;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		Если НЕ Отказ Тогда

			ВыполнитьДвиженияПоСписаниюЗарплаты();
								
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
