// Возвращает код языка интерфейса в формате ru/uk
Функция КодЯзыкаИнтерфейса() Экспорт
	
	Возврат ТекущийЯзык().КодЯзыка;
	
КонецФункции // КодЯзыкаИнтерфейса()

//По коду языка возвращает строку параметров прописи из справочника Валюты 
//(ПараметрыПрописиНаРусском или ПараметрыПрописиНаУкраинском).
Функция ПараметрыПрописи(Валюта, КодЯзыка) Экспорт
	
	Рез = ?(КодЯзыка = "uk",Валюта.ПараметрыПрописиНаУкраинском,Валюта.ПараметрыПрописиНаРусском);
	Если Рез = "" Тогда
		ОбщегоНазначения.СообщитьСлужебнуюИнформацию("Для валюты " + Валюта + " не установлены параметры прописи для кода языка " + КодЯзыка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ПараметрыПрописи()

// Возвращает код языка информационной базы, который указан 
// в региональных настройках (в конфигураторе)
Функция КодЯзыкаИнформационнойБазы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	Возврат ?(КодЛокализации() = "uk_UA","uk","ru");	
	
КонецФункции //КодЯзыкаИнформационнойБазы()

// Функция возвращает имя языка для формирования нерегламент печатных форм
// документов и некоторых справочников с учетом установленного режима в настройках
// пользователя. По-умолчанию это язык информционной базы.
//
// Параметры
//     	РежимПользователя - Установленное значение в настройках пользователя
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФорм(РежимПользователя = Неопределено) Экспорт

	
	Если РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = КодЯзыкаИнтерфейса();
		
	Иначе// РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		 // или по - умолчанию
		 
		КодЯзыкаПечать = КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормироваияПечатныхФорм()
	
//Преобразует код языка в формат понятный системной фунции Формат()
// Параметры
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
// Возвращаемое значение:
//   Строка   	 – код языка в формате ru_RU/uk_UA
//
Функция ОпределитьКодЯзыкаДляФормат(КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
КонецФункции // ОпределитьКодЯзыкаДляФормат()

//Если параметр КодЯзыка совпадает с кодом языка интерфейса (язКодЯзыкаИнтерфейса()),
//	то представление получается через ОбъектМетаданных.Представление()
//Если не совпадает, то возвращаются синонимы в зависимости от имени объекта
// 
// Параметры
//  Объект		 - Ссылка на объект, для которого нужно получить перевод
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
Функция ПолучитьЛокализованныйСинонимОбъекта(Ссылка, КодЯзыка) Экспорт

	МетаданныеДляСсылки = Ссылка.Метаданные();
	ПолноеИмяОбъектаМетаданных = МетаданныеДляСсылки.ПолноеИмя();
	
	Если Метаданные.Документы.Содержит(МетаданныеДляСсылки) Тогда
		Если КодЯзыка = КодЯзыкаИнтерфейса() Тогда
			// "переводить" не нужно
			Возврат МетаданныеДляСсылки.Представление();
		КонецЕсли;
		// это документ
		ИмяДляПеревода = МетаданныеДляСсылки.Имя;
	ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеДляСсылки) Тогда
		// это перечисление
		Если КодЯзыка = КодЯзыкаИнтерфейса() Тогда
			// "переводить" не нужно
			Возврат Строка(Ссылка);
		КонецЕсли;
		// имя элемента перечисления получить из метаданных "трудно", 
		// поэтому для перевода будем использовать синоним на языке интерфейса		
		Если Ссылка = Перечисления[МетаданныеДляСсылки.Имя].ПустаяСсылка() Тогда 
			Возврат ""; 
		КонецЕсли;
		ИндексЗначения = Перечисления[МетаданныеДляСсылки.Имя].Индекс(Ссылка);
		ИмяДляПеревода = МетаданныеДляСсылки.ЗначенияПеречисления[ИндексЗначения].Имя;
	КонецЕсли; 
	
	РезультатПеревода = "";
	РезультатПеревода = ОбработатьПереводы(ПолноеИмяОбъектаМетаданных, ИмяДляПеревода, КодЯзыка);
	
	Возврат РезультатПеревода;
КонецФункции // ПредставлениеОбъекта()

// Возвращает представление объекта на указанном языке
// Фактически обрабатываются документы и перечисления
// Параметры
//  Ссылка    – <произвольный>
//  КодЯзыка  – <строка> – код языка
//
// Возвращаемое значение:
//   <Строка>   – представление объекта
//
Функция ПолучитьЛокализованноеПредставление(Ссылка, КодЯзыка) Экспорт

	ТипЗначенияСсылки = ТипЗнч(Ссылка);
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗначенияСсылки) Тогда
		// это документ
		Возврат ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка, ПолучитьЛокализованныйСинонимОбъекта(Ссылка, КодЯзыка), КодЯзыка);
		
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначенияСсылки) Тогда

		Возврат ПолучитьЛокализованныйСинонимОбъекта(Ссылка, КодЯзыка);
		
	Иначе
		
		Возврат Строка(Ссылка);
		
	КонецЕсли;	
	
КонецФункции // ПолучитьЛокализованноеПредставление()

Функция ОбработатьПереводы(ПолноеИмяОбъектаМетаданных, ИмяДляПеревода, КодЯзыка)
	
		Если ПолноеИмяОбъектаМетаданных = "Документ.АвансовыйОтчет" Тогда 
			Возврат НСтр( "ru='Авансовый отчет';uk='Авансовий звіт';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОбОказанииПроизводственныхУслуг" Тогда 
			Возврат НСтр( "ru='Акт об оказании производственных услуг';uk='Акт про надання послуг з виробництва';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковОС" Тогда 
			Возврат НСтр( "ru='Ввод начальных остатков по ОС';uk='Введення інформації про початкові залишки ОЗ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтПокупателя" Тогда 
			Возврат НСтр( "ru='Возврат товаров от покупателя';uk='Повернення товарів від покупців';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровПоставщику" Тогда 
			Возврат НСтр( "ru='Возврат товаров поставщику';uk='Повернення товарів постачальнику';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДокументРасчетовСКонтрагентом" Тогда 
			Возврат НСтр( "ru='Документ расчетов с контрагентом (ручной учет)';uk='Документ розрахунків з покупцем (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПокупателя" Тогда 
			Возврат НСтр( "ru='Заказ покупателя';uk='Замовлення покупця';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" Тогда 
			Возврат НСтр( "ru='Заказ поставщику';uk='Замовлення постачальникові';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияТоваровНаСкладе" Тогда 
			Возврат НСтр( "ru='Инвентаризация товаров на складе';uk='Інвентаризація товарів на складі';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаДолга" Тогда 
			Возврат НСтр( "ru='Корректировка долга';uk='Коректування боргу';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомиссионераОПродажах" Тогда 
			Возврат НСтр( "ru='Отчет комиссионера о продажах';uk='Звіт комісіонера про продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомитентуОПродажах" Тогда 
			Возврат НСтр( "ru='Отчет комитенту о продажах товаров';uk='Звіт комітенту про продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОРозничныхПродажах" Тогда 
			Возврат НСтр( "ru='Отчет о розничных продажах';uk='Звіт про роздрібний продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПроизводстваЗаСмену" Тогда 
			Возврат НСтр( "ru='Отчет производства за смену';uk='Звіт виробництва за зміну';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Партия" Тогда 
			Возврат НСтр( "ru='Партия (ручной учет)';uk='Партія (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПартияМалоценкиВЭксплуатации" Тогда 
			Возврат НСтр( "ru='Партия малоценки в эксплуатации (ручной учет)';uk='Партія малоцінки (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаМалоценкиВЭксплуатацию" Тогда 
			Возврат НСтр( "ru='Передача малоценки в эксплуатацию';uk='Передача малоцінки у експлуатацію';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаОС" Тогда 
			Возврат НСтр( "ru='Передача ОС';uk='Передача ОС ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеВходящее" Тогда 
			Возврат НСтр( "ru='Платежное поручение входящее';uk='Платіжне доручення отримане';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеИсходящее" Тогда 
			Возврат НСтр( "ru='Платежное поручение исходящее';uk='Платіжне доручення ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерПоступлениеДенежныхСредств" Тогда 
			Возврат НСтр( "ru='Платежный ордер, поступление денежных средств';uk='Платіжний ордер, надходження грошових коштів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерСписаниеДенежныхСредств" Тогда 
			Возврат НСтр( "ru='Платежный ордер, списание денежных средств';uk='Платіжний ордер, списання грошових коштів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеДопРасходов" Тогда 
			Возврат НСтр( "ru='Поступление доп. расходов';uk='Надходження дод. витрат';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеТоваровУслуг" Тогда 
			Возврат НСтр( "ru='Поступление товаров и услуг';uk='Надходження товарів та послуг';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйКассовыйОрдер" Тогда 
			Возврат НСтр( "ru='Приходный кассовый ордер';uk='Прибутковий касовий ордер';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасходныйКассовыйОрдер" Тогда 
			Возврат НСтр( "ru='Расходный кассовый ордер';uk='Видатковий касовий ордер';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг" Тогда 
			Возврат НСтр( "ru='Реализация товаров и услуг';uk='Реалізація товарів та послуг';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияУслугПоПереработке" Тогда 
			Возврат НСтр( "ru='Реализация услуг по переработке';uk='Реалізація послуг з переробки';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СертификацияНоменклатуры" Тогда 
			Возврат НСтр( "ru='Сертификация номенклатуры';uk='Сертифікація номенклатури';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПокупателю" Тогда 
			Возврат НСтр( "ru='Счет на оплату покупателю';uk='Рахунок на оплату покупцю';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПоставщика" Тогда 
			Возврат НСтр( "ru='Счет на оплату поставщика';uk='Рахунок на оплату постачальника';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" Тогда 
			Возврат НСтр( "ru='Перемещение товаров';uk='Переміщення товарів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаТоваров" Тогда 
			Возврат НСтр( "ru='Передача товаров';uk='Передача товарів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйОрдерНаТовары" Тогда 
			Возврат НСтр( "ru='Приходный ордер на товары';uk='Прибутковий ордер на товари';" ,КодЯзыка);
		КонецЕсли;	

		Если ПолноеИмяОбъектаМетаданных = "Перечисление.ПолФизическихЛиц" Тогда 
			Если ИмяДляПеревода = "Женский" Тогда 
				Возврат НСтр( "uk='Жіночий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мужской" Тогда 
				Возврат НСтр( "ru='Мужской';uk='Чоловічий';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтавкиНДС" Тогда 
			Если ИмяДляПеревода = "БезНДС" Тогда 
				Возврат НСтр( "ru='Без НДС';uk='Без ПДВ';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС0" Тогда 
				Возврат НСтр( "ru='0%';uk='0%';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС20" Тогда 
				Возврат НСтр( "ru='20%';uk='20%';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДС" Тогда 
				Возврат НСтр( "ru='Не НДС';uk='Не ПДВ';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСкладов" Тогда 
			Если ИмяДляПеревода = "Оптовый" Тогда 
				Возврат НСтр( "ru='Оптовый';uk='Гуртовий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розничный" Тогда 
				Возврат НСтр( "ru='Розничный';uk='Роздрібний';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииОС" Тогда 
			Если ИмяДляПеревода = "Прямолинейный" Тогда 
				Возврат НСтр( "ru='Прямолинейный';uk='Прямолінійний';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Налоговый" Тогда 
				Возврат НСтр( "ru='Налоговый';uk='Податковий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшенияОстатка" Тогда 
				Возврат НСтр( "ru='Уменьшения остатка';uk='Зменьшення залишку';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр( "ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Производственный" Тогда 
				Возврат НСтр( "ru='Производственный';uk='Виробничий';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ПоИндивидуальномуГрафику" Тогда 
				Возврат НСтр( "ru='По индивидуальному графику амортизации';uk='За особистим графіком амортизації';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр( "ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку ';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "_100" Тогда 
				Возврат НСтр( "ru='100%';uk='100%';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "_50_50" Тогда 
				Возврат НСтр( "ru='50% - 50%';uk='50% - 50%';" ,КодЯзыка);	
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиНДС" Тогда 
			Если ИмяДляПеревода = "Облагаемая" Тогда 
				Возврат НСтр( "ru='Облагаемая';uk='Оподатковувана';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Необлагаемая" Тогда 
				Возврат НСтр( "ru='Необлагаемая';uk='Неоподатковувана';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ЧастичноОблагаемая" Тогда 
				Возврат НСтр( "ru='Частично облагаемая';uk='Частково оподатковувана';" ,КодЯзыка);	
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерВыплатыПоДоговору" Тогда 
			Если ИмяДляПеревода = "ОднократноВКонцеСрока" Тогда 
				Возврат НСтр( "ru='Однократно в конце срока';uk='Однократно наприкінці терміну';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ежемесячно" Тогда 
				Возврат НСтр( "ru='Ежемесячно';uk='Щомісяця';" ,КодЯзыка);		
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "Наличные" Тогда 
				Возврат НСтр( "ru='Наличные';uk='Готівка';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Безналичные" Тогда 
				Возврат НСтр( "ru='Безналичные';uk='Безготівка';" ,КодЯзыка);		
			КонецЕсли;	
			
			
		КонецЕсли;	

КонецФункции //ОбработатьПереводы()

// Функция возвращает текстовую строку, сформированную на основании спец. шаблона,
// подставляя значения переданных параметров.	
// 
// Параметры
//  СтрокаШаблон – Строка – Строка шаблон, в тексте которой
//                 есть указания на то, куда вставить представления 
//                 параметров. 
//                 Параметры отмечаются текстом ¤1¤...¤20¤.
//                 Символ "¤" можно набрать при помощи Alt+0164
//  Пар1...Пар20 – произвольного типа – параметры,
//                 строковое представление которых будет 
//                 подставлятся в шаблон.
//
// Возвращаемое значение:
//   Строка   – сформированная текстовая строка
//
Функция СтрШаблон(Знач СтрокаШаблон, 
										Знач Пар1  = "", Знач Пар2  = "",
										Знач Пар3  = "", Знач Пар4  = "", Знач Пар5  = "",
										Знач Пар6  = "", Знач Пар7  = "", Знач Пар8  = "",
										Знач Пар9  = "", Знач Пар10 = "", Знач Пар11 = "",
										Знач Пар12 = "", Знач Пар13 = "", Знач Пар14 = "",
										Знач Пар15 = "", Знач Пар16 = "", Знач Пар17 = "",
										Знач Пар18 = "", Знач Пар19 = "", Знач Пар20 = "") Экспорт
										
	ПризнакПараметра = "¤";
	МетаСимвол       = "\¤"; //заменяется на признак параметра
	
	Для Счетчик = 1 По 20 Цикл
			
		ПерваяПозицияВхожденияПараметра = Найти(СтрокаШаблон, ""+ ПризнакПараметра + Счетчик + ПризнакПараметра);
				
		Если ПерваяПозицияВхожденияПараметра = 0 Тогда
			// этот параметр не используется
			Продолжить;	
		КонецЕсли; 
				
		ПараметрВСтроку = "";
		Выполнить("ПараметрВСтроку = Строка(Пар" + Счетчик + ")");
				
		СтрокаШаблон = СтрЗаменить(СтрокаШаблон, ПризнакПараметра + Счетчик + ПризнакПараметра, ПараметрВСтроку);
				
	КонецЦикла;									
		
	ПозицияМетаСимвола = СтрЗаменить(СтрокаШаблон, МетаСимвол,ПризнакПараметра);

	Возврат СтрокаШаблон;
	
КонецФункции //СтрШаблон()
