Процедура ОтправкаСообщенияВТелеграм(СтрокаСообщения, Пользователь) Экспорт
    Токен = "2060190861:AAF6f0QVUQrEMZnh-cLEZ-oSpeNcoweV26w";
    chat_id = ПолучитьИдПользвателяТелеграм(Пользователь);
      
	Если chat_id = "" Тогда
		Сообщить("Пользователь не подключен к телеграм боту!");
        Возврат;	
    КонецЕсли; 
    ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows);
    HTTPСоединение = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
 
    Ресурс = "/bot" + Токен + "/sendMessage?chat_id=" + chat_id + "&text= " + СтрокаСообщения;
    HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
    Попытка 
        ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
    Исключение
        ЗаписьЖурналаРегистрации ("Ошибка подключения к телеграм!",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка подключения к телеграм!");
    КонецПопытки; 
КонецПроцедуры

Функция ПолучитьИдПользвателяТелеграм(Пользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект", Пользователь);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000044"));
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Представление;
	КонецЕсли; 
	Возврат Неопределено; 
КонецФункции
 