&НаКлиенте
Перем БазоваяЕдиницаНоменклатурыНаименование;

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
        Возврат;
	КонецЕсли;	
	
	ДоступностьПорогаОкругления = (ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры <> Объект.ЕдиницаПоКлассификатору);
	
	Элементы.ПорогОкругления.Доступность = ДоступностьПорогаОкругления;
    Элементы.ПредупреждатьОНецелыхМестах.Доступность = ДоступностьПорогаОкругления;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформационныеНадписи()
	
	Если Объект.ПорогОкругления = 0 Тогда
		Элементы.ИнформацияОбОкруглении.Заголовок = "(в сторону уменьшения)";
	Иначе
	    Элементы.ИнформацияОбОкруглении.Заголовок = "("+Объект.ПорогОкругления+" "+ БазоваяЕдиницаНоменклатурыНаименование +" и более = 1 "+СокрЛП(Объект.Наименование)+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.ЕдиницаПоКлассификатору);
	
	УстановитьДоступность();
	Если ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры = Объект.ЕдиницаПоКлассификатору Тогда
		Объект.ПорогОкругления = 0;
		Объект.ПредупреждатьОНецелыхМестах = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорогОкругленияПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Если Объект.Коэффициент = 0 Тогда
			Объект.Коэффициент = 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) Тогда
			Объект.ЕдиницаПоКлассификатору = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяЕдиницаПоКлассификатору");
		КонецЕсли;

	КонецЕсли;
	
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
		Элементы.Вес.Заголовок = "Вес (" + СокрЛП(ЕдиницаИзмеренияВеса)+")";
	КонецЕсли;

	ЕдиницаИзмеренияОбъема = Константы.ЕдиницаИзмеренияОбъема.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияОбъема) Тогда
		Элементы.Объем.Заголовок = "Объем (" + СокрЛП(ЕдиницаИзмеренияОбъема) +")";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
    	БазоваяЕдиницаНоменклатуры = Объект.Владелец.БазоваяЕдиницаИзмерения;
		БазоваяЕдиницаНоменклатурыНаименование = СокрЛП(БазоваяЕдиницаНоменклатуры);
		Элементы.Коэффициент.Заголовок = "Содержит (" + БазоваяЕдиницаНоменклатурыНаименование +")";
	КонецЕсли;
	
	ЭтоЕдиницаИзмеренияНоменклатуры = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура"));
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
		Элементы.ПорогОкругления.Видимость = ложь;
		Элементы.ИнформацияОбОкруглении.Видимость = ложь;
		Элементы.ПредупреждатьОНецелыхМестах.Видимость = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры

