
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КоличествоЗаписей = ЭтотОбъект.Количество();

	Если КоличествоЗаписей > 0 Тогда
		Для Сч = 0 По КоличествоЗаписей -1  Цикл
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект[Сч].Организация) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнена организация", Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект[Сч].ДатаНачалаДействия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнена дата начала действия отложенного проведения", Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект[Сч].НастройкаДопроведенияДокументов) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнена настройка допроведения документов", Отказ);
			КонецЕсли;
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
