// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаписатьОсновнуюСпецификациюИОбновитьСписок(Спецификация, ДатаЗаписи)

	УправлениеПроизводством.ЗаписатьОсновнуюСпецификацию(Спецификация, ДатаЗаписи, Номенклатура);
	
	ОсновнаяСпецификацияНоменклатуры = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(Номенклатура, Неопределено, ТекущаяДата());
	СпецификацииНоменклатуры.Параметры.УстановитьЗначениеПараметра("ОсновнаяСпецификацияНоменклатуры", ОсновнаяСпецификацияНоменклатуры);
	
КонецПроцедуры
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	СпецификацииНоменклатуры.Параметры.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);
	
	ОсновнаяСпецификацияНоменклатуры = УправлениеПроизводством.ОпределитьСпецификациюПоУмолчанию(Номенклатура, Неопределено, ТекущаяДата());
	СпецификацииНоменклатуры.Параметры.УстановитьЗначениеПараметра("ОсновнаяСпецификацияНоменклатуры", ОсновнаяСпецификацияНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновнойСпецификацией(Команда)
	
	ТекущаяСтрока = Элементы.СпецификацииНоменклатуры.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СпецификацииНоменклатуры.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.Активная Тогда
		Предупреждение("Основной может быть только активная спецификация");
		Возврат;
	КонецЕсли;
	
	ДатаЗаписи = ТекущаяДата();
	Если НЕ ВвестиДату(ДатаЗаписи, "Введите дату", ЧастиДаты.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОсновнуюСпецификациюИОбновитьСписок(ТекущаяСтрока, ДатаЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура СпецификацииНоменклатурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование И НЕ Группа Тогда
		
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("Основание", Номенклатура);
		ОткрытьФорму("Справочник.СпецификацииНоменклатуры.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры
