////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ ПРИ ПРОВЕДЕНИИ ПРАВИЛЬНОСТИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ

// Проверяет, что организация в документе совпадает с организацией, указанной в договоре взаиморасчетов.
//  при несовпадении устанавливается флаг отказа в проведении.
//
// Параметры:
//  Организация           - ссылка на организацию, выбранную в документе,
//  ДоговорКонтрагента - ссылка на договор, выбранный в документе,
//  ДоговорОрганизация    - ссылка на Организацию, выбранную в договоре,
//  Отказ                 - флаг отказа в проведении.
//  Заголовок             - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, 
	                                                  ДоговорОрганизация, Отказ, Заголовок) Экспорт

	// Если не заполнен договор или организация, то не ругаемся.
	//ИЗМЕНЕНО Верескул Игорь(Начало 09.12.2020 НПТ
	Если ЗначениеЗаполнено(Организация) 
	   И ЗначениеЗаполнено(ДоговорКонтрагента)
	   И Организация <> ДоговорОрганизация Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);
	КонецЕсли;	
	//Окончание)Верескул Игорь 

КонецПроцедуры // ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов()

// Для документов, у которых договор контрагента находится в табличной части
// что организация в документе совпадает с организацией, указанной в договоре взаиморасчетов.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - табличная часть документа,
//  ТаблицаЗначений   - таблица значений, содержащая данные табличной части,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ТаблицаЗначений, 
                                                    Отказ, Заголовок) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	// Цикл по строкам таблицы значений.
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

		// Если не заполнен договор или организация, то не ругаемся.
		//ИЗМЕНЕНО Верескул Игорь(Начало 09.12.2020 НПТ
		Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
		   И ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента)
		   И ДокументОбъект.Организация <> СтрокаТаблицы.ДоговорОрганизация Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке 
			                 + " выбран договор контрагента, не соответствующий организации, указанной в документе!", Отказ, Заголовок);
		КонецЕсли;		
		//Окончание)Верескул Игорь 
	КонецЦикла;

КонецПроцедуры // ПроверитьОрганизациюДоговораВзаиморасчетовВТабличнойЧасти()

// Для документов, у которых договор контрагента и сделка находятся в табличной части
// (например, "Авансовый отчет", "Корректировка долга") проверяет заполнена ли сделка, если
// в договоре взаиморасчетов установлено ведение взаиморасчетов по заказам.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - табличная часть документа,
//  ТаблицаЗначений   - таблица значений, содержащая данные табличной части и признак услуги
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьСделкуВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ТаблицаЗначений, 
                                                    Отказ, Заголовок) Экспорт

	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();

	// Цикл по строкам таблицы значений.
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл

	    СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + ПредставлениеТабличнойЧасти + """: ";

	    Если (СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		  ИЛИ СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) 
		   И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) Тогда

				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "выбран договор, по которому взаиморасчеты ведутся по заказам. " +
				                   "Необходимо заполнить заказ поставщику!", Отказ, Заголовок);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПроверитьСделкуВТабличнойЧасти()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ 

// Вычисляет текущий долг контрагента по заданному договору и сделке в валюте взаиморасчетов 
// по данному договору
//
// Параметры: 
//  Договор - ссылка на элемент справочника, определяет договор контрагента, по которому надо получить долг, 
//  Сделка  - ссылка на документ, определяет сделку (заказ, накладную, платежный документ) по которому надо получить долг.
//  СсылкаДокумент           - ссылка на документ, для которого рассчитывается долг.
//
// Возвращаемое значение:
//  Число -  текущий размер долга, если удалось вычислить текущий долг, иначе - 0.
//
Функция ТекущийДолг(Договор, Сделка = Неопределено, СсылкаДокумент) Экспорт

	ТекущийДолг = 0;
	СтруктураОтбора = Новый Структура(); // для отбора остатков взаиморасчетов
	СтруктураОтбора.Вставить("ДоговорКонтрагента", Договор);
	СтруктураОтбора.Вставить("Контрагент", Договор.Владелец);
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Если Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТекущийДолг = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,
						СтруктураОтбора,"ДоговорКонтрагента","СуммаВзаиморасчетов").Итог("СуммаВзаиморасчетов");
						
		Иначе // Взаиморасчеты ведутся по сделкам
			Если ЗначениеЗаполнено(Сделка) Тогда
				СтруктураОтбора.Вставить("Сделка", Сделка);
				ТекущийДолг = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.Остатки(,
				СтруктураОтбора,"ДоговорКонтрагента,Сделка","СуммаВзаиморасчетов").Итог("СуммаВзаиморасчетов");
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 

	Возврат ТекущийДолг;
	
КонецФункции // ТекущийДолг()

// Функция возвращает список значений видов договоров взаиморасчетов для поставщика.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика()

// Функция возвращает список значений видов договоров взяиморасчетов для покупателя.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Бартерный);
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя()

// Функция возвращает список значений видов договоров взаиморасчетов когда
// контрагент не является ни поставщиком не покупателем.
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее() Экспорт

	СписокПеречисления = Новый СписокЗначений;
	
	СписокПеречисления.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	Возврат СписокПеречисления;

КонецФункции // ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее()

// Определяет сделку, по которой надо провести документ
//
// Параметры: 
//  Объект          		- объект (документ или строка табличной части) 
//  Параметры 				- выборка из результата запроса, структура. Обязательно должна содержать поле (ключ) ВедениеВзаиморасчетов
//  ИмяРеквизитаСделка      - необязательный параметр, имя реквизита "сделка"
//  Расчеты                 - флаг, показывающий, что сделка определяется для записи в регистр РасчетыСКонтрагентами
// 							(при этом сделка прописывается, даже если взаиморасчеты ведутся по договору в целом)
//  ВозвратнаяТара          - флаг, показывающий, что определяется сделка для формирования движений по возвратной таре 
//							регистров "Товары полученные" и "Товары переданные". 
//							(в этом случае при ведении взаиморасчетов по расчетным документам сделка не прописывается)
//
// Возвращаемое значение:
//  Ссылка на документ или Неопределено, т.е. значение, которое надо записать в измерение Сделка регистра.
//
Функция ОпределитьСделку(Объект, Параметры, ИмяРеквизитаСделка = "Сделка", Расчеты = Ложь, ВозвратнаяТара = Ложь) Экспорт

	// Возвращаемое значение.
	Сделка = Неопределено;
	
	Если Параметры.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
		  ИЛИ Параметры.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам 
		  ИЛИ (Расчеты И ЗначениеЗаполнено(Объект[ИмяРеквизитаСделка])) Тогда

		Сделка = Объект[ИмяРеквизитаСделка];

	КонецЕсли;

	Возврат Сделка;

КонецФункции // ОпределитьСделку()

// Дополняет дерево полей запроса по шапке реквизитами договора, нужными для контроля остатков взаиморасчетов.
//
// Параметры
//  ДеревоПолейЗапросаПоШапке - дерево, дополняемое дерево полей запроса,
//  РежимПроведения           - режим проведения документа.
//
Процедура ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр(ДеревоПолейЗапросаПоШапке, РежимПроведения) Экспорт

	//Смартис Лиманчук начало 09.04.2013
	//Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
	//Смартис Лиманчук окончание 09.04.2013
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВедениеВзаиморасчетов"                       , "ВедениеВзаиморасчетов");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ВалютаВзаиморасчетов"                        , "ВалютаВзаиморасчетов");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "КонтролироватьСуммуЗадолженности" , "КонтролироватьСуммуЗадолженности");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ДопустимаяСуммаЗадолженности" , "ДопустимаяСуммаЗадолженности");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ПроцентПредоплаты" , "ПроцентПредоплаты");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "КонтролироватьЧислоДнейЗадолженности" , "КонтролироватьЧислоДнейЗадолженности");
		УправлениеЗапасами.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорКонтрагента"  , "ДопустимоеЧислоДнейЗадолженности" , "ДопустимоеЧислоДнейЗадолженности");
	//Смартис Лиманчук начало 09.04.2013	
	//КонецЕсли;
    //Смартис Лиманчук окончание 09.04.2013
	
КонецПроцедуры // ДополнитьДеревоПолейЗапросаПоШапкеДляКонтроляВзаиморасчетовУпр()

// Процедура выбора расчетного документа.
// Используется в документах подсистемы НДС.
//
Процедура ВыборРасчетногоДокумента(СтруктураПараметров,Элемент,ТипыДокументов) Экспорт

	ФормаВыбора = Документы.ДокументРасчетовСКонтрагентом.ПолучитьФорму("ФормаВыбора",Элемент);

	ФормаВыбора.Организация        = СтруктураПараметров.Организация;
	ФормаВыбора.Контрагент         = СтруктураПараметров.Контрагент;
	ФормаВыбора.ДоговорКонтрагента = СтруктураПараметров.ДоговорКонтрагента;
	ФормаВыбора.КонПериода         = СтруктураПараметров.КонецПериода;
	ФормаВыбора.Счет               = СтруктураПараметров.СчетДляОпределенияОстатков;
	ФормаВыбора.ОстаткиОбороты     = СтруктураПараметров.СторонаСчета;
	ФормаВыбора.РежимВыбора        = Истина;
	ФормаВыбора.мТипыДокументов    = ТипыДокументов;
	Если СтруктураПараметров.Свойство("НачалоПериода") Тогда
		ФормаВыбора.НачПериода         = СтруктураПараметров.НачалоПериода;
		ФормаВыбора.мПереданИнтервал = Истина;
	Иначе
		ФормаВыбора.мПереданИнтервал = Ложь;
	КонецЕсли; 

	ФормаВыбора.Открыть();

КонецПроцедуры // ВыборРасчетногоДокумента()

// Преобразует значение системного перечисления ВидСравнения в текст для запроса
//
// Параметры
//  СтруктураОтбора		–	<Структура>
//							Структура параметров отбора. Если есть элемент структуры с ключом "ВидСравненияОтбора",
//							значение этого элемента преобразуется в текст для запроса.
//							Необязательный элемент, по умолчанию ВидСравнения.Равно
//
// Возвращаемое значение:
//   <Строка> – текст сравнения для запроса
//
Функция ПолучитьВидСравненияДляЗапроса(СтруктураОтбора)

	Если НЕ СтруктураОтбора.Свойство("ВидСравненияОтбора") Тогда
		Возврат "=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Равно Тогда
		Возврат "=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеРавно Тогда
		Возврат "<>";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСписке Тогда
		Возврат "В";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСписке Тогда
		Возврат "НЕ В";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВИерархии Тогда
		Возврат "В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии Тогда
		Возврат "В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСпискеПоИерархии Тогда
		Возврат "НЕ В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВИерархии Тогда
		Возврат "НЕ В ИЕРАРХИИ";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Больше Тогда
		Возврат ">";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.БольшеИлиРавно Тогда
		Возврат ">=";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Меньше Тогда
		Возврат "<";
	ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.МеньшеИлиРавно Тогда
		Возврат "<=";
	Иначе // другие варианты 
		Возврат "=";
	КонецЕсли;

КонецФункции // ПолучитьВидСравненияДляЗапроса()

// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или пустая ссылка
//
// Параметры
//  ВладелецДоговора	–	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  ОрганизацияДоговора	–	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	–	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоровКонтрагентов> 
//							Нужные виды договора
//  СтруктураПараметров	–	<Структура>
//							Структура дополнительных параметров отбора договоров по реквизитам.
//							Элементы структуры СтруктураПараметров:
//							Ключ - имя реквизита договора, Значение - еще одна структура
//							
//							Элементы структуры, которая находится в Значение:
//							Ключ - "ЗначениеОтбора", Значение - значение реквизита договора для отбора. Обязательный элемент.
//							Ключ - "ВидСравненияОтбора", Значение - <ВидСравнения>. Необязательный элемент, по умолчанию ВидСравнения.Равно
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> – найденный счет или пустая ссылка
//
Функция УстановитьДоговорКонтрагента(ДоговорКонтрагента,ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора=неопределено, СтруктураПараметров = Неопределено) Экспорт

	НовыйДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка,
	|	ВЫБОР
	|		КОГДА СправочникВладелец.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникВладелец
	|		ПО ДоговорыКонтрагентов.Владелец = СправочникВладелец.Ссылка
	|			И ДоговорыКонтрагентов.Ссылка = СправочникВладелец.ОсновнойДоговорКонтрагента
	|ГДЕ
	|	&ТекстФильтра
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ВладелецДоговора", ВладелецДоговора);
	Запрос.УстановитьПараметр("ОрганизацияДоговора", ОрганизацияДоговора);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	ТекстФильтра = "
	|	ДоговорыКонтрагентов.Владелец = &ВладелецДоговора
	|	И ДоговорыКонтрагентов.Организация = &ОрганизацияДоговора
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ"
	+?(СписокВидовДоговора<>неопределено,"
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)","");
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Для каждого Параметр Из СтруктураПараметров Цикл
			ИмяРеквизита = Параметр.Ключ;
			СтруктураОтбора = Параметр.Значение;
			ВидСравненияЗапроса = ПолучитьВидСравненияДляЗапроса(СтруктураОтбора);
			ТекстФильтра = ТекстФильтра + "
			|	И ДоговорыКонтрагентов." + ИмяРеквизита + " " + ВидСравненияЗапроса + " (&" + ИмяРеквизита + ")";
			Запрос.УстановитьПараметр(ИмяРеквизита, СтруктураОтбора.ЗначениеОтбора);
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстФильтра", ТекстФильтра);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НайденОсновнойДоговор = Выборка.Приоритет = 1;
		НайденОдинДоговор     = Выборка.Количество() = 1;
		
		Если НайденОсновнойДоговор ИЛИ НайденОдинДоговор Тогда
			НовыйДоговор = Выборка.Ссылка;
		КонецЕсли;
	
	КонецЕсли;
	
	Если (ДоговорКонтрагента.Владелец<>ВладелецДоговора ИЛИ ДоговорКонтрагента.Организация<>ОрганизацияДоговора) ИЛИ (не ЗначениеЗаполнено(ДоговорКонтрагента)) Тогда	
		ДоговорКонтрагента = НовыйДоговор;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьДоговорКонтрагента()


/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБСЛУЖИВАНИЯ ВЕДЕНИЯ ВЗАИМОРАСЧЕТОВ ПО ДОКУМЕНТАМ
// РАСЧЕТОВ С КОНТРАГЕНТАМИ

// Процедура формирует структуру с итоговыми данными взаиморасчетов по документу
Функция ПолучитьСтруктуруВзаиморасчетовПоДокументу(ДокументОбъект, СуммаВзаиморасчетовПоДокументу) Экспорт
	
	СтруктураВзаиморасчетов = Новый Структура;
	
	ТаблицаДокументов = ДокументОбъект.ДокументыРасчетовСКонтрагентом.Выгрузить();
	СтруктураВзаиморасчетов.Вставить("ПоДокументуВал", СуммаВзаиморасчетовПоДокументу);
	
	СтруктураВзаиморасчетов.Вставить("ПредоплатаВал", ТаблицаДокументов.Итог("СуммаВзаиморасчетов"));
	
	ОстатокВал = СуммаВзаиморасчетовПоДокументу - СтруктураВзаиморасчетов.ПредоплатаВал;
	СтруктураВзаиморасчетов.Вставить("ОстатокВал", ОстатокВал);
	
	
	Возврат СтруктураВзаиморасчетов;
	
КонецФункции

Функция СформироватьТаблицуСделок(ДокументОбъект, СтруктураПараметров)
	
	Если СтруктураПараметров.Свойство("УчитыватьНДС") Тогда
		СуммаВключаетНДС = СтруктураПараметров.УчитыватьНДС;	
	ИначеЕсли ДокументОбъект.Метаданные().Реквизиты.Найти("УчитыватьНДС") <> Неопределено Тогда
		УчитыватьНДС = ДокументОбъект.УчитыватьНДС;
	Иначе
		УчитыватьНДС = Ложь;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = СтруктураПараметров.СуммаВключаетНДС;
	ИначеЕсли ДокументОбъект.Метаданные().Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено Тогда
		СуммаВключаетНДС = ДокументОбъект.СуммаВключаетНДС;
	Иначе
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	

	
	
	Если УчитыватьНДС Тогда
		КолонкиСуммирования = "Сумма, СуммаНДС";
	Иначе
		КолонкиСуммирования = "Сумма";
	КонецЕсли;
	
	МогутБытьЗаказыВТабличныхЧастях = СтруктураПараметров.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	Если МогутБытьЗаказыВТабличныхЧастях 
		И СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
		ЕстьЗаказыВТабличныхЧастях = Истина;
		ИмяКолонкиСделка = СтруктураПараметров.ИмяЗаказаВТабличныхЧастях;
	Иначе
		ЕстьЗаказыВТабличныхЧастях = Ложь;
		ИмяКолонкиСделка = "Сделка";
	КонецЕсли;
	
	ТаблицаСделок = Новый ТаблицаЗначений;
	ТаблицаСделок.Колонки.Добавить(ИмяКолонкиСделка);
	ТаблицаСделок.Колонки.Добавить("Сумма");
	Если УчитыватьНДС Тогда
		ТаблицаСделок.Колонки.Добавить("СуммаНДС");
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ИмяСделкиВШапкеДокумента") Тогда
		ИмяСделкиВШапкеДокумента = "Сделка";
	Иначе // Например, для документа ПолучениеУслугПоПереработке это "Заказ"
		ИмяСделкиВШапкеДокумента = СтруктураПараметров.ИмяСделкиВШапкеДокумента;
	КонецЕсли;
	
	Если ЕстьЗаказыВТабличныхЧастях Тогда
		
		Для каждого ТабЧасть Из СтруктураПараметров.СтруктураТабличныхЧастей Цикл
		
			Если ТабЧасть.Ключ = "ОбъектыСтроительства" Тогда
				СтрокаЗаказа = ТаблицаСделок.Добавить();
				СтрокаЗаказа[ИмяКолонкиСделка] = ДокументОбъект[ИмяСделкиВШапкеДокумента];
				СтрокаЗаказа.Сумма = ДокументОбъект[ТабЧасть.Ключ].Итог("Сумма");
				Если УчитыватьНДС Тогда
					СтрокаЗаказа.СуммаНДС = ДокументОбъект[ТабЧасть.Ключ].Итог("СуммаНДС");
				КонецЕсли;
			Иначе
				ТекТабЧасть = ДокументОбъект[ТабЧасть.Ключ].Выгрузить();
				ТекТабЧасть.Свернуть(ИмяКолонкиСделка, КолонкиСуммирования);
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТекТабЧасть, ТаблицаСделок);
			КонецЕсли;
		
		КонецЦикла;
		
	Иначе
	
		Для каждого ТабЧасть Из СтруктураПараметров.СтруктураТабличныхЧастей Цикл
		
			СтрокаЗаказа = ТаблицаСделок.Добавить();
			СтрокаЗаказа[ИмяКолонкиСделка] = ДокументОбъект[ИмяСделкиВШапкеДокумента];
			СтрокаЗаказа.Сумма = ДокументОбъект[ТабЧасть.Ключ].Итог("Сумма");
			Если УчитыватьНДС Тогда
				СтрокаЗаказа.СуммаНДС = ДокументОбъект[ТабЧасть.Ключ].Итог("СуммаНДС");
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	// В шапке документа "Поступление доп. расходов" может быть указана дополнительная сумма,
	// которую надо провести по взаиморасчетам
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходов") И ДокументОбъект.Сумма <> 0 Тогда 
		СтрокаЗаказа = ТаблицаСделок.Добавить();
		СтрокаЗаказа[ИмяКолонкиСделка] = ДокументОбъект[ИмяСделкиВШапкеДокумента];
		СтрокаЗаказа.Сумма = ДокументОбъект.Сумма;
		Если УчитыватьНДС Тогда
			СтрокаЗаказа.СуммаНДС = ДокументОбъект.СуммаНДС;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаСделок.Свернуть(ИмяКолонкиСделка, КолонкиСуммирования);
	
	ТаблицаСделок.Колонки[ИмяКолонкиСделка].Имя = "Сделка";
	ТаблицаСделок.Колонки.Добавить("СуммаВзаиморасчетов");
	
	Для каждого СтрокаТаблицы из ТаблицаСделок Цикл
		
		Если УчитыватьНДС Тогда
			Если СуммаВключаетНДС Тогда
				СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма;
			Иначе
				СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС;
			КонецЕсли;
		КонецЕсли;
			
		СтрокаТаблицы.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, 
		                                    СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаВзаиморасчетов,
		                                    СтруктураПараметров.КурсДокумента, СтруктураПараметров.КурсВзаиморасчетов, 
		                                    СтруктураПараметров.КратностьДокумента, СтруктураПараметров.КратностьВзаиморасчетов);
	КонецЦикла;
	
	Возврат ТаблицаСделок;
	
КонецФункции

// Процедура выполняет заполение ТЧ "Документы расчетов с контрагентом"
// Параметры:
//	ДокументОбъект
//	СтруктураПараметров - структура, включающая следующие параметры
//			- СтруктураТабличныхЧастей - структура, ключами которой являются имена табличных частей;
//										в качестве значений структуры могут передаваться 
//										таблицы значений, содержащие данные самих табличных частей
//							
//			- СуммаВключаетНДС         - признак включения НДС в сумму
//			- ВалютаВзаиморасчетов     - валюта взаиморасчетов (ссылка на элемент справочника "Валюты")
//			- СуммаВзаиморасчетов
//			- ВалютаДокумента
//			- КурсВзаиморасчетов
//			- КратностьВзаиморасчетов
//			- ДоговорКонтрагента
//			- ОтражатьВРегламентированномУчете - признак отражения документа в регламентированном учете
//			- ВедениеВзаиморасчетов
//			- Дата - дата документа
//	Направление - направление взаиморасчетов: "поступление" или "реализация"
//	УчетЗаказов - учет заказов при ведении взаиморасчетов по договору в целом:
//					- "только по заказу"      - если указан заказ, то заполнение происходит только документами, связанными с этим заказом
//                  - "по заказу и свободные" - заполняется сначала документами по заказу, а затем документами, в которых не был указан заказ
//					- "приоритет заказа"      - заполняется сначала документами по заказу, затем документами в которых заказ не был указан, затем документами по другим заказам
//					- "не учитывать"          - не учитываются заказы
//	УчетСуммыДокумента - учитывать сумму документа при заполнении или заполнять всеми остатками, предоставив пользователю право выбора
//
Процедура ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДоговорКонтрагента) 
		ИЛИ НЕ СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		ДокументОбъект.ДокументыРасчетовСКонтрагентом.Очистить();
		Возврат;
	КонецЕсли;
	
	СделкаВШапкеДокумента = НЕ СтруктураПараметров.Свойство("ТаблицаСделок");
	
	Если СделкаВШапкеДокумента Тогда
		
		ТаблицаСделок = Новый ТаблицаЗначений;
		ТаблицаСделок.Колонки.Добавить("Сделка");
		ТаблицаСделок.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число"));
		
		СтрокаСделки = ТаблицаСделок.Добавить();
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Сделка) 
			ИЛИ СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтрокаСделки.Сделка = Неопределено;
		Иначе
			СтрокаСделки.Сделка = СтруктураПараметров.Сделка;
		КонецЕсли;
		СтрокаСделки.СуммаВзаиморасчетов = СтруктураПараметров.СуммаВзаиморасчетов;
		
	Иначе
		
		ТаблицаСделок = СтруктураПараметров.ТаблицаСделок;
		
		Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТаблицаСделок.ЗаполнитьЗначения(Неопределено, "Сделка");
			ТаблицаСделок.Свернуть("Сделка", "СуммаВзаиморасчетов");
		КонецЕсли;
		
	КонецЕсли;
	
	Направление        = СтруктураПараметров.Направление;
	ВидЗаполнения      = СтруктураПараметров.ВидЗаполнения;
	УчетСуммыДокумента = СтруктураПараметров.УчетСуммыДокумента;
	
	// Выбираем из оперативных итогов все остатки по документам с датой оплаты меньше даты поступления (реализации)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоДокументамОстатки.Сделка КАК Сделка,
	|	ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель КАК СуммаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА &ЭтоВозврат
	|			ТОГДА &ПустаяДата
	|		КОГДА (НЕ &ОпределениеВремениПроведенияПлатежногоДокументаПоКонцуДняРегистрацииДокумента)
	|				И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ) = НАЧАЛОПЕРИОДА(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата, ДЕНЬ)
	|			ТОГДА ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ)
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка В (&СделкиДокумента)
	|			ТОГДА 1
	|		КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка = НЕОПРЕДЕЛЕНО
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|		,
	|		ДоговорКонтрагента = &ДоговорКонтрагента
	|		    И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|		) КАК ВзаиморасчетыПоДокументамОстатки
	|ГДЕ
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель > 0
	|	И ВЫБОР
	|			КОГДА &ЭтоВозврат
	|				ТОГДА ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата
	|			КОГДА (НЕ &ОпределениеВремениПроведенияПлатежногоДокументаПоКонцуДняРегистрацииДокумента)
	|					И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ) = НАЧАЛОПЕРИОДА(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата, ДЕНЬ)
	|				ТОГДА ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата
	|			ИНАЧЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.ДатаОплаты, ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом.Дата), ДЕНЬ)
	|		КОНЕЦ < &Дата
	|	И ВЫБОР
	|			КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка В (&СделкиДокумента)
	|				ТОГДА 1
	|			КОГДА ВзаиморасчетыПоДокументамОстатки.Сделка = НЕОПРЕДЕЛЕНО
	|				ТОГДА 2
	|			ИНАЧЕ 3
	|		КОНЕЦ <= &МаксПриоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Сделка,
	|	ДокументРасчетовСКонтрагентом
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если ДокументОбъект.ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("Дата", КонецДня(СтруктураПараметров.Дата));
	Иначе
		Запрос.УстановитьПараметр("Дата", СтруктураПараметров.Дата);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтруктураПараметров.ДоговорКонтрагента);
	СделкиДокумента = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаСделок.ВыгрузитьКолонку("Сделка"));
	Запрос.УстановитьПараметр("СделкиДокумента", СделкиДокумента);
	ВидРасчетовСКонтрагентом = ?(Направление = "Поступление", Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению,
	                             Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	
	Если Направление = "Поступление" Тогда
		МножительНаправления = 1;
	Иначе
		МножительНаправления = -1;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ЭтоВозврат") Тогда
		МножительВозврата = ?(СтруктураПараметров.ЭтоВозврат = Истина, -1, 1);
		Запрос.УстановитьПараметр("ЭтоВозврат", ?(ТипЗнч(СтруктураПараметров.ЭтоВозврат) = Тип("Булево"), СтруктураПараметров.ЭтоВозврат, Ложь));
	Иначе
		МножительВозврата = 1;
		Запрос.УстановитьПараметр("ЭтоВозврат", Ложь);
	КонецЕсли;
	Множитель = МножительНаправления * МножительВозврата;
	Запрос.УстановитьПараметр("Множитель", Множитель);
	
	Если ВидЗаполнения = "только по заказам" Тогда
		МаксПриоритет = 1;
	ИначеЕсли ВидЗаполнения = "по заказам и свободные" Тогда
		МаксПриоритет = 2;
	Иначе
		МаксПриоритет = 3;
	КонецЕсли;
	
	ОпределениеВремениПроведенияПлатежногоДокумента = глЗначениеПеременной("ОпределениеВремениПроведенияПлатежногоДокумента");
	
	Запрос.УстановитьПараметр("МаксПриоритет", МаксПриоритет);
	Запрос.УстановитьПараметр("ОпределениеВремениПроведенияПлатежногоДокументаПоКонцуДняРегистрацииДокумента", ОпределениеВремениПроведенияПлатежногоДокумента = Перечисления.СпособыОпределенияВремениПроведенияПлатежногоДокумента.ПоКонцуДняРегистрацииДокумента);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Результат = Запрос.Выполнить();
	ТаблицаОстатков = Результат.Выгрузить();
	
	ТаблицаПредоплат = ДокументОбъект.ДокументыРасчетовСКонтрагентом.Выгрузить();
	ТаблицаПредоплат.Очистить();
	
	Если МаксПриоритет = 3 И НЕ УчетСуммыДокумента Тогда
		// Заполняем всеми доступными остатками. Выбрать нужные должен будет пользователь,
		// удалив лишние строки или откорректировав суммы
		Для каждого СтрокаОстатка Из ТаблицаОстатков Цикл
			НоваяСтрокаПредоплаты = ТаблицаПредоплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПредоплаты, СтрокаОстатка);
		КонецЦикла;
		
	Иначе
		// Заполняем доступными остатками на сумму, не превышающую сумму документа
		// в соответствии с заданными приоритетами
		Для Приоритет = 1 По МаксПриоритет Цикл
			
			Для каждого СтрокаСделки Из ТаблицаСделок Цикл
				
				Если СтрокаСделки.СуммаВзаиморасчетов = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Приоритет = 1 Тогда
					СтруктураОтбораОстатков = Новый Структура("Приоритет, Сделка", 1, СтрокаСделки.Сделка);
					СтрокиСОтбором = ТаблицаОстатков.НайтиСтроки(СтруктураОтбораОстатков);
				ИначеЕсли Приоритет = 2 Тогда
					СтруктураОтбораОстатков = Новый Структура("Приоритет", 2);
					СтрокиСОтбором = ТаблицаОстатков.НайтиСтроки(СтруктураОтбораОстатков);
				Иначе
					СтрокиСОтбором = ТаблицаОстатков;
				КонецЕсли;
				
				Для каждого СтрокаОстатка Из СтрокиСОтбором Цикл
					
					Если СтрокаСделки.СуммаВзаиморасчетов = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Если СтрокаОстатка.СуммаВзаиморасчетов = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрокаПредоплаты = ТаблицаПредоплат.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрокаПредоплаты, СтрокаОстатка);
					НоваяСтрокаПредоплаты.СуммаВзаиморасчетов = Мин(СтрокаСделки.СуммаВзаиморасчетов, СтрокаОстатка.СуммаВзаиморасчетов);
					
					СтрокаСделки.СуммаВзаиморасчетов  = СтрокаСделки.СуммаВзаиморасчетов - НоваяСтрокаПредоплаты.СуммаВзаиморасчетов;
					СтрокаОстатка.СуммаВзаиморасчетов = СтрокаОстатка.СуммаВзаиморасчетов - НоваяСтрокаПредоплаты.СуммаВзаиморасчетов;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	ДокументОбъект.ДокументыРасчетовСКонтрагентом.Загрузить(ТаблицаПредоплат);

КонецПроцедуры // ЗаполнитьДокументыРасчетовСКонтрагентом()

Процедура ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	СтруктураПараметров.Вставить("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	СтруктураПараметров.Вставить("ВестиПоДокументамРасчетовСКонтрагентом", ДокументОбъект.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом);
	Если НЕ СтруктураПараметров.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		Возврат;
	КонецЕсли;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если НЕ СтруктураПараметров.Свойство("СтруктураТабличныхЧастей") Тогда
		СтруктураТабЧастей = Новый Структура;
		Для каждого ТабЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
			Если ТабЧасть.Имя <> "ВозвратнаяТара" И ТабЧасть.Имя <> "ДокументыРасчетовСКонтрагентом" Тогда
				СтруктураТабЧастей.Вставить(ТабЧасть.Имя);
			КонецЕсли;
		КонецЦикла;
		СтруктураПараметров.Вставить("СтруктураТабличныхЧастей", СтруктураТабЧастей);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И НЕ СтруктураПараметров.Свойство("ИмяЗаказаВТабличныхЧастях") Тогда
		СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("Направление") Тогда
		СтруктураПараметров.Вставить("Направление", "Поступление");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("ВидЗаполнения") Тогда
		СтруктураПараметров.Вставить("ВидЗаполнения", "только по заказам");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("УчетСуммыДокумента") Тогда
		СтруктураПараметров.Вставить("УчетСуммыДокумента", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		СтруктураПараметров.Вставить("Дата", ДокументОбъект.Дата);
	Иначе
		СтруктураПараметров.Вставить("Дата", ОбщегоНазначения.ПолучитьРабочуюДату());	
	КонецЕсли;

	СтруктураПараметров.Вставить("ОтражатьВРегламентированномУчете", ДокументОбъект.Организация.ОтражатьВРегламентированномУчете);
	Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВУправленческомУчете") <> Неопределено Тогда
	    СтруктураПараметров.Вставить("ОтражатьВУправленческомУчете", ДокументОбъект.ОтражатьВУправленческомУчете);
	Иначе
	    СтруктураПараметров.Вставить("ОтражатьВУправленческомУчете", Истина);
	КонецЕсли;
	Если МетаданныеДокумента.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено Тогда
	    СтруктураПараметров.Вставить("СуммаВключаетНДС", ДокументОбъект.СуммаВключаетНДС);
	Иначе
	    СтруктураПараметров.Вставить("СуммаВключаетНДС", Истина);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетов",    ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	СтруктураПараметров.Вставить("КурсВзаиморасчетов",      ДокументОбъект.КурсВзаиморасчетов);
	СтруктураПараметров.Вставить("КратностьВзаиморасчетов", ДокументОбъект.КратностьВзаиморасчетов);
	
	СтруктураПараметров.Вставить("ВалютаДокумента", ДокументОбъект.ВалютаДокумента);
	КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
	КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ДокументОбъект, ДокументОбъект.мВалютаРегламентированногоУчета);
	СтруктураПараметров.Вставить("КурсДокумента",      КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента", КратностьДокумента);
	
	СтруктураПараметров.Вставить("ВедениеВзаиморасчетов", ДокументОбъект.ДоговорКонтрагента.ВедениеВзаиморасчетов); 
	ТаблицаСделок = СформироватьТаблицуСделок(ДокументОбъект, СтруктураПараметров);
	СтруктураПараметров.Вставить("ТаблицаСделок", ТаблицаСделок);
	
КонецПроцедуры

#Если Клиент Тогда

// Процедура подготавливает необходимые данные и вызывает процедуру заполнения табличной части 
// документов расчетов с контрагентами ("Предоплата", "Документы поступления", "Документы реализации") 
//
Процедура ЗаполнитьПредоплату(ДокументОбъект, СтруктураПараметров) Экспорт
	
	Если ДокументОбъект.Проведен И ДокументОбъект.ДокументыРасчетовСКонтрагентом.Количество() > 0 Тогда
		ТекстПредупреждения = "Для заполнения табличной части нужно сначала сделать документ непроведенным!";
		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект.ДокументыРасчетовСКонтрагентом.Количество() > 0 Тогда
		
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ДокументОбъект.Метаданные().Представление());
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		
		ДокументОбъект.ДокументыРасчетовСКонтрагентом.Очистить();
	КонецЕсли;
	
	ДополнитьСтруктуруПараметровДляЗаполненияТаблицыДокументовРасчетов(ДокументОбъект, СтруктураПараметров);
	ЗаполнитьТаблицуДокументовРасчетовСКонтрагентом(ДокументОбъект, СтруктураПараметров);
	
КонецПроцедуры
	
// Процедура заполняет поля СуммаВзаиморасчетов 
// в строке табличной части ДокументыРасчетовСКонтрагентом
// Параметры:
// СуммаВзаиморасчетовУказанаВСтроке - <Булево>. Если Истина - рассчитываем только сумму регл.учета
//                                     по указанной в строке сумме взаиморасчетов.
//                                     Если Ложь - рассчитываем обе суммы
//
Процедура РассчитатьПогашаемыеСуммыПоДокументуРасчетов(ДокументОбъект, ДанныеСтроки, СтруктураПараметров, РассчитыватьСуммуВзаиморасчетов = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДокументОбъект.ДоговорКонтрагента);
	
	ОплатаПоНесколькимСделкам = Ложь;
	Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		ТекСделка = Неопределено;
	ИначеЕсли СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		ТекСделка = ДокументОбъект.Сделка;
	Иначе //.ПоЗаказам
		Если СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
			ТекСделка = ДанныеСтроки.Сделка;
			ОплатаПоНесколькимСделкам = Истина;
		Иначе
			ТекСделка = ДокументОбъект.Сделка;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Сделка", ТекСделка);
	
	Запрос.УстановитьПараметр("ДокументРасчетовСКонтрагентом", ДанныеСтроки.ДокументРасчетовСКонтрагентом);
	Если СтруктураПараметров.Свойство("ЭтоВозврат") Тогда
		МножительВозврата = ?(СтруктураПараметров.ЭтоВозврат, -1, 1);
	Иначе
		МножительВозврата = 1;
	КонецЕсли;
	Если СтруктураПараметров.Направление = "Реализация" Тогда
		МножительНаправления = -1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоРеализации;
	ИначеЕсли СтруктураПараметров.Направление = "Поступление" Тогда
		МножительНаправления = 1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.ПоПриобретению;
	Иначе
		МножительНаправления= 1;
		ВидРасчетовСКонтрагентом = Перечисления.ВидыРасчетовСКонтрагентами.Прочее;
	КонецЕсли;
	Множитель = МножительНаправления * МножительВозврата;
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("Множитель", Множитель);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток, 0) * &Множитель > 0
	|			ТОГДА ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &Множитель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|		,
	|		ДоговорКонтрагента = &ДоговорКонтрагента
	|		    И Сделка = &Сделка
	|		    И ДокументРасчетовСКонтрагентом = &ДокументРасчетовСКонтрагентом
	|		    И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|			) КАК ВзаиморасчетыПоДокументамОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	
	Если НЕ РассчитыватьСуммуВзаиморасчетов Тогда
	
		
		Если НЕ ДокументОбъект.Проведен И Выборка.СуммаВзаиморасчетов < ДанныеСтроки.СуммаВзаиморасчетов Тогда
			ВалютаПредставление = Строка(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов);
			ТекстСообщения = "Указана сумма взаиморасчетов, превышающая непогашенный остаток по документу расчетов с контрагентом!
			| Остаток " + Выборка.СуммаВзаиморасчетов + " " + ВалютаПредставление + "; "
			+ " указана сумма " + ДанныеСтроки.СуммаВзаиморасчетов + " " + ВалютаПредставление + "; "
			+ " превышение " + (ДанныеСтроки.СуммаВзаиморасчетов - Выборка.СуммаВзаиморасчетов) + " " + ВалютаПредставление;
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		КонецЕсли;
	
	Иначе
		Если Выборка.СуммаВзаиморасчетов = 0 Тогда
			ДанныеСтроки.СуммаВзаиморасчетов = 0;
		Иначе
			
			ТаблицаСделокДокумента = СформироватьТаблицуСделок(ДокументОбъект, СтруктураПараметров);
			Если НЕ ОплатаПоНесколькимСделкам Тогда
				Если СтруктураПараметров.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
					ТаблицаСделокДокумента.ЗаполнитьЗначения(Неопределено, "Сделка");
				Иначе
					ТаблицаСделокДокумента.ЗаполнитьЗначения(ДокументОбъект.Сделка, "Сделка");
				КонецЕсли;
				ТаблицаСделокДокумента.Свернуть("Сделка", "СуммаВзаиморасчетов");
			КонецЕсли;
			
			СтрокаТекущейСделки = ТаблицаСделокДокумента.Найти(ТекСделка, "Сделка");
			Если СтрокаТекущейСделки = Неопределено Тогда
				ДанныеСтроки.СуммаВзаиморасчетов = 0;
			Иначе
				
				СуммаДокументаПоСделке = СтрокаТекущейСделки.СуммаВзаиморасчетов;
			
				ДанныеСтроки.СуммаВзаиморасчетов = 0;
				Если ОплатаПоНесколькимСделкам Тогда
					СуммаПредоплатыПоСделке = 0;
					СтрокиПредоплатыПоСделке = ДокументОбъект.ДокументыРасчетовСКонтрагентом.НайтиСтроки(Новый Структура("Сделка", ТекСделка));
					Для каждого СтрокаПредоплатыПоСделке Из СтрокиПредоплатыПоСделке Цикл
						СуммаПредоплатыПоСделке = СуммаПредоплатыПоСделке + СтрокаПредоплатыПоСделке.СуммаВзаиморасчетов;
					КонецЦикла;
				Иначе
					СуммаПредоплатыПоСделке = ДокументОбъект.ДокументыРасчетовСКонтрагентом.Итог("СуммаВзаиморасчетов");
				КонецЕсли;
				ОстСуммаВзаиморасчетов = СуммаДокументаПоСделке - СуммаПредоплатыПоСделке;
		
				ПогашаемаяСуммаВзаиморасчетов = Мин(Выборка.СуммаВзаиморасчетов, ОстСуммаВзаиморасчетов);
		
				ДанныеСтроки.СуммаВзаиморасчетов = ПогашаемаяСуммаВзаиморасчетов;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

// Процедура заполняет поле ДатаОплаты в строке табличной части ДокументыРасчетовСКонтрагентом 
// при изменении документа расчетов
//
Процедура ОпределитьДатуОплатыДокументаРасчетовСКонтрагентом(ДанныеСтроки) Экспорт

	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДокументРасчетовСКонтрагентом) Тогда
		ДанныеСтроки.ДатаОплаты = '00010101';
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДанныеСтроки.ДокументРасчетовСКонтрагентом.Метаданные();
	
	Запрос = Новый Запрос;
	ЕстьДатаОплаты = МетаданныеДокумента.Реквизиты.Найти("ДатаОплаты") <> Неопределено;
	Если ЕстьДатаОплаты Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШапкаДокумента.Дата КАК ДатаДокумента,
		|	ШапкаДокумента.ДатаОплаты КАК ДатаОплаты
		|ИЗ
		|	Документ." + МетаданныеДокумента.Имя + " КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &ДокументРасчетов";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШапкаДокумента.Дата КАК ДатаДокумента,
		|	ШапкаДокумента.Дата КАК ДатаОплаты
		|ИЗ
		|	Документ." + МетаданныеДокумента.Имя + " КАК ШапкаДокумента
		|ГДЕ
		|	ШапкаДокумента.Ссылка = &ДокументРасчетов";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументРасчетов", ДанныеСтроки.ДокументРасчетовСКонтрагентом);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеСтроки.ДатаОплаты = УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Выборка.ДатаДокумента, Выборка.ДатаОплаты);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПРОВЕДЕНИЯ ДОКУМЕНТОВ ПО ВЗАИМОРАСЧЕТАМ

Функция СформироватьТаблицуСделокДляПроведенияПоВзаиморасчетам(СтруктураПараметров, СтруктураШапкиДокумента) 
	
	МогутБытьЗаказыВТабличныхЧастях = СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	Если МогутБытьЗаказыВТабличныхЧастях 
		И СтруктураПараметров.Свойство("ЕстьЗаказыВТабличныхЧастях") И СтруктураПараметров.ЕстьЗаказыВТабличныхЧастях = Истина Тогда
		ЕстьЗаказыВТабличныхЧастях = Истина;
		ИмяКолонкиСделка = СтруктураПараметров.ИмяЗаказаВТабличныхЧастях;
	Иначе
		ЕстьЗаказыВТабличныхЧастях = Ложь;
		ИмяКолонкиСделка = "Сделка";
	КонецЕсли;
	
	ТаблицаСделок = Новый ТаблицаЗначений;
	ТаблицаСделок.Колонки.Добавить(ИмяКолонкиСделка, Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
		|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), ИмяКолонкиСделка);
	
	ОбщиеЧисловыеКолонки = "СуммаВзаиморасчетов, СуммаУпр";
	Если СтруктураШапкиДокумента.ВидДокумента = "ПоступлениеДопРасходов" Тогда
		ДопЧисловыеКолонки = "СуммаВзаиморасчетовРаспределения, СуммаУпрРаспределения";
	КонецЕсли;
	ЧисловыеКолонки = ОбщиеЧисловыеКолонки + ", " + ДопЧисловыеКолонки;
	СтруктураЧисловыхКолонок = Новый Структура(ЧисловыеКолонки);
    //ИЗМЕНЕНО Верескул Игорь(Начало 07.08.2018
	Для каждого ЧисловаяКолонка Из СтруктураЧисловыхКолонок Цикл
		ТаблицаСделок.Колонки.Добавить(ЧисловаяКолонка.Ключ, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,4)));
    КонецЦикла;
    //Окончание)Верескул Игорь 
	
	Если НЕ СтруктураПараметров.Свойство("ИмяСделкиВШапкеДокумента") Тогда
		ИмяСделкиВШапкеДокумента = "Сделка";
	Иначе // Например, для документа ПолучениеУслугПоПереработке это "Заказ"
		ИмяСделкиВШапкеДокумента = СтруктураПараметров.ИмяСделкиВШапкеДокумента;
	КонецЕсли;
	
	Для каждого ПодготовленнаяТаблица Из СтруктураПараметров.СтруктураПодготовленныхТаблиц Цикл
		
		ИмяТаблицы = ПодготовленнаяТаблица.Ключ;
		Таблица    = ПодготовленнаяТаблица.Значение;
		
		Для каждого СтрокаТаблицы Из Таблица Цикл
			СтрокаСделки = ТаблицаСделок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСделки, СтрокаТаблицы);
            //ИЗМЕНЕНО Верескул Игорь(Начало 07.08.2018
         
            //ЭтоВозврат = СтруктураПараметров.Свойство("ЭтоВозврат") И СтруктураПараметров.ЭтоВозврат;
            //Множитель = ?(ЭтоВозврат, -1, 1);
            //Если СтруктураШапкиДокумента.УчитыватьНДС и НЕ СтруктураШапкиДокумента.СуммаВключаетНДС Тогда
            //    СтрокаСделки.СуммаВзаиморасчетов = Множитель * (СтрокаТаблицы.Сумма + СтрокаТаблицы.НДС);	
            //Иначе
            //    СтрокаСделки.СуммаВзаиморасчетов = Множитель * СтрокаТаблицы.Сумма;
            //КонецЕсли; 
            //Окончание)Верескул Игорь 
			Если НЕ ЕстьЗаказыВТабличныхЧастях ИЛИ ИмяТаблицы = "ОбъектыСтроительства" Тогда
				СтрокаСделки[ИмяКолонкиСделка] = СтруктураШапкиДокумента[ИмяСделкиВШапкеДокумента];
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтруктураШапкиДокумента.ВидДокумента = "ПоступлениеДопРасходов" Тогда
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			СтрокаСделки.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов + СтрокаСделки.СуммаВзаиморасчетовРаспределения;
			СтрокаСделки.СуммаУпр            = СтрокаСделки.СуммаУпр + СтрокаСделки.СуммаУпрРаспределения;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаСделок.Свернуть(ИмяКолонкиСделка, ОбщиеЧисловыеКолонки);
	
	ТаблицаСделок.Колонки[ИмяКолонкиСделка].Имя = "Сделка";
	
	Возврат ТаблицаСделок;
	
КонецФункции

// Проверяет правильность заполнения строк табличной части "Документы расчетов с контрагентом".
//
// Параметры:
// Параметры: 
//  ДокументОбъект          - документ, табличная часть которого проверяется
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		
		// Укажем, что надо проверить:
		СтруктураОбязательныхПолей = Новый Структура("ДокументРасчетовСКонтрагентом, СуммаВзаиморасчетов");
		
		// Теперь вызовем общую процедуру проверки.
		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, "ДокументыРасчетовСКонтрагентом", СтруктураОбязательныхПолей, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом()

Процедура ИзменитьЗнакКолонокТаблицы(Таблица, СтруктураКолонок) Экспорт

	Для каждого СтрокаТаблицы Из Таблица Цикл
		Для каждого ОписаниеКолонки Из СтруктураКолонок Цикл
		
			ИмяКолонки = ОписаниеКолонки.Ключ;
			ЗначениеКолонки = СтрокаТаблицы[ИмяКолонки];
			Если ТипЗнч(ЗначениеКолонки) = Тип("Число") Тогда
				СтрокаТаблицы[ИмяКолонки] = -1 * ЗначениеКолонки;
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция ПодготовитьТаблицуПоВзаиморасчетам(ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, ТаблицаСделокДокумента, Отказ, Заголовок)
	
	Если Отказ Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаСделок = ТаблицаСделокДокумента.Скопировать();
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			ТаблицаСделок.ЗаполнитьЗначения(Неопределено, "Сделка");
		Иначе //.ПоСчетам
			ТаблицаСделок.ЗаполнитьЗначения(СтруктураШапкиДокумента["Сделка"], "Сделка");
		КонецЕсли;
		ТаблицаСделок.Свернуть("Сделка", "СуммаВзаиморасчетов, СуммаУпр");
	КонецЕсли;
	
	Если НЕ СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		
		ТаблицаПоВзаиморасчетам = ТаблицаСделок.Скопировать();
		
		Возврат ТаблицаПоВзаиморасчетам;
		
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
		СделкаДляВзаиморасчетов = Неопределено;
	Иначе //.ПоСчетам или .ПоЗаказам (по заказам - если в ТЧ ДокументыРасчетовСКонтрагентом нет колонки Сделка)
		СделкаДляВзаиморасчетов = СтруктураШапкиДокумента["Сделка"];
	КонецЕсли;
	
	// Создаем колонки таблицы явным образом, а не загружаем таб.часть документа,
	// чтобы не устанавливалось ограничение типов колонок в соответствие с типом реквизитов документа
	ТаблицаПоВзаиморасчетам = Новый ТаблицаЗначений;
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
		|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), "Сделка");
	//Смартис Лиманчук начало 24.01.2013	
	//ТаблицаПоВзаиморасчетам.Колонки.Добавить("ДокументРасчетовСКонтрагентом", Новый ОписаниеТипов(Документы.ТипВсеСсылки(), "Неопределено"), "ДокументРасчетовСКонтрагентом");
 	ТаблицаПоВзаиморасчетам.Колонки.Добавить("ДокументРасчетовСКонтрагентом", Новый ОписаниеТипов(Метаданные.РегистрыНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Измерения.ДокументРасчетовСКонтрагентом.Тип,"Неопределено"), "ДокументРасчетовСКонтрагентом");	
	//Смартис Лиманчук окончание 24.01.2013
	
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("ДатаОплаты", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаПоВзаиморасчетам.Колонки.Добавить("СуммаУпр", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для каждого СтрокаТабЧасти Из ДокументОбъект.ДокументыРасчетовСКонтрагентом Цикл
		СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаТабЧасти);
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка) Тогда
			СтрокаВзаиморасчетов.Сделка = СделкаДляВзаиморасчетов;
		КонецЕсли;
		СтрокаВзаиморасчетов.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаВзаиморасчетов.СуммаВзаиморасчетов, 
		                                СтруктураШапкиДокумента.ВалютаВзаиморасчетов, СтруктураШапкиДокумента.ВалютаУправленческогоУчета,
		                                СтруктураШапкиДокумента.КурсВзаиморасчетов, СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета, 
		                                СтруктураШапкиДокумента.КратностьВзаиморасчетов, СтруктураШапкиДокумента.КратностьВалютыУправленческогоУчета);
	КонецЦикла;
	
	ЭтоВозврат = СтруктураПараметров.Свойство("ЭтоВозврат") И СтруктураПараметров.ЭтоВозврат;
	Если ЭтоВозврат Тогда
		ИзменитьЗнакКолонокТаблицы(ТаблицаПоВзаиморасчетам, Новый Структура("СуммаВзаиморасчетов, СуммаУпр"));
	КонецЕсли;
		
	Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		
		ВсегоСуммаВзаиморасчетов = ТаблицаСделок.Итог("СуммаВзаиморасчетов");
		ВсегоСуммаПредоплаты     = ТаблицаПоВзаиморасчетам.Итог("СуммаВзаиморасчетов");
		Если ВсегоСуммаВзаиморасчетов <> ВсегоСуммаПредоплаты Тогда
			СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
			
			СтрокаВзаиморасчетов.Сделка                        = СделкаДляВзаиморасчетов;
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = ДокументОбъект.Ссылка;
			
			СтрокаВзаиморасчетов.СуммаВзаиморасчетов = ВсегоСуммаВзаиморасчетов - ВсегоСуммаПредоплаты;
			СтрокаВзаиморасчетов.СуммаУпр            = ТаблицаСделок.Итог("СуммаУпр") - ТаблицаПоВзаиморасчетам.Итог("СуммаУпр");
		КонецЕсли; 
		
	Иначе //.ПоЗаказам
		
		// Рассчитаем неоплаченные суммы по каждой строке таблицы сделок
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			Для каждого СтрокаВзаиморасчетов Из ТаблицаПоВзаиморасчетам Цикл
				Если СтрокаСделки.Сделка = СтрокаВзаиморасчетов.Сделка Тогда
					СтрокаСделки.СуммаВзаиморасчетов = СтрокаСделки.СуммаВзаиморасчетов - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
					СтрокаСделки.СуммаУпр            = СтрокаСделки.СуммаУпр - СтрокаВзаиморасчетов.СуммаУпр;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Теперь по каждой строке таблицы сделок, где предоплата не совпадает с реализацией (поступлением), 
		// добавляем строки в таблицу взаиморасчетов со ссылкой на проводимый документ
		Для каждого СтрокаСделки Из ТаблицаСделок Цикл
			Если СтрокаСделки.СуммаВзаиморасчетов <> 0 Тогда
				СтрокаВзаиморасчетов = ТаблицаПоВзаиморасчетам.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаСделки);
				
				СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = ДокументОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Множитель = ?(ЭтоВозврат, -1, 1);
	Для каждого СтрокаВзаиморасчетов Из ТаблицаПоВзаиморасчетам Цикл
		
		Если СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель < 0 Тогда
			ПредставлениеСделки = ?(НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка), "не указана", Строка(СтрокаВзаиморасчетов.Сделка));
			ОбщегоНазначения.СообщитьОбОшибке("Указана сумма предоплаты (сделка: " + ПредставлениеСделки + ") больше возможной по документу на " 
			+ (-1 * СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель) + " " + СтруктураШапкиДокумента.ВалютаВзаиморасчетов, Отказ, Заголовок);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ТаблицаПоВзаиморасчетам;
	
КонецФункции // ПодготовитьТаблицуПоВзаиморасчетам()

Функция ПодготовитьТаблицуПоРасчетам(ТаблицаСделок, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если Отказ ИЛИ НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТаблицаПоРасчетам = ТаблицаСделок.Скопировать();
	
	УдаляемыеСтроки = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаПоРасчетам Цикл
		
		ДолжноБытьДвижениеПоРасчетам = НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сделка) 
		                           ИЛИ (ТипЗнч(СтрокаТаблицы.Сделка) <> Тип("ДокументСсылка.ЗаказПокупателя") 
								     И ТипЗнч(СтрокаТаблицы.Сделка) <> Тип("ДокументСсылка.ЗаказПоставщику"));
		Если НЕ ДолжноБытьДвижениеПоРасчетам Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		ТаблицаПоРасчетам.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Возврат ТаблицаПоРасчетам;

КонецФункции

Процедура ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам(ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                      ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
														  
	Если СтруктураПараметров.Свойство("ПроводитьПоВзаиморасчетам") И НЕ СтруктураПараметров.ПроводитьПоВзаиморасчетам Тогда
		ТаблицаПоВзаиморасчетам = Новый ТаблицаЗначений;
		ТаблицаПоРасчетам       = Новый ТаблицаЗначений;
		Возврат;
	КонецЕсли; 
	
	ПроверитьЗаполнениеТабличнойЧастиДокументыРасчетовСКонтрагентом(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ТаблицаСделок = СформироватьТаблицуСделокДляПроведенияПоВзаиморасчетам(СтруктураПараметров, СтруктураШапкиДокумента);
	СтруктураПараметров.Вставить("ТаблицаСделок", ТаблицаСделок);
	
	ТаблицаПоВзаиморасчетам = ПодготовитьТаблицуПоВзаиморасчетам(ДокументОбъект, СтруктураПараметров, СтруктураШапкиДокумента, ТаблицаСделок, Отказ, Заголовок);
	
	ТаблицаПоРасчетам = ПодготовитьТаблицуПоРасчетам(ТаблицаСделок, СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ПодготовитьТаблицыДляПроведенияПоВзаиморасчетам()

Процедура ВыполнитьДвиженияПоРегистрамУпрВзаиморасчетов(ДокументОбъект, СтруктураШапкиДокумента, 
	                                                    СтруктураПараметров, ТаблицаПоВзаиморасчетам, ТаблицаПоРасчетам, 
	                                                    ВидДвижения, Отказ, Заголовок) Экспорт
													  
	// По регистру ВзаиморасчетыСКонтрагентами
	
	Если ТаблицаПоВзаиморасчетам.Количество() > 0 Тогда
		
		НаборДвиженийВзаиморасчеты = ДокументОбъект.Движения.ВзаиморасчетыСКонтрагентами;
		
		ТаблицаДвижений = НаборДвиженийВзаиморасчеты.Выгрузить();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВзаиморасчетам, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
		
		НаборДвиженийВзаиморасчеты.мПериод          = СтруктураШапкиДокумента.Дата;
		НаборДвиженийВзаиморасчеты.мТаблицаДвижений = ТаблицаДвижений;
		
		// Проверка остатков
		ОтключитьКонтрольВзаиморасчетов = СтруктураШапкиДокумента.Свойство("ОтключитьКонтрольВзаиморасчетов") 
		                                И СтруктураШапкиДокумента.ОтключитьКонтрольВзаиморасчетов;
		Если НЕ ОтключитьКонтрольВзаиморасчетов Тогда
			НаборДвиженийВзаиморасчеты.КонтрольОстатков(ДокументОбъект, "ДокументыРасчетовСКонтрагентом", СтруктураШапкиДокумента, СтруктураПараметров, Отказ, Заголовок, СтруктураШапкиДокумента.РежимПроведения, "СуммаВзаиморасчетов");
		КонецЕсли;
		
		Если Не Отказ Тогда
			ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборДвиженийВзаиморасчеты, ВидДвижения);
		КонецЕсли;
		
	КонецЕсли;
	
	// По регистру РасчетыСКонтрагентами
	
	Если ТаблицаПоРасчетам.Количество() > 0 Тогда
		
		НаборДвиженийРасчеты = ДокументОбъект.Движения.РасчетыСКонтрагентами;
		
		ТаблицаДвижений = НаборДвиженийРасчеты.Выгрузить();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоРасчетам, ТаблицаДвижений);
		
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация, "Организация");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.Контрагент, "Контрагент");
		ТаблицаДвижений.ЗаполнитьЗначения(СтруктураШапкиДокумента.ДоговорКонтрагента, "ДоговорКонтрагента");
		
		Если СтруктураПараметров.Свойство("ЭтоВозврат") И СтруктураПараметров.ЭтоВозврат Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Возврат, "РасчетыВозврат");
		Иначе
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.РасчетыВозврат.Расчеты, "РасчетыВозврат");
		КонецЕсли;
		
		НаборДвиженийРасчеты.мПериод          = СтруктураШапкиДокумента.Дата;
		НаборДвиженийРасчеты.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборДвиженийРасчеты, ВидДвижения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет возможность проведения в БУ и НУ в зависимости от договора взаиморасчетов.
//
// Параметры:
//  ДоговорКонтрагента             - ссылка на справочник договора, определяет договор с контрагентом;
//  ВалютаДокумента                - ссылка на справочник валют, определяет валюту документа;
//  ОтражатьВБухгалтерскомУчете    - булево, признак отражения документа в бух. учете;
//  ОтражатьВНалоговомУчете        - булево, признак отражения документа в налоговом учете;
//  ВалютаРегламентированногоУчета - ссылка на справочник валют, определяет валюту ведения регл. учета;
//  ЭтоДокументОплаты              - булево, определяет является ли это документом оплаты,
//                                   необязательный параметр, по умолчанию - Ложь;
//  Отказ                          - булево, признак отказа в проведении документаРасчетыВУсловныхЕдиницах;
//  Заголовок                      - строка, заголовок сообщения в отказе проведения;
//  ДополнениеКСообщению           - строка, дополнение к сообщению в отказе проведении, 
//                                   необязательный, по умолчанию - пустая строка;
//  ВалютаВзаиморасчетов           - ссылка на справочник валют, определяет валюту взаиморасчетов по договору,
//                                   если не передан, берется из договора;
//
// Возвращаемое значение:
//  Истина, если документ можно проводить по бух. или (и) налоговому учету, инчае - Ложь.
//
Функция ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,ОтражатьВБухгалтерскомУчете,
                          ВалютаРегламентированногоУчета, ЭтоДокументОплаты = Ложь,
                          Отказ = Ложь, Заголовок,ДополнениеКСообщению = "",
                          ВалютаВзаиморасчетов = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
		ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;

	Если ВалютаВзаиморасчетов = Неопределено Тогда
		ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;

	Если ВалютаВзаиморасчетов <> ВалютаДокумента 
	   И ВалютаРегламентированногоУчета <> ВалютаДокумента Тогда

		// Документ выписан в валюте отличной от валюты регламентированного учета и валюты взаиморасчетов. 
		// Не отражается в б.у.
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ДополнениеКСообщению + " Валюта документа ("+СокрЛП(ВалютаДокумента)
			                 + ") отличается от валюты регламентированного учета (" + СокрЛП(ВалютаРегламентированногоУчета)
			                 + ") и валюты расчетов по договору """ + СокрЛП(ДоговорКонтрагента) 
			                 + """ (" + СокрЛП(ВалютаВзаиморасчетов) + ").
			|Документ не может быть проведен по бухгалтерскому и налоговому учету.",Отказ,Заголовок);
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ВалютаДокумента <> ВалютаВзаиморасчетов И ВалютаВзаиморасчетов <> ВалютаРегламентированногоУчета Тогда 
		// Валюта документа не равна валюте взаиморасчетов, которая не равна валюте б.у.
		// Не отражается в б.у. и в н.у.
		Если ОтражатьВБухгалтерскомУчете Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ДополнениеКСообщению + " Валюта документа (" + СокрЛП(ВалютаДокумента) 
			+ ") отличается от валюты расчетов по договору """ + СокрЛП(ДоговорКонтрагента) 
			+ """ (" + СокрЛП(ВалютаВзаиморасчетов)+").
			|Документы при расчетах по внешнеэкономическим договорам могут быть выписаны только в валюте взаиморасчетов.
			|Документ не может быть проведен по бухгалтерскому и налоговому учету.",Отказ,Заголовок);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ПроверкаВозможностиПроведенияВ_БУ_НУ()

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С РЕГИСТРОМ ОПЕРАТИВНОГО УЧЕТА РАСЧЕТОВ ПО ДОКУМЕНТАМ

// Движения документов оплаты по регистру оперативных расчетов по документам
//
// Параметры
//  СтруктураШапкиДокумента		– <Структура> – структура с данными шапки документа и другими, необходимыми для формирования движений
//  ДатаДвижений				– <Дата> – дата и время формирования движений
//  ИмяТаблицыПлатежейИлиТаблица– <Строка> –  Имя табличной части документа оплаты с расшифровкой платежей
//								или <ТаблицаЗначений> - подготовленная таблица платежей по расчетным документам
//  ВидРасчетовСКонтрагентом	- <ПеречислениеСсылка.ВидыРасчетовСКонтрагентами>
//  ВидДвижения					- <ВидДвиженияНакопления>
//  Движения 					- <Коллекция движений или структура с соответствующими свойствами>
//								– Движения документа по регистрам (в т.ч. по регистру оперативных взаиморасчетов)
//  Отказ						- <Булево> – признак ошибки при проведения для остановки проведения документа
//  Заголовок					- <Строка> – Представление заголовка документа для использования при формировании сообщения об ошибках
//
Процедура ОтражениеОплатыВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ДатаДвижений, ИмяТаблицыПлатежейИлиТаблица, ВидРасчетовСКонтрагентом, ВидДвижения, Движения, Отказ, Заголовок) Экспорт
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = СтруктураШапкиДокумента.Ссылка;
	МетаданныеДокумента = Ссылка.Метаданные();
	ИмяДокумента = МетаданныеДокумента.Имя;
	
	ПереданоИмяТаблицы =  ТипЗнч(ИмяТаблицыПлатежейИлиТаблица) = Тип("Строка");
	Если ПереданоИмяТаблицы Тогда // Таблицу платежей получаем запросом
		
		ИмяТаблицыПлатежей = ИмяТаблицыПлатежейИлиТаблица;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаПлатежей.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента) КАК ДоговорКонтрагентаПредставление,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.Сделка
		|	КОНЕЦ КАК Сделка,
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.Сделка
		|		КОНЕЦ) КАК СделкаПредставление,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|	КОНЕЦ КАК ДокументРасчетовСКонтрагентом,
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|		КОНЕЦ) КАК ДокументРасчетовСКонтрагентомПредставление,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов) КАК ВалютаВзаиморасчетовПредставление,
		|	СУММА(ТаблицаПлатежей.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|	МИНИМУМ(ТаблицаПлатежей.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ." + ИмяДокумента + "." + ИмяТаблицыПлатежей + " КАК ТаблицаПлатежей
		// Пример:
		//|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ТаблицаПлатежей
		|ГДЕ
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом = ИСТИНА
		|	И ТаблицаПлатежей.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПлатежей.ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.Сделка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|	КОНЕЦ,
		|	ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаПлатежей.ДоговорКонтрагента.ВалютаВзаиморасчетов),
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДоговорКонтрагента.ВедениеВзаиморасчетов = &ПоДоговоруВЦелом
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			КОГДА ТаблицаПлатежей.Сделка В (&ПустыеСделки)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.Сделка
		|		КОНЕЦ),
		|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
		|			КОГДА ТаблицаПлатежей.ДокументРасчетовСКонтрагентом В (&ПустыеРасчетныеДокументы)
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТаблицаПлатежей.ДокументРасчетовСКонтрагентом
		|		КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаПлатежей.СуммаПлатежа", "ТаблицаПлатежей.Сумма");
		КонецЕсли; 
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ПоДоговоруВЦелом", Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		
		РеквизитыМетаданныхТабЧастиДокумента = МетаданныеДокумента.ТабличныеЧасти[ИмяТаблицыПлатежей].Реквизиты;
		ТипыСделок = РеквизитыМетаданныхТабЧастиДокумента.Сделка.Тип.Типы();
		МассивПустыхСделок = Новый Массив;
		Для каждого Элемент Из ТипыСделок Цикл
			МассивПустыхСделок.Добавить(Новый(Элемент));
		КонецЦикла;
		
		ТипыРасчетныхДокументов = РеквизитыМетаданныхТабЧастиДокумента.ДокументРасчетовСКонтрагентом.Тип.Типы();
		МассивПустыхРасчетныхДокументов = Новый Массив;
		Для каждого Элемент Из ТипыРасчетныхДокументов Цикл
			МассивПустыхРасчетныхДокументов.Добавить(Новый(Элемент));
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ПустыеСделки",             МассивПустыхСделок);
		Запрос.УстановитьПараметр("ПустыеРасчетныеДокументы", МассивПустыхРасчетныхДокументов);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаПлатежей = Результат.Выгрузить();
		
	Иначе // Может быть передана готовая таблица платежей (например, для документа КорректировкаДолга)
		
		ПереданаТаблица =  ТипЗнч(ИмяТаблицыПлатежейИлиТаблица) = Тип("ТаблицаЗначений");
		Если НЕ ПереданаТаблица Тогда
			Возврат;
		КонецЕсли;
	
		ТаблицаПлатежей = ИмяТаблицыПлатежейИлиТаблица;
	
	КонецЕсли;
	
	ЗнакОстатка = ?(ВидДвижения = ВидДвиженияНакопления.Расход, 1, -1);
	
	// Определение состояния расчетов по документам
	
	Запрос = Новый Запрос;
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.ДоговорКонтрагента,
	|	Таб.Сделка,
	|	Таб.ДокументРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаПлатежей
	|ИЗ
	|	&ТаблицаПлатежей КАК Таб
	|ГДЕ 
	|	НЕ (Таб.ДокументРасчетовСКонтрагентом = &Ссылка)
	|		И НЕ (Таб.ДокументРасчетовСКонтрагентом = НЕОПРЕДЕЛЕНО)";
	
	Запрос.УстановитьПараметр("ТаблицаПлатежей", ТаблицаПлатежей);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
		СтруктураПараметровБлокировки = Новый Структура(
			"ИмяТаблицы, ИсточникДанных, ИмяВременнойТаблицы", 
			"ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов", МенеджерВремТаблиц, "ТаблицаПлатежей");
		СтруктураЗначенийБлокировки   = Новый Структура(
			"ВидРасчетовСКонтрагентом, Организация", 
			ВидРасчетовСКонтрагентом, СтруктураШапкиДокумента.Организация);
		СтруктураИсточникаДанных      = Новый Структура(
			"ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом", 
			"ДоговорКонтрагента", "Сделка", "ДокументРасчетовСКонтрагентом");
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
		
	КонецЕсли;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоДокументамОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыПоДокументамОстатки.Сделка,
	|	ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка КАК СуммаВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, 
	|		Организация = &Организация
	|			И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|			И (ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом) В (ВЫБРАТЬ ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом ИЗ ТаблицаПлатежей)) КАК ВзаиморасчетыПоДокументамОстатки
	|ГДЕ
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка > 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки";
	
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("ЗнакОстатка",ЗнакОстатка);
	
	ОстаткиПоРасчетам = Запрос.Выполнить().Выгрузить();
	
	ДвиженияРегистраОперативныхРасчетов = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов;
	
	Если СтруктураШапкиДокумента.Свойство("РежимПроведения") Тогда
		РежимПроведения = СтруктураШапкиДокумента.РежимПроведения;
	Иначе
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	ЗапрещатьПревышениеОстатков = РежимПроведения = РежимПроведенияДокумента.Оперативный;
	
	Для каждого СтрокаПлатежа Из ТаблицаПлатежей Цикл
	
		ЭтоПогашениеКредДокумента = СтрокаПлатежа.ДокументРасчетовСКонтрагентом <> Неопределено;
		
		Если ЭтоПогашениеКредДокумента Тогда
			
			ОтборПоОстаткам = Новый Структура("ДоговорКонтрагента, Сделка, ДокументРасчетовСКонтрагентом", 
			СтрокаПлатежа.ДоговорКонтрагента, СтрокаПлатежа.Сделка, СтрокаПлатежа.ДокументРасчетовСКонтрагентом);
			
			СуммаВзаиморасчетовОстаток = 0;
			СтрокиОстатка = ОстаткиПоРасчетам.НайтиСтроки(ОтборПоОстаткам);
			Для каждого ОстатокАванса Из СтрокиОстатка Цикл
				СуммаВзаиморасчетовОстаток = СуммаВзаиморасчетовОстаток + СтрокиОстатка[0].СуммаВзаиморасчетов;
			КонецЦикла;
				
			Если СтрокаПлатежа.СуммаВзаиморасчетов > СуммаВзаиморасчетовОстаток Тогда
				
				ТекстСообщения = "Указана сумма взаиморасчетов, превышающая непогашенный остаток по документу расчетов с контрагентом!
				| Договор: " + СтрокаПлатежа.ДоговорКонтрагентаПредставление + 
				?(НЕ ЗначениеЗаполнено(СтрокаПлатежа.СделкаПредставление),", сделка не указана",", сделка: " + СтрокаПлатежа.СделкаПредставление)+ 
				", документ расчетов: " + СтрокаПлатежа.ДокументРасчетовСКонтрагентомПредставление + "; 
				| Остаток " + СуммаВзаиморасчетовОстаток + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление + "; "
				+ " указана сумма " + СтрокаПлатежа.СуммаВзаиморасчетов + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление + "; "
				+ " превышение " + (СтрокаПлатежа.СуммаВзаиморасчетов - СуммаВзаиморасчетовОстаток) + " " + СтрокаПлатежа.ВалютаВзаиморасчетовПредставление;
				
				Если ЗапрещатьПревышениеОстатков Тогда
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
					Возврат;
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , Заголовок);
				КонецЕсли;
			КонецЕсли;
			
			Движение = ДвиженияРегистраОперативныхРасчетов.Добавить();
			
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период	     = ДатаДвижений;
			
			Движение.ДоговорКонтрагента            = СтрокаПлатежа.ДоговорКонтрагента;
			Движение.Контрагент            		   = СтрокаПлатежа.ДоговорКонтрагента.Владелец;
			Движение.Организация            	   = СтрокаПлатежа.ДоговорКонтрагента.Организация;


			Движение.Сделка                        = СтрокаПлатежа.Сделка;
			Движение.ДокументРасчетовСКонтрагентом = СтрокаПлатежа.ДокументРасчетовСКонтрагентом;
			Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
			
			Движение.СуммаВзаиморасчетов = СтрокаПлатежа.СуммаВзаиморасчетов;
			
		Иначе
			
			// Делаем движение с указанием документа-регистратора в качестве документа расчетов 
			Движение = ДвиженияРегистраОперативныхРасчетов.Добавить();
			
			Движение.ВидДвижения = ВидДвижения;
			Движение.Период      = ДатаДвижений;
			
			Движение.ДоговорКонтрагента            = СтрокаПлатежа.ДоговорКонтрагента;
			Движение.Контрагент            		   = СтрокаПлатежа.ДоговорКонтрагента.Владелец;
			Движение.Организация            	   = СтрокаПлатежа.ДоговорКонтрагента.Организация;

			Движение.Сделка                        = СтрокаПлатежа.Сделка;
			Движение.ДокументРасчетовСКонтрагентом = Ссылка;
			Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
			
			Движение.СуммаВзаиморасчетов = СтрокаПлатежа.СуммаВзаиморасчетов;
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры

// Движения документов поступления и реализации по регистру оперативных расчетов по документам
//
// Параметры
//  СтруктураШапкиДокумента		- <Структура> – Структура шапки документа
//  БазоваяТаблицаЗадолженности	– <ТаблицаЗначений> –  Таблица значений с информацией о задолженности по документу
//  ТаблицаРасчетовПоДокументам	– <ТаблицаЗначений> –  Таблица значений с информацией о зачитываемых авансах
//  ВидРасчетовПоОперации		- <ПеречислениеСсылка.ВидыРасчетовСКонтрагентами>
//  ВидДвиженияРасчетов			- <ПеречислениеСсылка.ВидыДвиженийБухгалтерии>
//	ДоговорКонтрагента			- <СправочникСсылка.ДоговорыКонтрагентов> - необязательный параметр. 
//									Для документов, отражающих движения по нескольким договорам
//  Движения 					- <Коллекция движений или структура с соответствующими свойствами>
//								– Движения документа по регистрам (в т.ч. по регистру оперативных взаиморасчетов)
//  Отказ						- <Булево> – признак ошибки при проведения для остановки проведения документа
//  Заголовок					- <Строка> – Представление заголовка документа для использования при формировании сообщения об ошибках
//
Процедура ОтражениеЗадолженностиВРегистреОперативныхРасчетовПоДокументам(СтруктураШапкиДокумента, ТаблицаВзаиморасчетов, ВидРасчетовСКонтрагентом, ВидДвижения, Движения, Отказ, Заголовок) Экспорт
	
	ВестиПоДокументамРасчетовСКонтрагентом = СтруктураШапкиДокумента.ВестиПоДокументамРасчетовСКонтрагентом;
	Если (НЕ ВестиПоДокументамРасчетовСКонтрагентом)
		ИЛИ (ТаблицаВзаиморасчетов.Количество() = 0)
		Тогда
		Возврат;
	КонецЕсли;
	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка             = СтруктураШапкиДокумента.Ссылка;
	ДатаДвижений       = СтруктураШапкиДокумента.Дата;
	Организация        = СтруктураШапкиДокумента.Организация;
	Контрагент         = СтруктураШапкиДокумента.Контрагент;
	ДоговорКонтрагента = СтруктураШапкиДокумента.ДоговорКонтрагента;
	ЗнакОстатка        = ?(ВидДвижения = ВидДвиженияНакопления.Приход, -1, 1);
	
	ЭтоВозврат = СтруктураШапкиДокумента.Свойство("ЭтоВозврат") И СтруктураШапкиДокумента.ЭтоВозврат;
	Множитель = ?(ЭтоВозврат, -1, 1);
	ЗнакОстатка = ЗнакОстатка * Множитель;
	
	НетСделкиВТаблице = ТаблицаВзаиморасчетов.Колонки.Найти("Сделка") = Неопределено;
	Если НетСделкиВТаблице Тогда
		ТаблицаВзаиморасчетов.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ЗаказПоставщику, 
			|ДокументСсылка.СчетНаОплатуПокупателю, ДокументСсылка.СчетНаОплатуПоставщика, Неопределено"), "Сделка");
	КонецЕсли;
	
	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		
		Если СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			СтрокаВзаиморасчетов.Сделка = Неопределено;
		ИначеЕсли СтруктураШапкиДокумента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам ИЛИ НетСделкиВТаблице Тогда
			СтрокаВзаиморасчетов.Сделка = СтруктураШапкиДокумента.Сделка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом) Тогда
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом = Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	// Определение состояния расчетов по документам
	
	Запрос = Новый Запрос;
	МенеджерВремТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Сделка,
	|	Таб.ДокументРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаВзаиморасчетов
	|ИЗ
	|	&ТаблицаВзаиморасчетов КАК Таб
	|ГДЕ 
	|	НЕ (Таб.ДокументРасчетовСКонтрагентом = &Ссылка)";
	
	Запрос.УстановитьПараметр("ТаблицаВзаиморасчетов", ТаблицаВзаиморасчетов);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Если глЗначениеПеременной("ИспользоватьБлокировкуДанных") Тогда
						
		СтруктураПараметровБлокировки = Новый Структура(
			"ИмяТаблицы, ИсточникДанных, ИмяВременнойТаблицы", 
			"ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов", МенеджерВремТаблиц, "ТаблицаВзаиморасчетов");
		СтруктураЗначенийБлокировки   = Новый Структура(
			"ВидРасчетовСКонтрагентом, Организация, ДоговорКонтрагента", 
			ВидРасчетовСКонтрагентом, СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ДоговорКонтрагента);
		СтруктураИсточникаДанных      = Новый Структура(
			"Сделка, ДокументРасчетовСКонтрагентом", 
			"Сделка", "ДокументРасчетовСКонтрагентом");
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, СтруктураЗначенийБлокировки, СтруктураИсточникаДанных, Отказ, Заголовок);
		
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоДокументамОстатки.Организация,
	|	ВзаиморасчетыПоДокументамОстатки.Контрагент,
	|	ВзаиморасчетыПоДокументамОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыПоДокументамОстатки.Сделка,
	|	ВзаиморасчетыПоДокументамОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыПоДокументамОстатки.ВидРасчетовСКонтрагентом,
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка КАК СуммаВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|		, 
	|		Организация = &Организация
	|			И Контрагент = &Контрагент
	|			И ДоговорКонтрагента = &ДоговорКонтрагента
	|			И ВидРасчетовСКонтрагентом = &ВидРасчетовСКонтрагентом
	|			И (Сделка, ДокументРасчетовСКонтрагентом) В (ВЫБРАТЬ Сделка, ДокументРасчетовСКонтрагентом ИЗ ТаблицаВзаиморасчетов)) КАК ВзаиморасчетыПоДокументамОстатки
	|ГДЕ
	|	ВзаиморасчетыПоДокументамОстатки.СуммаВзаиморасчетовОстаток * &ЗнакОстатка > 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки";
	
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидРасчетовСКонтрагентом", ВидРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("ЗнакОстатка",ЗнакОстатка);
		
	ОстаткиПоРасчетам = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейВзаиморасчетыПоДокументам = Движения.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов;
	ТаблицаДвижений = НаборЗаписейВзаиморасчетыПоДокументам.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Если СтруктураШапкиДокумента.Свойство("РежимПроведения") Тогда
		РежимПроведения = СтруктураШапкиДокумента.РежимПроведения;
	Иначе
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	
	ЗапрещатьПревышениеОстатков   = РежимПроведения = РежимПроведенияДокумента.Оперативный;
	ВзаиморасчетыВВалютеРеглУчета = СтруктураШапкиДокумента.ВалютаВзаиморасчетов = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета;

	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		
		ЭтоПогашениеКредДокумента = СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом <> Ссылка;
		
		Если ЭтоПогашениеКредДокумента Тогда
			
			ОтборПоОстаткам = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Сделка, 
			| ДокументРасчетовСКонтрагентом, ВидРасчетовСКонтрагентом", 
			Организация, Контрагент, ДоговорКонтрагента, СтрокаВзаиморасчетов.Сделка, 
			СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом, ВидРасчетовСКонтрагентом);
			
			СтрокиОстатка = ОстаткиПоРасчетам.НайтиСтроки(ОтборПоОстаткам);
			
			ОстатокСуммыВзаиморасчетов = 0;
			Для каждого ОстатокЗадолженности из СтрокиОстатка Цикл
				ОстатокСуммыВзаиморасчетов = ОстатокСуммыВзаиморасчетов + ОстатокЗадолженности.СуммаВзаиморасчетов;
			КонецЦикла;
			
			Если ОстатокСуммыВзаиморасчетов < СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель Тогда
			
				ВалютаПредставление = Строка(ДоговорКонтрагента.ВалютаВзаиморасчетов);
				СделкаПредставление = ?(НЕ ЗначениеЗаполнено(СтрокаВзаиморасчетов.Сделка), "не указана", Строка(СтрокаВзаиморасчетов.Сделка));
				ТекстСообщения = "Указана сумма взаиморасчетов, превышающая непогашенный остаток по документу расчетов с контрагентом!
				               | Сделка: " + СделкаПредставление + ", документ расчетов: " + СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом + "; 
				               | Остаток " + ОстатокСуммыВзаиморасчетов + " " + ВалютаПредставление + "; "
				               + " указана сумма " + (СтрокаВзаиморасчетов.СуммаВзаиморасчетов * Множитель) + " " + ВалютаПредставление + "; "
				               + " превышение " + (СтрокаВзаиморасчетов.СуммаВзаиморасчетов  * Множитель - ОстатокСуммыВзаиморасчетов) + " " + ВалютаПредставление;
			
				Если ЗапрещатьПревышениеОстатков Тогда
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
					Возврат;
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , Заголовок);
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЕсли; 
				
		Движение = ТаблицаДвижений.Добавить();
		
		Движение.Организация            	   = Организация;
		Движение.Контрагент            		   = Контрагент;
		Движение.ДоговорКонтрагента            = ДоговорКонтрагента;
		Движение.Сделка                        = СтрокаВзаиморасчетов.Сделка;
		Движение.ДокументРасчетовСКонтрагентом = СтрокаВзаиморасчетов.ДокументРасчетовСКонтрагентом;
		Движение.ВидРасчетовСКонтрагентом      = ВидРасчетовСКонтрагентом;
		
		Движение.СуммаВзаиморасчетов = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
		
	КонецЦикла; 
	
	НаборЗаписейВзаиморасчетыПоДокументам.мТаблицаДвижений = ТаблицаДвижений;
	НаборЗаписейВзаиморасчетыПоДокументам.мПериод = ДатаДвижений;
	
	Если Не Отказ Тогда
		ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(НаборЗаписейВзаиморасчетыПоДокументам, ВидДвижения);
	КонецЕсли;

КонецПроцедуры

//Смартис Лиманчук начало 27.03.2013
Процедура ПроверитьСрокИСуммуЗадолженностиПодотчет(СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	Если Отказ Тогда
	    Возврат;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
	    Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ВидДокумента = "РасходныйКассовыйОрдер" Тогда
		Если СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику И 
			 СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетникуНал Тогда
			 Возврат;
		КонецЕсли;
	ИначеЕсли СтруктураШапкиДокумента.ВидДокумента = "ПлатежноеПоручениеИсходящее" Тогда
		Если СтруктураШапкиДокумента.ВидОперации <> Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику Тогда
			 Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", СтруктураШапкиДокумента.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ФизЛицо", СтруктураШапкиДокумента.Контрагент);
	
	//проверка по сроку задолженности в разрезе расчетных документов
	//ищем самый первый расчетный документ подотчета, сальдо по которому осталось незакрытым (и положительным) на дату проведения
	//если просрочка превышает значение константы, не проводим документ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РасчетныйДокумент,
		|	РАЗНОСТЬДАТ(РасчетныйДокумент.Дата, &Дата, ДЕНЬ) КАК Дней
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо),
		|	Константы КАК Константы
		|ГДЕ
		|	СуммаУпрОстаток > 0
		|	И РасчетныйДокумент <> НЕОПРЕДЕЛЕНО
		|	И РАЗНОСТЬДАТ(РасчетныйДокумент.Дата, &Дата, ДЕНЬ) > Константы.СрокПогашенияЗадолженностиПодотчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дней УБЫВ";
                                      
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("У подотчетника "+СтруктураШапкиДокумента.Контрагент+" имеется задолженность по документу "+Выборка.РасчетныйДокумент+", превышающая "+Выборка.Дней+" дней!", Отказ, Заголовок);
	КонецЕсли;
			
	//проверка по общей сумме задолженности
	//сравниваем сумму задолженности подотчетника и сумму документа, с одной стороны,
	//с порогом допустимой задолженности по сотруднику, с другой стороны
	//если превышение, не проводим документ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВзаиморасчетыСПодотчетнымиЛицамиОстатки.СуммаУпрОстаток, 0) КАК ОстатокУпр,
		|	ПорогЗадолженностиПоПодотчетуСрезПоследних.Сумма КАК ПорогГрн
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо) КАК ВзаиморасчетыСПодотчетнымиЛицамиОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ПорогЗадолженностиПоПодотчету.СрезПоследних(&Дата, Физлицо = &Физлицо) КАК ПорогЗадолженностиПоПодотчетуСрезПоследних
		|		ПО (ИСТИНА)";
                                      
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//запрос всегда будет непустым, если контроль по сотруднику включен, даже если сальдо равно 0.
	//если запрос пустой, значит, и контроль отключен, и сальдо нет.

	Если Выборка.Следующий() Тогда
		Если Выборка.ПорогГрн = NULL Тогда
			//контроль отключен, но сальдо есть.
			Возврат;			
		КонецЕсли;
		//сверяем суммы
		ОстатокГрн = МодульВалютногоУчета.ПересчитатьВСуммуРегл(Выборка.ОстатокУпр, СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, Константы.ВалютаУправленческогоУчета.Получить(), СтруктураШапкиДокумента.Дата);
		СуммаДок = СтруктураШапкиДокумента.СуммаДокумента;
		ОбщийДолгГрн = ОстатокГрн + СуммаДок;
		Превышение = ОбщийДолгГрн - Выборка.ПорогГрн;
		Если Превышение > 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("У подотчетника "+СтруктураШапкиДокумента.Контрагент+" общая задолженность ("+ОбщийДолгГрн+" грн) превысит допустимый порог задолженности на "+Превышение+" грн!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
//Смартис Лиманчук окончание 27.03.2013

//Смартис Лиманчук начало 28.03.2013
Процедура ПроверитьНаличиеНезакрытыхАвансов(СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
	
	//временная заплатка
    Возврат;
	//
	
	Если Отказ Тогда
	    Возврат;
	ИначеЕсли НЕ СтруктураШапкиДокумента.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		Возврат;
	ИначеЕсли НЕ СтруктураШапкиДокумента.ДоговорКонтрагента.КонтролироватьСуммуЗадолженности И НЕ СтруктураШапкиДокумента.ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.Ссылка.ДокументыРасчетовСКонтрагентом.Количество()>0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", СтруктураШапкиДокумента.Дата);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтруктураШапкиДокумента.ДоговорКонтрагента);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументРасчетовСКонтрагентом.Дата КАК Дата, ДокументРасчетовСКонтрагентом, -СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&Дата, ДоговорКонтрагента = &ДоговорКонтрагента)
		|ГДЕ
		|	ВидРасчетовСКонтрагентом = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовСКонтрагентами.ПоРеализации)
		|	И СуммаВзаиморасчетовОстаток < 0
		|	И (ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|			ИЛИ ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ПриходныйКассовыйОрдер)
		|УПОРЯДОЧИТЬ ПО Дата";
                                      
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьОбОшибке("Имеется незакрытый аванс по документу "+Выборка.ДокументРасчетовСКонтрагентом+" на сумму "+Выборка.СуммаВзаиморасчетов+" грн!", Отказ, Заголовок);
	КонецЦикла;
			
КонецПроцедуры
//Смартис Лиманчук окончание 28.03.2013