
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Отбор.Свойство("ВидНалоговойДекларации") Тогда
		ВидНалоговойДекларации = Параметры.Отбор.ВидНалоговойДекларации;
	Иначе
		ВидНалоговойДекларации = Неопределено;
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Родитель") Тогда
		// в свойстве Родитель передаем набор статей
		НаборСтатей            = Параметры.Отбор.Родитель;
	Иначе
		НаборСтатей 		   = Неопределено;
	КонецЕсли;
	
	СписокСтатей = НалоговыйУчетПовтИсп.НайтиСтатьиНалоговойДекларацииПоТексту(Параметры.СтрокаПоиска, ВидНалоговойДекларации, НаборСтатей);
	
	ДанныеВыбора = СписокСтатей;
	
КонецПроцедуры
