////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование сертификата по значениям реквизитов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование() Экспорт

	Строка = "";
	
	Если ЗначениеЗаполнено(Номер) Тогда  	
		Если ЗначениеЗаполнено(ВидСертификата) Тогда
			Строка = "Сертификат " + НРег(ВидСертификата) + " №";
		Иначе
			Строка = "Сертификат №";			
		КонецЕсли;
		Строка = Строка + СокрЛП(Номер);
	КонецЕсли;
	
  	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Наименование не назначено>";
	КонецЕсли;

	Возврат Строка;

КонецФункции
