
Процедура ПровестиДоки(ИмяФайла) Экспорт
    
    ТД = Новый ТабличныйДокумент;   
    ТД.Прочитать(ИмяФайла);
    
    ТаблицаРезультат = Новый ТаблицаЗначений;
    ТаблицаРезультат.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций")); 
    ТаблицаРезультат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
    ТаблицаРезультат.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
    
    КолвоСтрокФайла = ТД.ВысотаТаблицы;
    КолВоКолонокФайла = ТД.ШиринаТаблицы;
    
    //НачСтрока = ?(НачСтрока = 0, 2, НачСтрока);
	КонСтрока = КолвоСтрокФайла;
	
	Для нСтрокаТФ = 2 ПО КонСтрока Цикл
		НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
		
        КодСотрудника = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C1").ТекущаяОбласть.Текст;
        КодСотрудника = СокрЛП(КодСотрудника);
        НоваяСтрокаТФ.Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоКоду(КодСотрудника);
        Если НЕ ЗначениеЗаполнено(НоваяСтрокаТФ.Сотрудник) Тогда
            ТаблицаРезультат.Удалить(НоваяСтрокаТФ);
            Сообщить("Сотрудник в строке " + нСтрокаТФ + " не определен. Будет пропущен");	
            Продолжить;
        КонецЕсли; 
        
        КодПодразделения = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C4").ТекущаяОбласть.Текст;
        КодПодразделения = СокрЛП(КодПодразделения);
        НоваяСтрокаТФ.Подразделение = Справочники.ПодразделенияОрганизаций.НайтиПоКоду(КодПодразделения);
        Если НЕ ЗначениеЗаполнено(НоваяСтрокаТФ.Подразделение) Тогда
            Сообщить("Подразделение в строке " + нСтрокаТФ + " не определено. Будет взято подразделение сотрудника");	
            НоваяСтрокаТФ.Подразделение = НоваяСтрокаТФ.Сотрудник.ПодразделениеОрганизации;
        КонецЕсли; 
        
        Попытка
            Сумма = ТД.ПолучитьОбласть("R"+нСтрокаТФ+"C5").ТекущаяОбласть.Текст;
            НоваяСтрокаТФ.Сумма = Окр(Число(Сумма),2);
        Исключение
            Сообщить("Сумма в строке " + КонСтрока + " не определена");
            НоваяСтрокаТФ.Сумма = 0;
        КонецПопытки; 
              
    КонецЦикла;
    НЗ=Неопределено;
    сПодразделение = Неопределено;
    ТаблицаРезультат.Сортировать("Подразделение,Сотрудник"); 
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение,
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период,
                   |    РаботникиОрганизацийСрезПоследних.ГрафикРаботы
                   |ИЗ
                   |    РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Дата, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник В (&Сотрудник)) КАК РаботникиОрганизацийСрезПоследних
                   |        ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
                   |ГДЕ
                   |    ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник В(&Сотрудник)
                   |    И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = ИСТИНА";
    Запрос.УстановитьПараметр("Сотрудник",ТаблицаРезультат.ВыгрузитьКолонку("Сотрудник"));
    Запрос.УстановитьПараметр("Дата",ТекущаяДата());
    ТаблицаВидовНачислений = Запрос.Выполнить().Выгрузить();
    ТаблицаВидовНачислений.Сортировать("Период Возр");
    Если ЗначениеЗаполнено(Подразделение) Тогда
        НЗ = Документы.НачислениеЗарплатыРаботникамОрганизаций.СоздатьДокумент();
        НЗ.ПериодРегистрации = ПериодРегистрации;    	
        НЗ.ПодразделениеОрганизации = Подразделение;
        НЗ.Организация = Организация;
        НЗ.Дата = ТекущаяДата();	
    КонецЕсли; 
    Для каждого Строка Из ТаблицаРезультат Цикл       
        Если сПодразделение <> Строка.Подразделение И  НЕ ЗначениеЗаполнено(Подразделение) Тогда
            Если НЗ <> Неопределено Тогда
                УстановитьПривилегированныйРежим(Истина);
                НЗ.Записать(РежимЗаписиДокумента.Запись);	
                Сообщить("Создан " + НЗ.ССылка);
                УстановитьПривилегированныйРежим(Ложь);
            КонецЕсли; 
            НЗ = Документы.НачислениеЗарплатыРаботникамОрганизаций.СоздатьДокумент();
            НЗ.ПериодРегистрации = ПериодРегистрации;    	
            НЗ.ПодразделениеОрганизации = Строка.Подразделение;
            НЗ.Дата = ТекущаяДата();
        КонецЕсли; 
    	НоваяСтрока = НЗ.РаботникиОрганизации.Добавить();
        НоваяСтрока.Сотрудник = Строка.Сотрудник;
        НоваяСтрока.ФизЛицо = Строка.Сотрудник.Физлицо;
        НоваяСтрока = НЗ.Начисления.Добавить();
        НоваяСтрока.Сотрудник = Строка.Сотрудник;
        НоваяСтрока.Назначение = Строка.Сотрудник;
        НоваяСтрока.БазовыйПериодНачало = ПериодРегистрации;
        НоваяСтрока.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
        Если ЗначениеЗаполнено(Строка.Сотрудник.ВидРасчета) Тогда
            НоваяСтрока.ВидРасчета = Строка.Сотрудник.ВидРасчета;
        Иначе
            НайденнаяСтрока =  ТаблицаВидовНачислений.Найти(Строка.Сотрудник,"Сотрудник");
            Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
                НоваяСтрока.ВидРасчета = НайденнаяСтрока.ВидРасчетаИзмерение;	
            КонецЕсли; 
        КонецЕсли; 
        Если ЗначениеЗаполнено(Строка.Сотрудник.ГрафикРаботы) Тогда
            НоваяСтрока.ГрафикРаботы = Строка.Сотрудник.ГрафикРаботы;
        Иначе
            НайденнаяСтрока =  ТаблицаВидовНачислений.Найти(Строка.Сотрудник,"Сотрудник");
            Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
                НоваяСтрока.ГрафикРаботы = НайденнаяСтрока.ГрафикРаботы;
            КонецЕсли;
        КонецЕсли;            
        НоваяСтрока.ДатаНачала = ПериодРегистрации;
        НоваяСтрока.ДатаОкончания = КонецМесяца(ПериодРегистрации);
        НоваяСтрока.ПодразделениеОрганизации = Строка.Подразделение;
        //НоваяСтрока.Показатель1  = Строка.Сумма;
        НоваяСтрока.Результат  = Строка.Сумма;
        сПодразделение = Строка.Подразделение;
    КонецЦикла; 
    Если ЗначениеЗаполнено(Подразделение) И НЗ <> Неопределено Тогда
        НЗ.Записать(РежимЗаписиДокумента.Запись);	
        Сообщить("Создан " + НЗ.ССылка);  
    КонецЕсли;

КонецПроцедуры
