
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗапрещенныйКОтгрузкеАссортимент.Записывать = Истина;
	Движения.ЗапрещенныйКОтгрузкеАссортимент.Очистить();
	Для Каждого ТекСтрокаАссортимент Из Ассортимент Цикл
		Движение = Движения.ЗапрещенныйКОтгрузкеАссортимент.Добавить();
		Движение.Период=Дата;
		Движение.Контрагент = Контрагент;
		Движение.Подразделение = Подразделение;
		Движение.Номенклатура = ТекСтрокаАссортимент.Номенклатура;
		Движение.ПризнакСнятия = ПризнакУстановкиСнятия;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Ответственный=глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли; 
КонецПроцедуры
