
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеПользователямиСервер.ПроверитьСинхронизациюПользователейИУстановитьОформлениеСписка(Список.УсловноеОформление);
	
	Если НЕ Параметры.РежимВыбора Тогда // Если режим подбора
		Заголовок = НСтр("ru = 'Подбор пользователей'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененПользовательИБ" Тогда
		ОбщегоНазначенияКлиентСервер.СнятьУсловноеОформлениеСпискаЗначений(Список.УсловноеОформление, "ЭлементыСправочникаТребующиеВнимания", Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СписокВыборЗначенияУстановитьОформлениеВыбранного(Значение);
	
КонецПроцедуры

&НаСервере
Процедура СписокВыборЗначенияУстановитьОформлениеВыбранного(Значение)
	
	УправлениеПользователямиСервер.УстановитьУсловноеОформлениеДляВыбранногоЭлемента(Значение, Список.УсловноеОформление);
	
КонецПроцедуры
