
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Процедура заполняет начальные настройки построителя отчетов.
//
Процедура ЗаполнитьНачальныеНастройки(ПостроительОтчета) Экспорт
	
	СтруктураПредставлениеПолей = Новый Структура;
	МассивОтбора = Новый Массив;
	
	Если БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	 ИЛИ БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
	 
	 Текст = " 
		|ВЫБРАТЬ
		|	Подразделения.Ссылка 					КАК Подразделение
		|{ВЫБРАТЬ
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|ИЗ 
		|	Справочник.Подразделения 			КАК Подразделения,
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|{ГДЕ
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|";
	 
	Иначе

		Текст = " 
		|ВЫБРАТЬ
		|	СтатьиЗатрат.ВидЗатрат 					КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат 	КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка 					КАК Подразделение
		|{ВЫБРАТЬ
		|	СтатьиЗатрат.ВидЗатрат.* 				КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат.* КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат.* 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка.* 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|ИЗ 
		|	Справочник.СтатьиЗатрат 			КАК СтатьиЗатрат,
		|	Справочник.Подразделения 			КАК Подразделения,
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|{ГДЕ
		|	СтатьиЗатрат.ВидЗатрат.* 				КАК ВидЗатрат,
		|	СтатьиЗатрат.СтатусМатериальныхЗатрат.* КАК СтатусМатериальныхЗатрат,
		|	СтатьиЗатрат.ХарактерЗатрат.* 			КАК ХарактерЗатрат,
		|	СтатьиЗатрат.Ссылка.* 					КАК СтатьяЗатрат,
		|	Подразделения.Ссылка.* 					КАК Подразделение,
		|	ПодразделенияОрганизаций.Ссылка.* 		КАК ПодразделениеОрганизации
		|}
		|";
	
	КонецЕсли;
	
	// Соответствие имен полей в запросе и их представлений в отчете.
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Подразделение", 			"Подразделение");
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение организации");
	
	Если БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	   И БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
		СтруктураПредставлениеПолей.Вставить("ВидЗатрат",        		"Вид затрат");
		СтруктураПредставлениеПолей.Вставить("СтатусМатериальныхЗатрат","Статус мат. затрат");
		СтруктураПредставлениеПолей.Вставить("ХарактерЗатрат", 			"Характер затрат");
		СтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", 			"Статья затрат");
	КонецЕсли;
	
	МассивОтбора = Новый Массив;
	Если БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	   И БазаРаспределенияЗатрат <> Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж Тогда
		МассивОтбора.Добавить("ВидЗатрат");
		МассивОтбора.Добавить("СтатусМатериальныхЗатрат");
		МассивОтбора.Добавить("ХарактерЗатрат");
		МассивОтбора.Добавить("СтатьяЗатрат");
	КонецЕсли;
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("ПодразделениеОрганизации");
	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	Если (БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуВыпуска
	 ИЛИ БазаРаспределенияЗатрат = Перечисления.БазыРаспределенияЗатрат.ПоОбъемуПродаж)
	   И ПостроительОтчета.Отбор.Количество() > 0 Тогда
	 
		КолвоЭлементов = ПостроительОтчета.Отбор.Количество();
		Для ОбратныйИндекс = 1 По КолвоЭлементов Цикл
	   		ЭлементОтбора = ПостроительОтчета.Отбор[КолвоЭлементов - ОбратныйИндекс];
			
			Если ЭлементОтбора.Имя = "ВидЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "СтатусМатериальныхЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "ХарактерЗатрат"
			 ИЛИ ЭлементОтбора.Имя = "СтатьяЗатрат" Тогда
				ПостроительОтчета.Отбор.Удалить(КолвоЭлементов - ОбратныйИндекс);
			КонецЕсли;

		КонецЦикла;
		   
	КонецЕсли;
	 
	Для Каждого Элемент Из МассивОтбора Цикл
		Если ПостроительОтчета.Отбор.Найти(Элемент) = Неопределено Тогда
			ПолеОтбора = ПостроительОтчета.Отбор.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

