
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяАрхива = Параметры.ИмяАрхива;
	Элементы.ИмяАрхива.Доступность = ЗапаковатьZIP;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		ФорматMXL  = Истина;
		ФорматXLS  = Ложь;
		ФорматHTML = Ложь;
		Элементы.ФорматXLS.Доступность  = Ложь;
		Элементы.ФорматHTML.Доступность = Ложь;
	#КонецЕсли
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КнопкаОтменаВыполнить()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОКВыполнить()
	
	Если Не ФорматMXL И Не ФорматXLS И Не ФорматHTML Тогда
		Предупреждение(НСтр("ru = 'Необходимо указать как минимум один из форматов: MXL, XLS или HTML!'"));
		Возврат;
	ИначеЕсли ЗапаковатьZIP И ПустаяСтрока(ИмяАрхива) Тогда
		Предупреждение(НСтр("ru = 'Не указано имя архива!'"));
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяАрхива",     ИмяАрхива);
	Результат.Вставить("ЗапаковатьZIP", ЗапаковатьZIP);
	Результат.Вставить("ФорматMXL",     ФорматMXL);
	Результат.Вставить("ФорматXLS",     ФорматXLS);
	Результат.Вставить("ФорматHTML",    ФорматHTML);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапаковатьZIPПриИзменении(Элемент)
	
	Элементы.ИмяАрхива.Доступность = ЗапаковатьZIP;
	
КонецПроцедуры
