
Процедура ПередЗаписью(Отказ, Замещение)
	Если ЭтотОбъект.Количество() > 1 Тогда
		Отказ = Истина;
		Сообщить("Запрещено сохранять более одной записи одновременно", СтатусСообщения.Важное);
	ИначеЕсли ЭтотОбъект.Количество() > 0 Тогда
		ТекЗапись = ЭтотОбъект[0];
		
		//ОтборЗаписей = Новый Структура("Склад, Номенклатура", ТекЗапись.Склад, ТекЗапись.Номенклатура);
		//тзПредЗапись = РегистрыСведений.АдресаХраненияНоменклатурыНаСкладах.СрезПоследних(ТекЗапись.Период, ОтборЗаписей);
		//Если тзПредЗапись.Количество() > 0 Тогда
		//	ПредЗапись = тзПредЗапись[0];
		//Иначе
		//	Возврат;
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РазмещениеТоваровНаСкладахОстатки.КоличествоЕХООстаток) КАК КоличествоЕХООстаток
		|ИЗ
		|	РегистрНакопления.РазмещениеТоваровНаСкладах.Остатки(&НаДату, Ячейка = &Ячейка) КАК РазмещениеТоваровНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("НаДату", КонецДня(ТекЗапись.Период));
		Запрос.УстановитьПараметр("Ячейка", ТекЗапись.Ячейка);
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].КоличествоЕХООстаток <> 0 Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как в ней содержится товар", СтатусСообщения.Важное);
		КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	БудущиеПеремещенияСрезПоследних.ДокументОтгрузки,
		//|	БудущиеПеремещенияСрезПоследних.НомерСтрокиПеремещения
		//|ИЗ
		//|	РегистрСведений.БудущиеПеремещения.СрезПоследних(, ) КАК БудущиеПеремещенияСрезПоследних
		//|ГДЕ
		//|	БудущиеПеремещенияСрезПоследних.ЯчейкаПланКуда = &Ячейка";
		//
		//тзРез = Запрос.Выполнить().Выгрузить();
		//
		//Если тзРез.Количество() > 0 Тогда
		//	Отказ = Истина;
		//	Сообщить("Изменение вида ячейки запрещено, так как в системе присутствуют запланированные перемещения товара в данную ячейку", СтатусСообщения.Важное);
		//КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеБлокировокЯчеекСрезПоследних.Заблокирована
		|ИЗ
		|	РегистрСведений.СостояниеБлокировокЯчеек.СрезПоследних(, Ячейка = &Ячейка) КАК СостояниеБлокировокЯчеекСрезПоследних";
		
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].Заблокирована Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как она заблокирована", СтатусСообщения.Важное);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеРезервовЯчеекСрезПоследних.Заблокирована
		|ИЗ
		|	РегистрСведений.СостояниеРезервовЯчеек.СрезПоследних(, Ячейка = &Ячейка) КАК СостояниеРезервовЯчеекСрезПоследних";
		
		тзРез = Запрос.Выполнить().Выгрузить();
		
		Если тзРез.Количество() > 0 И тзРез[0].Заблокирована Тогда
			Отказ = Истина;
			Сообщить("Изменение вида ячейки запрещено, так как эта ячейка зарезервирована", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
