
///////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННЫЕ БАЗЫ ДЛЯ ОБМЕНА
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуВозможныхОбменов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "УПП"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУППУПП"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = "Управление производственным предприятием для Украины, редакция 1.3";
	СтрокаТаблицы.ПредставлениеКонфигурации = "Управление производственным предприятием для Украины 1.3"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию = "УПП"; // Префикс по умолчанию

	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "УПП");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУППУПП");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "Управление производственным предприятием 1.2");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "УПП");
	
	Возврат СтруктураДанных;
	
КонецФункции


Процедура ОткрытьФормуВыполненияОбменаСБухгалтерией() Экспорт
			
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУППУПП.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры


Процедура ОткрытьФормуВыполненияОбменаРИБ() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.Полный.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаССайтом() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменССайтомТоварами.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаУПП() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУППУПП.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры


Процедура ОткрытьМониторОбменовДляОбменаССайтом() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = Справочники.НастройкиОбменаССайтом.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБ() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаВсе() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

// Процедура открывает настройки обмена с ВЕБ-сайтом
//
Процедура НастроитьОбменДаннымиСВебСайтом() Экспорт

	ОбработкаПомощника = Обработки.ПомощникНастройкиОбменаДаннымиССайтом.Создать();
	ФормаНастройки = ОбработкаПомощника.ПолучитьФорму("Форма");
	ФормаНастройки.Открыть();	

КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБ() Экспорт
	
	ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
	ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаCписка.Открыть();
	
КонецПроцедуры
